[
  {
    "doc_title": "Selling_Basics",
    "section_topic": "Selling Way of Life",
    "subsection_topic": "Selling Is a Prerequisite for Life",
    "text": "Selling Is a Prerequisite for Life There are an estimated 18 million people in the United States alone who self-identify as salespeople. There are car salespeople. Real estate salespeople. Software salespeople. B2B salespeople. Door to door salespeople. There are inside salespeople. There are outside salespeople. Territory salespeople. Strategic accounts salespeople. Regional salespeople. Sales engineers... the list goes on and on. That's a lot of salespeople. In fact, nearly 13% of all the jobs in the U.S. (1 in 8) are full time sales positions. But the real total of salespeople, I would argue, far surpasses that number. Why? Because in today's business environment, EVERYONE needs to be a salesperson. Selling impacts EVERYONE on this planet. Your ability-or inability-to sell, persuade, negotiate, and convince others will affect every area of your life and will determine whether you survive or thrive. Here's why: No matter what your title or position is, or what your role is in a company or team, you will at some point have to convince others of something. If you're a manager or a CEO, you're a salesperson. And the better you understand the whole cycle, the more you'll get out of your role and the more you'll get out of your employees and or company. If you're a hairdresser, or an accountant, or a dog walker, you're a salesperson. The better you are at sales, the more repeat business you'll receive, the more referrals you'll get, and the more money you'll make. Lawyers, especially trial lawyers, are big-time salespeople. They have to sell to the judge and jury. If you're a parent... talk about having to master sales! Every day is a negotiation with your kids. When they're small, you have to negotiate with them about bedtime and screentime and why three is too young to have an iPhone. When they're older, you're basically negotiating similar things, you may have to sell them on the idea that college or a career is a much better choice than joining a band and driving around the country in a VW Bus. It never ends. Concepts such as discipline, work ethic, education, good manners, and homework all have to be sold. Think of the most successful people you know. Mark Cuban. Martha Stewart. Steve Jobs (when he was CEO of Apple). Bill Gates. Oprah Winfrey. These are masters who are so good at the skill of selling that they don't even look like they're selling. Take Oprah Winfrey. She looks like she's starting a book club, but she's selling. She's so good at selling that they've coined a name for it, they call it the “Oprah Effect.” Every book she's chosen for her book club, and there's been about 80 so far, has gone on to be a best-seller. The “Oprah Effect” has generated sales of more than 60 million copies of her book club's selections. Now that's a killer salesperson. 2."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "Selling Way of Life",
    "subsection_topic": "Selling Is Critical to Survival",
    "text": "Selling Is Critical to Survival Whether you're rich or poor, male or female, on salary or on commission, you're always selling something to someone in order to advance. There is NO exception to this rule and no way to escape it. The receptionist who wants a raise, the actress who wants a part, the guy who wants a girl-all rely on selling themselves, whether they know it or not. A professional salesperson who depends on sales for his or her livelihood definitely needs to know how to sell. But these other people need to sell as well. When you're driving to work and want to get off the freeway, you have to negotiate and sell to other drivers your intention to access the off- ramp. When you go to the bank to get a loan, you'll need to sell the loan officers on why they should lend you money. When the actress goes to the audition and hopes to land the part, she'd better be able to convince the director that not only can she act, but she is the right person for the part! Even beyond your role as a professional salesperson, the better you master the skill of sales, the more you'll get what you want in ALL areas of life. A person's ability to persuade another is the ONLY thing that will ultimately ensure a position in the marketplace. Academic records, grades, and resumes won't guarantee you a promotion or advancement in life, but the ability to sell will. Smart sales managers and business owners don't always hire the most intelligent or qualified person to fill a position. Instead, they look for the person who convinces them that he or she can do the job. The best companies hire the persuasive, positive, and confident applicant hands down over the one who offers little more than a fancy resume. 3."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "Selling Way of Life",
    "subsection_topic": "Sales Success Is Business Success",
    "text": "Sales Success Is Business Success You may have figured it out already, but salespeople are a company's lifeblood. Without a successful sales team, no company will last long. Sears is a great example of a strong brand that absolutely tanked because that company didn't pay attention to its sales. People loved Sears. You'd go in there and they had the hardware and tools section, and the people who worked there were absolute masters. They could talk for an hour about why this Craftsman lawn mower was better than that one. People would come in just to see what was new, not because they were in the market for a snowblower but because it was a social thing. It was like the old general store where people stood around shooting the breeze... but that's only what it looked like. These guys were SELLING. Because maybe you didn't need a snowblower today, but when you DID need one, you went to Sears. But then the chairman and board lost sight of that. They tried to turn Sears into an Amazon with doors, the place people go for low prices, not for conversation and connection. And that was the end of Sears. Why go to Sears and pay more when you could order the same thing from Amazon and get it cheaper? Sears got rid of that comfortable feel, cut their staffing, and suddenly the customers were gone too. They lost sight of the role of the salesperson. Borders Books-remember them? They did the same thing. Borders used to be this amazing bookstore where people who loved books would go to hang out because they loved to be around books. And they hired salespeople who loved books, too, so if you needed a good book for your 10-year-old nephew or you wanted a great beach read that was like James Patterson, you could ask them and they'd recommend THREE books and you'd end up buying all three. If you just wanted a specific book, you'd go to Amazon, right? But if you wanted to talk about books with other people who love books, you'd go to Borders. Maybe you'd pay more, but you'd get the whole experience. But then they started cutting corners too. They cut staff. They hired people who didn't know the first thing about books. And suddenly they were-surprise!-going out of business. This happens in all sorts of businesses. I see it a lot in the tech space. The engineers and developers think their product is so great that it can sell itself. But that's a myth. There are thousands of companies out there with great products that no one has ever heard of. The salesperson is the front line of the business, the intermediary between the customer or client and the rest of the company. Great salespeople can drive a business's success, but it's a rare business that can survive without a talented sales team. That's why successful salespeople can often write their ticket in terms of compensation and career. There are so many people out there who do not understand, who do not believe, that sales are at the root of their success and their survival. Again, no matter what field you are in, no matter what your title is, you have to know how to sell. Believing that the skill of sales matters is the first step to becoming a great salesperson. You need to believe sales matter. You need to believe your product or service matters. And you need to believe YOU matter. PART 2: SALESPEOPLE MAKE THE WORLD GO ROUND If someone asked you to define sales, what would your answer be? Probably something along the lines of Merriam-Webster's Collegiate Dictionary's definition: “The action of persuading or influencing another to a course of action or to the acceptance of something.” That's a pretty good working definition, but anyone who's spent any time in the field will know that sales goes much deeper than that. And by unpacking what sales is at its core, we can start to understand what makes a successful salesperson. 1."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "Salespeople Make the World Go Round",
    "subsection_topic": "Salespeople Drive Entire Economies",
    "text": "Salespeople Drive Entire Economies We talked in the previous section about how sales success is business success. But it goes even farther than that: Sales success is ECONOMY success. Career salespeople are vital to the dynamics of any economy. Without salespeople, every industry on the planet would stop cold tomorrow. Salespeople are to the economy what writers are to Hollywood; things don't move forward without them! The world would stop turning without salespeople. If a product isn't sold and moved on to the public, factories stop, production stops, there's no need for distribution, no need for storage, demand for shipping is reduced, and advertising stops. The burden of the entire economy of our culture today rests on the ability of salespeople. The economic engine of society relies completely on the ability to get products into the hands of consumers. If the consumers don't buy it, the factories won't make it. Salespeople drive products, individual businesses, complete industries, and whole economies. Selling is the last great truly free-enterprise opportunity available today. In sales, you can work for yourself, be accountable to yourself, and make your dreams come true. For those who are willing to commit to selling as a career, and to continue to learn how to master it, there are no limits. All you need is a pen to sign contracts and a commitment to excel, and your future is unlimited. 2."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "Salespeople Make the World Go Round",
    "subsection_topic": "All Professions Rely on Sales",
    "text": "All Professions Rely on Sales I know without a doubt that for a person to have a great life, he or she will have to know and apply the skills of any great salesperson. You can hire a doctor, a lawyer, or an architect. You can get by without knowing how to set a broken ankle, prepare a contract, or design a house. But you cannot get along in life without the ability to communicate, persuade, negotiate, and close a deal. These skills give you the ability to write the ticket for your future. Rather than being an hourly worker bee, you can become a highly paid individual with no ceiling on your earning potential-but you have to know how to sell. Spend time with a leader in any profession-engineers, bankers, actors, film directors, you name it. Every one of those people had to build a career around selling to get to the top of their industry. Of those top producers, virtually every single one studies books on negotiating, selling, and persuading. Why? Because they understand that those skills are vital to their success. As we discussed earlier, every person, no matter what profession they're in, relies on selling. Politicians want to appeal to you and your interests so that you'll vote for them in the polling booth. Public speakers are hoping to convince you that their approach is the right one. Employees desiring a promotion will have to sell the boss on their value to the company. The coach has to sell his or her team on the idea of winning the game. Real estate agents must convince you to buy a house or give them the listing. The mortgage lender wants you to refinance for the third time. The banker wants you to invest money in the bank's mutual funds. The waiter is selling the special of the day. The clothing salesperson wants you to buy the suit along with three shirts and two ties... and also wants you to apply for the department store's credit card. Selling never, ever ends, and it includes everyone. Those who can sell, persuade, and close are the ones who survive best, regardless of the line of work. No person will ever gain true power and stature in the world without the ability to persuade others. The ability to communicate and convince others is an asset for you; the inability to communicate is a liability. No matter what your ambitions are, you are required to communicate with others, and the better you can communicate, the more people will agree with you. The more you can get others to agree with you, the more you can have your way in life. The more you get your way in life, the more you will enjoy life. 3."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "Salespeople Make the World Go Round",
    "subsection_topic": "Beware of False Data",
    "text": "Beware of False Data You might be wondering why we're spending so much time on this issue of the importance of sales in the economy, in your company, and in your life. It's because so many people have fallen into the world of sales by accident rather than by choice. And as a result, they don't fully believe in the possibilities of sales, or in the importance of the profession. This is where I want to warn you about the power of false data. The subject of selling, like any subject, is full of false information that has been perpetuated over the years. These false data may be partly responsible for the poor impression of this profession and much-needed life skill. “False Data” is information that is not factual but is accepted as truth and passed along. People tend to form opinions, give advice, and pass on myths when they don't actually have any personal experience. Much of the data they pass along hasn't been fully inspected for truth even though it's been passed along as truth. This occurs with sales, and it has given the whole profession and the skill itself a bad name. People continue to pass on the false information that selling is hard, that it's difficult to depend on commissions, that selling is sleazy, that you'll have to work long hours, that it isn't a dependable profession, that you can't rely on the income, and that it's not considered a “real job.” It's a shame, because selling, as we've said, is the one profession where you can write your check and determine your future. Most of the perceptions people have-and maybe even some that you have-are rarely based on reality. If you believe the wrong things about this profession, you're going to undermine your own belief in the importance of your role. And when you don't believe what you do all day matters, how good are you going to be at it? Let's say you're a dental hygienist, one of those dedicated heroes who spends all day in other people's mouths, scraping away the plaque and trying to convince people to floss. But if you don't really believe that brushing your teeth twice a day and flossing really matters, how good are you going to be at convincing others of it? Lousy, right? Let's say you're a high school math teacher. Let's make it even better- you're a geometry teacher. But you honestly think geometry is a complete waste of time. Are you going to be able to teach your students with confidence and conviction that they need to know this stuff to make their lives better? Teenagers have built-in lie detectors, and they'll smell you out a mile away. No way can you convince them of something you're not convinced of yourself. The same will be true with your clients and customers. You must believe in your product, your company, and yourself to make the sale. In upcoming sections, we'll dive deeper into the importance of belief and commitment, and how without them, it will be impossible to achieve your goals. PART 3: PROFESSIONAL OR AMATEUR? As I mentioned previously, selling doesn't need to be your primary career in order to become a great salesperson. In fact, I know some businesspeople whose job function is not “sales,” yet they're better salespeople than those who are hired to sell. Just because your business card says “sales rep” or “sales manager”, it doesn't make you a professional. In the sports world, a professional is, for the most part, someone who gets paid to perform, while an amateur doesn't. That distinction is somewhat blurry, but it still holds weight. And it carries over to the sales world as well; professional salespeople make more money than amateurs. But that's not where the differences end. 1."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "Professional or Amateur?",
    "subsection_topic": "The Professional",
    "text": "The Professional A professional is a person who is engaged in a specified activity as his or her main paid occupation rather than as a pastime. It's been my experience that 99% of all “professional” salespeople have only a slight idea of what selling is, much less how to actually determine and predict results. Have you ever seen someone who produced four or five times more than the average person? The way they think is different. The way they act is different. They work different, they have different habits, even their customers are different. Their responses are different, and therefore, the results are different too. It's easy to sit back and say, “Well, they're just a natural salesperson,” or “They're just lucky. They get all the good leads.” But believe me when I say that people who are great aren't born great. They have paid immense fees of energy and effort, and have invested hours, upon hours, upon hours, (to achieve that success). When you're born, you're not born a salesperson. You're born a baby. Great salespeople believe in the power of sales to help them reach their goals. They have made a decision to motivate themselves, to learn everything they can, and they are committed to their craft. And this process never ends. Professionals also believe in themselves. They know that sales gives them unlimited opportunity, and they own the fact that it's their own efforts that will determine how high they fly. They don't blame fate. They don't blame God. They don't blame their company, or their sales manager, or the weather, or the economy. They take 100% responsibility. 2."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "Professional or Amateur?",
    "subsection_topic": "The Amateur",
    "text": "The Amateur An amateur is a person who engages in a pursuit, study, science, or sport as a pastime rather than a profession, or one lacking in experience or competence in an art or science. Most salespeople are actually amateurs who don't know the first thing about selling. Maybe you've encountered some of these people, either when you went to buy a new phone, a new car, or a new house. Or maybe you know you-yourself-are less than a professional. Is selling just a pastime to you, no different than watching television? Do you lack experience and competence in this field? Are you not clear about what you're doing while negotiating? Do you struggle to get your way in life? Do you have a secret disdain for this thing called selling? Do you hate rejection and even the idea of selling another? Do you think great salespeople are just born that way? Quit thinking it's up to fate, or the Universe, or God. God's got his hands full! Don't count on Him to get you a deal today and help you meet quota. It's up to you-your very life and dreams depend on it. If you're not getting what you want, quit making excuses and decide now to learn everything there is to learn about becoming a professional. That's what takes you out of amateur status-a desire to be great, not average. A desire to be incredible, and the dedication and willingness to learn the skills you need. Great salespeople know their income depends only on one thing: Their ability to generate customers, to make themselves known in the marketplace, to get agreements from people, to close sales, and then to reproduce those results over and over again. If you can do that, I assure you, your future is only limited by what your imagination will allow you. And speaking of your imagination... professionals know they have to get their minds right. They know that it all starts in the brain. You can't outperform your internal limits, which is why Grant and our courses here at Cardone University spend so much time on mindset. What we want to do is to convince you to be great. Give up the mediocre, the poor results, the excuses. I want to help you dig in and be great. To do that, you have to convince yourself that this is your field, your chosen profession; that selling is the skill that you have to learn to get what you want in life, and that this thing called selling can make you rich. If you are willing to do that, then welcome aboard. Let's buckle down and get to work. 3."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "Professional or Amateur?",
    "subsection_topic": "The Great Shortage",
    "text": "The Great Shortage For thousands of years, wealth has been amassed and riches have been accumulated by salespeople. Those same opportunities still exist today. This segment's about getting you to realize the world isn't coming to an end. Forget about Artificial Intelligence. Forget about companies going direct to consumer. There are still opportunities for great salespeople- and there always will be. Unfortunately, a lot of people-and maybe even you-believed the media when it talked about how there would only be somewhere in the neighborhood of 3 million sales jobs in 2020. Fake news, right? People still overwhelmingly want to buy from people, not from machines. Take Carvana, the giant car vending machine. It's marketed as the first automated, coin-operated car vending machine in the U.S. It's cool. It's eye- catching. It's a gimmick. Because are you really going to drop $15-20K on a car without talking to a real, live person first? In fact, here's how it really works. You don't drive up to the thing and put in $15K in quarters and get whatever car is available. Instead, the cars that are prestocked in the machines have ALREADY been selected and purchased. It's not really an automated vending machine; it's an automated DELIVERY machine. You can go through the car search and purchase process online, but there's a big phone number on each page in case you have questions. Because many, many people want to talk to someone before they make a purchase that big. So don't believe people who say the sales profession is dying. I assure you there is a vast shortage of highly committed, highly dedicated, great salespeople. And when there's a shortage -and you can fill in that shortage- you become valuable. This is good news for those who choose to be great at their job. The world is like a treasure chest of opportunity, just waiting for great salespeople to open it. The key in being eternally employable lies in creating value. If you can always create more value for your employer than the amount they pay you, you'll always have a job. The truth is you can get paid whatever you want. There is no ceiling, but you have to learn the trade. Remember, there's a great shortage, right? So if you filled in the void, and separated yourself from the masses, the mediocre, then you can choose what products you want to sell, who you want to sell them to, who you want to work with, what part of the country you want to work in, what your pay plan is going to be, and when you come and go. That's where we want to get you. Truly great salespeople stand head and shoulders above the rest, above the mediocre. They're not even in the same profession as most salespeople. They think different, and that's what we're going to get into in the next sections. PART 4: THE GREATS Now that we've explored the basics of sales-why sales matter, what sales are, and the differences between a professional and an amateur-it's time to dive into the specifics that will help you become a better salesperson. Even better, how do you become one of the greats in your field? The first step is to commit ALL THE WAY. We've talked previously about sales being a commitment. I want to dive into the concept of commitment more deeply. In fact, we've dedicated a substantial part of this training to the topic of commitment because it's so extremely important. 1."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "The Greats",
    "subsection_topic": "Commitment",
    "text": "Commitment We said in the last section that success all starts in your mind, and that's where we're starting this section... with the one critical decision that will set you apart: Commitment. This inescapable truth, commitment, is required for ANYONE to be truly great at ANYTHING. So let's look at what commitment is: Commit: To devote oneself completely to something. The inescapable truth is that to be truly great at anything, you must devote yourself completely. If you are a career salesperson, you have to devote yourself, your energy, and your resources to a career in selling. So how does a person commit? What I do is eliminate any and all other options and devote myself to learning everything I can about the topic. Grant calls this becoming a Super Freak. And if you've ever seen him in action, you know what that means. You've got to stop questioning and go all in. You've got to stop looking for other options. If you've ever made a real commitment before, you know it's actually a freeing action rather than a restrictive one. Here's what I mean. Every single day there are unlimited calls on your time and resources. In this day and age, we can pretty much do, or be, or have anything we're willing to really work for. Want a private jet? Work very hard and buy one. Want to own the Mavericks? There's no law against it. A little kid today can grow up to be an astronaut, the president, a janitor, or work the counter at 7-Eleven. In other times and in other cultures right now, this wasn't the case. People were destined to a particular track in life because it was what their parents did, or because of the social class they were born into, or because of their color, or gender, or whatever. We have untold freedom of opportunity and mobility. We can be what we want, go where we want, hang out with who we want, and spend our money on what we want. But all this choice comes at a cost. Research shows that the more choices someone has, the less satisfied they are with the choice they do make. It's like we're constantly looking at what we could have done and wondering if we would have been happier in Toledo or Toronto, or thinking, \"Perhaps, I should have gone to law school.\" The solution to this constant second-guessing is to make a commitment. You lay it down. You say, this is what I'm doing, and that's it. It begins with a decision, and then once you make that decision, you're free from the other options. They're no longer on the table. You're in. That's freedom-freedom from doubt, freedom from wasting your time thinking about what could have been. If you're average right now, mediocre, if you don't like the results you're getting, understand you made a decision to do that. It's not mommy's fault or daddy's fault or your manager's fault, it's not the way you were brought up. It's because you haven't made a commitment-a decision-to be more. Committing means making a decision-a firm and final decision. Think about commitments people make in life. The one that typically comes to mind is marriage, because it's one of the biggest commitments many of us will ever make. But what's the divorce rate in this country? Something like 50%? What kind of commitment is that, really, if half the people are headed for splitsville? The problem is that their commitment wasn't 100%. In the back of their mind, there was an out, an option that if things don't work out, they can always get a divorce. Now, I'm not trying to point the finger at anyone here who's been divorced. It's nothing anyone ever wants to have happened. I don't know your particular situation, and you may have been married to the guy or gal from hell... I get that. What I'm trying to point out is that the definition of commitment is to devote yourself completely to something. Remember that. Write it out and put it on your desk: “To devote oneself completely to something.” You've got to devote yourself all the way. Since we're talking about selling, then that means you've got to devote yourself to what? You have to devote yourself, your energy, your resources to a career in selling. That means you need to think, eat, breathe, read everything, and consume everything you can on this thing called selling. You have to convince yourself that this is your field, your chosen profession. This is what you're dedicating your energy and your time to. This is how you get to where you want to go. You dig in all the way. What you have to do when you commit is eliminate all other options, and then you can devote yourself completely to this one avenue. That's the only way. You may think it sounds like being a fanatic, well, fine, be a fanatic. You're going to exhaust that one avenue, not go looking for three or four other ways. Think about parking your car. When you park a car, do you get confused? Do you say, “Oh there's a parking spot, there's one, there's another, what about that one? Which one do I choose?” No, you pull in, you park, you get out. You don't keep thinking, “well, maybe I should have chosen the one in the second row...” But some of you do this in your relationships or in your jobs. Then you wonder why things don't work out. It's because you keep looking for something better or something different. That doesn't work. Instead, you choose, you go all in, and you follow through. 2."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "The Greats",
    "subsection_topic": "Greener Pastures",
    "text": "Greener Pastures Once you finally commit, you stop looking for other options. Instead, you dig in. You commit to your career, to your company, to your customers and clients. You've heard that saying about “The grass is always greener on the other side of the fence.” That's human nature, to look at what other people have and are doing and think they've somehow got it better than you. You know where the grass is greener? The grass is greener where people are mowing and watering it. Wherever you go, you have to mow the lawn. Weeds are everywhere. Take care of your own lawn. That's your career we're talking about! If you're looking at someone else's pasture-at another job-what the heck are you doing? Commit all the way. Fortify yourself. If you're going to be wrong, be wrong all the way. If there are weeds in your grass, they grow because you're not committed to taking care of them. You're neglecting your career. You're neglecting your clients. You're neglecting your chosen path. You're neglecting what you're doing RIGHT NOW in this moment by never fully committing to it. Some of you are doing that right now-you're thinking about something else. You're checking your phone. You're answering emails, or doing a crossword puzzle, or whatever. What are you doing? How you treat this training, right now, is how you're treating your business and your career and probably your family and your health too. And when you neglect anything, you'll start to dislike it. You'll start looking for something better. A better house, a better job, a better car, a better spouse... Has this ever happened to you? You think, we need to move, this house is too old, or too small, or I don't like the kitchen, or whatever. So you meet with a real estate agent and they tell you all the things you need to fix so you can get the best price for your house. You declutter everything, you replace the rugs in the bathroom, maybe you paint and rearrange some stuff and plant flowers out front, and pretty soon you're like, “Hey, this place looks pretty good. I'm not sure I want to move.” What happened? You started to pay attention. You looked at all the places you'd been neglecting at your home, like the garage door opener that didn't work, the dead flowers on the side yard, and the paint scratches where the kids ran their bikes into the wall. All those things you'd been neglecting. And once you fixed them, you fell back in love with the place. This neglect can happen to your house, to your marriage, to your job, and all it takes to correct it is to start tending your own grass again. Watch how green your pastures get. 3. The Only Reason You Won't"
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "The Greats",
    "subsection_topic": "Like Selling",
    "text": "Like Selling There's only one true reason why someone doesn't like selling. Do you know what it is? It's not what you might think. It's not because someone doesn't like rejection. After all, who does? It's not because they're lazy. People who are avoiding failure or being rejected are going to be lazy. It's not because they don't like people. We all like people when we're successful with them. The only reason someone doesn't like what they do is because they don't KNOW what they are doing. You won't win at something you don't understand. The doctor who can't save lives won't like being a doctor. The teacher who can't get his or her students to learn will, sooner or later, become disenchanted with teaching. A salesperson who can't close deals won't like selling. And that's the only reason you would not like being a salesperson. When you don't understand something, you aren't in control, and when you aren't in control, you won't like what you're doing! The more you know, the better you'll do. And the better you do, the more you'll like your job. I've never seen someone who reached stellar levels of success in any field who got there because of luck or some sort of God-given talent. They're successful because they mastered their trade. The same is true for sales. Great salespeople have made a commitment to become great. Only a handful of people around you, in your team, in your industry, will make a commitment to becoming the best they can be. I'm not talking about passively watching a few training videos; instead, I'm talking about rolling up your sleeves and immersing yourself in the world of sales. Reading books. Taking courses. Doing the work. If you want to be great at sales, you need to consume as much as you can. You need to be dedicated and committed to your future, to the solvency of your household, to the financial security of your spouse and your kids. While motivation is great and necessary, and enthusiasm can be a great enhancement, there's no replacement for knowing your job. Tiger Woods did not become great by being enthusiastic about golf. Instead, he KNOWS the game of golf. He knows what he's doing, every nuance, every little crevice and crack, consideration and possibility, and technique. And as a result, he doesn't have to be enthusiastic. His commitment to mastering his craft is what has carried him to his level of success. To become one of the greats, you have to practice, not just play. PART 5: THE MOST IMPORTANT SALE In this segment we're going to talk about the most important sale you can ever make. It ties right into commitment. It's all about selling yourself. 1."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "The Most Important Sale",
    "subsection_topic": "Selling Yourself",
    "text": "Selling Yourself If you don't believe, no one else will. Here's what I mean: To the degree that you're sold, convinced, persuaded, you will sell. This is a vital and critically unavoidable fact that cannot be missed if you want to become great at your trade. This fact also happens to be one of the most important tools you'll ever have as a salesperson, and can be used to actually monitor the results of your career. The bottom line is, if you're not selling, to some degree you're not sold. I want to say that again. If you're not selling, if you saw your production drop, immediately understand, “Hey, I'm not sold on something.” If your sales are slowing down, there's something happening. “It's not traffic. It's not your competitors. It's not the economy. No. You got sold on something else and are now unsold on what it takes to get results. If you're not getting your way, if you're not achieving your goals, you're not sold. If you've got any excuses about it, I promise you you're just not completely sold. In order to become great, I mean GREAT, a master at selling, you have to sell yourself on what it is you're selling. Make this the single most important sale of your life and keep making that sale. It's not something you do one time. You've got to keep reinforcing what product you're selling, the company you're selling, you. I know salespeople who know the game but who are not completely and absolutely sold on their product, service, or company. Because of their lack of conviction, they are not consistent producers. You've got to convince yourself that your product, your company, your services, your ideas are superior to all others. You have to be 100% certain that what you're selling is better than all other options. The fraud-the guy or girl who doesn't believe his or her product is superior- can't get consistent results because he or she is not completely sold on that product. You have to be utterly convinced and believe in what you're selling so strongly that you become unreasonable about it-even fanatical! You have to be so convinced that you won't even consider that anyone else could even compete with you. When you believe at this level, you can get more money for similar products than your competitors, because you believe so strongly in your service, your level of care, and the superiority of your products. You may even sell products that are priced higher than your competition because you believe so strongly in the value. You're so convinced of the product's worth that you would pay the higher price to have it! 2."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "The Most Important Sale",
    "subsection_topic": "Conviction Is the Make/Break Point",
    "text": "Conviction Is the Make/Break Point Have you ever sold something-your home, a car, yourself to an employer- for a price higher than what the market was paying at the time? Maybe you believed your house was worth more than what the real estate agent said because of its unique view or location. Or maybe you negotiated for a higher salary than others in your position, because you were so convinced of the value you could bring to the company. Once you become convinced of the value, you can convince others too. But if you don't believe first, they never will! The conviction you have regarding your product is more important than the conviction that others have about their facts and figures! Are you familiar with the definition of the word “conviction?” It is defined as “a firmly held belief.” It comes from the word “convince,” which is derived from the Latin word “convict,” which means, “to conquer.” Conviction is the ability to be so solid and firmly sold on your beliefs, that you demonstrate to your buyers with such complete and utter certainty that they see no other choice but yours. A sale is made when your conviction and belief about something are stronger than somebody else's, at which point the other person gives up some of his or her conviction. That's the moment when the sale becomes possible-that's the make/break point. The real issue isn't the product or service at this point; the issue is who is more sold- or convinced-on what he or she believes to be true. Who is the most believable and convincing? It will always be the one who is the most sold on his or her product or service! A highly trained U.S. Army Ranger is so deeply sold on his mission and so sold on the cause and purpose that he's able to do things that appear superhuman to others. He's 100% convinced of the need to perform at this level-and so he does. Why? Because he's sold on the mission! He doesn't have to think about it. He's already decided. He believes in it to his very core, and because of this, he's able to do the impossible. People will always tell you your dreams and goals are impossible. Alexander Graham Bell. Elon Musk. Steve Jobs. Gymnast Gabby Douglas. All these people were told their dreams were totally impossible. But here's the interesting thing about the impossible. It's only impossible until someone makes it possible! Look at photography, flight, space travel, email, the internet, a sub-4-minute mile, and on and on. All of these things were once considered impossible-until someone became sold on them being possible. Why is it that some people do things that others wouldn't dream of doing? Because they're convinced. They're sold on the idea that it needs to be done, and it CAN be done. To the degree that they are sold and become unreasonable in their quest, they will succeed. Stop thinking about being reasonable and sensible. The world was never changed by people who were reasonable! These characteristics will not serve you in sales, or in life. If you want something great to happen, you've got to be unreasonable. You have to be completely and unreasonably sold on yourself, your product, and your ideas. 3."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "The Most Important Sale",
    "subsection_topic": "Put Your Money Where Your Mouth Is",
    "text": "Put Your Money Where Your Mouth Is Here's a simple way to test if you are sold yourself. You may say you have 100% commitment and belief. That's great. Here's a simple, objective way to tell: Do you use your own product? If you wouldn't buy the product or if you have any negative considerations about how it benefits others, you cannot succeed beyond your degree of doubt. You MUST be sold. You must get rid of all negative considerations and believe that it's the right product for the person you're selling, and that it will benefit them. You might ask yourself, “But what if I'm not convinced that I have the best product or the best service?” Then get convinced, and do it right now! Do whatever it takes to believe that you're offering the greatest product and the greatest service. Find the plus points and sell yourself on them completely. Should you lie to yourself? Of course not, but you've got to get yourself sold no matter what! Rather than lying to yourself, a better alternative is to do what a champion does: Champions decide to win the game with what they have to work with. They don't change teams. They make the most of the assets and strengths available to them. They play the cards they've been dealt and they make the most of the pot. They don't lie to themselves; they convince themselves that the only solution is winning, and they commit to one outcome only-success! One time, a buddy of mine was trying to convince me to go in on a big deal. He said the investment was a sure thing, and a great opportunity. But something just wasn't ringing true to me. I wasn't convinced because HE didn't sound convinced. It wasn't the deal that was the hold up as much as it was HIM. Something was just off. So finally I asked, “How much of your money have you invested?” You can guess what the answer was: ZERO! Of course, maybe he didn't have enough money... but if the deal was THAT good and THAT much of a sure thing, wouldn't he have done whatever he could to get in on it? As you can imagine, I passed on this “golden opportunity.” What are you going to tell your prospects when they ask you if you drive the car you're selling, live in one of the houses you're selling, own stock in the fund you want them to invest in? You better be able to tell them YES! By owning the product you're selling, you're demonstrating your certainty to others by your actions, and actions speak way louder than words. You have to be so sold that you use your own product, consume your product, and sell your product to your loved ones. Otherwise, you're just a mercenary, selling for whoever pays you the most. A finance and insurance salesman came to us for help because he was having trouble selling his products. When we asked him which finance and insurance products he owned himself, he chuckled and said, “None!” He went on to explain that he didn't want to spend the extra money on them. Well, that's not totally accurate. The truth is he didn't spend the money because he didn't think it was worth it. If you were completely sold on the value of something, you wouldn't concern yourself with the money. You'd buy it! No wonder he was having trouble making his numbers. He wasn't convinced, so how was he going to convince someone else? If you're having a similar problem, the answer is simple. All you have to do is buy and use the products you sell and then watch your sales go up. To the degree that you're sold, you'll take action. And to the degree that you take action, you'll be successful at selling to others. Become so thoroughly sold on your product that your conviction is irresistible to others, that you believe it would be a terrible thing for the buyer to do business anywhere else with any other product. Of course, I don't mean you should lie to yourself. What I'm suggesting is that you take the time to sell yourself before you try to sell someone else on how your product is superior to others. Go into an Apple store and ask anyone who works there how much they like their products. It's always a love fest. They'll go on and on about their Apple Watch, their Apple TV, their Macbook, their iPhone... it's like a religious movement, they believe so deeply in their products. You need to be at that level of commitment, conviction, and belief. If you won't buy it yourself, then you're not sold yourself! It's that simple. PART 6: MASSIVE ACTION Most people incorrectly estimate the amount of effort it takes to get the results they want. They think about being balanced, or what is reasonable. That is a losing mentality. Instead, you need to think in terms of MASSIVE ACTION. Whatever you think is needed to get the job done, increase the amount far greater than you think is necessary, and you'll get results beyond your wildest expectations. In this section, we're going to dive into what it means to take massive action. If you want to make your dreams come true, if you want to become great at what you're doing, it's going to take work. But when it comes to getting big results and becoming wildly successful, you have to take action in that direction in massive quantities. There's no way around it. 1."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "Massive Action",
    "subsection_topic": "The Four Kinds of Action",
    "text": "The Four Kinds of Action You can never take enough action in life; you can only take too little. Too much action will never get you into trouble. In fact, taking action is the way to get out of trouble. The only time action will cause you trouble is when there isn't any or when there's not enough of it. If you've ever been in trouble, you ask yourself, “What do I need to do right now?” If you're trying to solve a problem, you ask yourself, “What do I need to do?” That's action. It's been said there are three kinds of action in life: 1. The right action. I did the right thing and I got the result. You studied an average amount for the test, and you got an average grade. 2. The wrong action. I did the wrong action and I didn't like the outcome. You studied a little bit, or you studied the wrong thing, and you got a mediocre grade on the exam. 3. No action. I did nothing, and I got nothing. You didn't study at all, and you failed the exam. Now, we believe in a fourth action: 4. MASSIVE action. That's the one you want to live by! This fourth action is by far the action that will prove that you get results. It will make you successful. No matter what your skill set, it will allow you to produce at a higher rate than others. If you ask super- successful people what one thing has made the most difference in their life, it's going to be taking massive action, even when they had no clue what they were doing! For instance, if you want to buy an investment property, you don't go to one lender for a loan; you go to three or four, or even five or six. If you want coverage in the newspaper, you don't call one, you call ten, and you call them again and again. Let's say you're giving a party and you want 250 people to show up. How many people do you invite? It's gotta be more than 250, right? And you can't trust the RSVP, especially these days. So how do you prevent an empty house and a lame party? First, you invite way more people than 250... like 750. Then you call them and remind them. It's better to have too many people than too few! I bet you can see how this carries over to sales. You need to apply massive action. Way too often, people are working the phone and they make a few phone calls, send out a few emails, and then take a coffee break. Then they sit down and talk to each other about how business is slow and how the phone and prospecting don't get them results. If you work the phone properly, you'd know that it's not the phone that works; it's the person ON the phone who's working. Don't sit down to make one phone call. When you sit down to use the phone, do it with enough tenacity and with such massive quantity that you KNOW you're going to get something in return- guaranteed. Don't sit down to make one phone call. Sit down to make 40 phone calls. It's not how smart you are or even how trained you are that makes the biggest difference; it's the action you take. Never put your trust in one situation. Take massive action, work on multiple fronts, and then you'll always end up with a solution. Take massive action all the way to the end. 2. Massive Action = New Problems How do you know if you're taking enough action? Here's one way to tell: Your problems have changed. For instance, let's say you want to fill your calendar. That's your problem right now, not enough appointments. You need to take massive action until your concern is no longer whether or not you'll get enough appointments, but how you can possibly handle all of the appointments you have. That's a new problem! Your concern is no longer whether or not you'll get appointments; your concern has to shift into a new problem in order for you to have taken enough action. You have to take so much action that it results in a new problem. You get on the phone, because you need an appointment. You get one appointment for today at 2 pm-and the appointment doesn't show. Is that an old problem or a new problem? Old, right? You've had it before. So that means you have to take more action. So here's what you do: You make enough phone calls until you have two or three people coming in at 3 pm. That's a new problem- three people showing up at the same time. That's the kind of problem you want! Think about a seminar. The old problem is that you want to have enough of a crowd there. The NEW problem would be you have so many people show up, there aren't enough seats. That tells you that you've taken enough action! Doing too much will never fail you, but doing too little ALWAYS will. When you're a younger or newer salesperson, you might not be perfect or polished- and that's okay. IF you're willing to take massive amounts of action. When you get the volume going, you don't have to be perfect. In fact, you'll never become polished if you only have a handful of opportunities. You've got to practice to improve. The more action you take, the more business you'll have, and the better you'll get at your job. Most people don't get enough in life because they never do enough. It's not bad luck. It's not the market. You're just not taking enough action. Production is what results in happiness. It makes you feel good. And the way to produce is to take massive action. People who produce feel good. Massive action is the single thing that will guarantee you increase success, more so than any other single thing you can do. If you want to guarantee that you achieve X, take massive amounts of action that will achieve it in abundance. Your problem will no longer be how to achieve an abundance of X. Instead it will be how to manage the abundance of X. By taking enough massive action, something will be changed, something will be created, and results will be attained. And when those around you tell you you're working too hard and you need to slow down, that's a sign that you are on the right track. Ignore them and keep producing! Don't quit until you get new problems-problems like taxes, cars, homes, and where to go on vacation. 3."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "Massive Action",
    "subsection_topic": "Massive Action = New Problems",
    "text": "How do you know if youre taking enough action? Heres one way to tell: Your problems have changed. For instance, lets say you want to fill your calendar. Thats your problem right now, not enough appointments. You need to take massive action until your concern is no longer whether or not youll get enough appointments, but how you can possibly handle all of the appointments you have. Thats a new problem! Your concern is no longer whether or not youll get appointments; your concern has to shift into a new problem in order for you to have taken enough action. You have to take so much action that it results in a new problem. You get on the phone, because you need an appointment. You get one appointment for today at 2 pmand the appointment doesnt show. Is that an old problem or a new problem? Old, right? Youve had it before. So that means you have to take more action. So heres what you do: You make enough phone calls until you have two or three people coming in at 3 pm. Thats a new problem three people showing up at the same time. Thats the kind of problem you want! Think about a seminar. The old problem is that you want to have enough of a crowd there. The NEW problem would be you have so many people show up, there arent enough seats. That tells you that youve taken enough action! Doing too much will never fail you, but doing too little ALWAYS will. When youre a younger or newer salesperson, you might not be perfect or polished and thats okay. IF youre willing to take massive amounts of action. When you get the volume going, you dont have to be perfect. In fact, youll never become polished if you only have a handful of opportunities. Youve got to practice to improve. The more action you take, the more business youll have, and the better youll get at your job. Most people dont get enough in life because they never do enough. Its not bad luck. Its not the market. Youre just not taking enough action. Production is what results in happiness. It makes you feel good. And the way to produce is to take massive action. People who produce feel good. Massive action is the single thing that will guarantee you increase success, more so than any other single thing you can do. If you want to guarantee that you achieve X, take massive amounts of action that will achieve it in abundance. Your problem will no longer be how to achieve an abundance of X. Instead it will be how to manage the abundance of X. By taking enough massive action, something will be changed, something will be created, and results will be attained. And when those around you tell you youre working too hard and you need to slow down, thats a sign that you are on the right track. Ignore them and keep producing! Dont quit until you get new problemsproblems like taxes, cars, homes, and where to go on vacation."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "Massive Action",
    "subsection_topic": "The 10X Rule",
    "text": "The 10X Rule Hey let's suppose you want something-an account, a certain income level, to lose 10 pounds. How much action do you have to take? What is considered “massive action?” Here's our rule of thumb: Figure out how much effort you think you'd need to take, or that the average person would take, to achieve that goal. Then take massive action equal to at least TEN TIMES what you think it will take. This is the 10X rule. If you take 10 times more action than you thought was necessary, would you be certain, guaranteed to get that one thing to achieve your goal? This is how you want to start operating. Look, if you do 10X of what you think it's going to take, you can give up hope. You won't have to hope! You won't have to wish, cross your fingers like a little seven year old. You won't have to depend on others anymore and you won't have to pray for what you want. What you want-and far more-will come to you when the right amount of action-10X Action-is created. Think about the salesperson who goes on and on about the bad luck he's having. Maybe you know someone like this. Or maybe YOU'VE been this person. His appointment canceled. A buyer backed out. Another customer had to change his order. Another buyer couldn't get financing. On and on and on. You know what the problem here is, right? It's not bad luck. It's not misfortune. It's not the economy. It's that the salesperson doesn't have enough in his pipeline. If he took ten times more action than he had been doing, he would have no time to even think about these so-called misfortunes and would have actually WELCOMED someone canceling, as it would have been a relief to get a break instead of a misfortune. If you take enough action and are getting results, then it's not a big deal when an appointment cancels or a buyer backs out. Your massive action, your 10X action, is a safety net. You won't freak out when one appointment cancels or one buyer backs out or when you can't get funding or you don't get the listing because you've got backups. If you take small amounts of action, what's going to happen? You get small results. Then every time you lose that one appointment or that one deal, you're going to start stressing out and moaning about misfortune, bad luck, etc. because you're so dependent upon that one deal. You don't have anything to replace that one deal with. Why? Because you didn't take enough action. You put too much attention on too little. Your attention needs to be on massive amounts of action knowing that if you take enough action you're going to get results. Grant in particular is known for this. It's like his calling card. I once saw Grant call a client over the course of three days; he called this client 15 times without getting an answer. He texted him, called him, emailed him, sent him video clips, you name it. I was starting to get a little anxious. I said, “Grant, do you think that's too much? Are you overdoing it?” He said, “No, I don't think that's too much, in fact, if anything, it's not enough because I haven't gotten a result yet.” The lesson here: Never be reasonable when it comes to taking action. If you want to get something done, keep taking action-extraordinary, unreasonable levels of action. Massive action. 10X action. Think about what a reasonable person with their mediocre results would get, and then 10X it. Let's say a realtor wants a listing. Should he or she call 100 people or one or two? If you want appointments, call every friend you have, call every past client, stop people on the street, do whatever it takes. Be without sanity, or logic, or reason when it comes to taking massive amounts of action and you'll reach heights that others never dreamed possible. Massive action equals new problems, this will equal massive sales and massive results. PART 7: PUTTING IT TOGETHER: YOUR 90-DAY MASSIVE ACTION PLAN So here's where we are so far: We've talked about how selling is a prerequisite for life, and not only does sales success = business success, your ability to sell actually determines your ability to survive and thrive in today's world. We distinguished between a professional salesperson and an amateur, and we talked about how the best salespeople will never be out of a job, because there is always a shortage of people who have mastered the skills involved in sales. We discussed what it takes to be great in your field, and how the key to your future is the commitment to your path. Then we dove into the most important sale of all: Selling yourself, over and over again. Finally, we introduced you to the topic of MASSIVE ACTION, and Grant's 10X Rule not only for sales, but for life! You learned how the key to your success is taking 10 times what might be considered “reasonable” action. Why? Because we're not after “reasonable” results, we're after greatness! Now, in this final section, we'll pull it all together. We'll take these previous sections and put them into a massive action plan for your next 90 days so you can take the next step on your personal path to greatness as a professional salesperson. Ready? Your Massive Action Plan for the next 90 days can be broken into three parts:"
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "Putting It Together: Your 90-Day Massive Action Plan",
    "subsection_topic": "The 10X Mindset",
    "text": "The 10X Mindset, or how you're thinking."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "Putting It Together: Your 90-Day Massive Action Plan",
    "subsection_topic": "The 10X Plan",
    "text": "The 10X Plan, or what you think you're going to do, and finally the 10X Execution, which is when the rubber meets the road and you actually go DO the things you've been talking and thinking about. Let's start at the foundation, with your 10X mindset. 1. The 10X Mindset We've talked previously about the importance of getting your mind right. If you don't believe in yourself, in your product, and in your company, then you're not going to be successful, period. Think about any successful professional athlete who's interviewed before the big game. Tom Brady before the Super Bowl. Steph Curry before the NBA finals. Tiger Woods before the Masters. Carli Lloyd before the World Cup. When they're interviewed, what do they express? Absolute commitment. Absolute certainty. Absolute confidence. They're all in. Just imagine seeing one of these athletes interviewed on ESPN and the announcer saying, “So, how are you feeling today? Do you think you can win?” And they answer, “Well, I'm not sure. I don't feel great about our chances. We've had a tough season and we're just not up for it.” Give an interview like that, and the odds in Vegas are going to go wild! People want to hear certainty. Commitment. Confidence. Anything less than that is a big question mark. So you're not a professional athlete. Okay. What about the pilot on the last flight you took. The pilot comes on the intercom at the beginning of the flight and says, “Well, folks, it's pretty rough out there. I also didn't sleep well last night, so I'm not 100% sure I'm going to get you there in one piece, but I'll do my best.” Or the surgeon you hired to operate on your mom, and you hear, “Sorry, my surgery team today is a little sketchy. That one guy is brand new, my nurse is stressed because her kid got suspended, and personally, I'm just not feeling it today.” You'd run away, right? And well you should. No one, I repeat, NO ONE, wants to do business with anyone who is less than 100% convinced, committed, and confident. There are simply too many other options out there. So what if you're not 100% convinced, committed, and confident? Well, you've got to get there. It starts with that decision, the decision that you're going to be a professional, whatever it takes. Now you know what the difference between a professional and an amateur is. A professional doesn't make any excuses. A professional takes responsibility. A professional takes control of his or her destiny and realizes that success or failure is up to one person only: him or herself. Can you make that decision right now? I want you to really think about it. Think through what it means to take full responsibility. You can no longer blame your manager. You can no longer blame your marketing department. You can't blame your products or the economy or the rotten leads. It's YOU, period. Are you ready to do that? If so, then I want you to write down in your workbook, on a paper, the back of your business card or in your planner or wherever, “I AM A PROFESSIONAL. I TAKE FULL RESPONSIBILITY FOR MY PERFORMANCE AND FOR MY RESULTS.” Got it written down? Don't do it if you're not ready. It's much better to be honest with yourself than to try to fudge it or lie about it. Just be honest. Once you've made the decision to be responsible for your performance and your results, the next step is to commit to 100% effort. You have to be all in. This is not the game for the weak at heart. If you can't give 100%, then you need to rethink whether or not you are truly a professional. I know you have other stuff in your life-a family, maybe a parent you're taking care of, whatever. I'm not saying that your work has to take up 100% of your time. I'm saying you have to be 100% committed to being a success, to making this job work. The crazy thing is, and I've seen it over and over again, when someone makes this decision to be a professional and then commits to it 100%, it affects other areas of their life as well. Suddenly they realize that they were not completely committed to their marriage. That they were giving 50% at the gym. That they were a lousy husband, a lousy friend, a lousy son or daughter. Now let me be clear... most of you here don't consider yourself lousy. You might even listen to me right now and say, \"No, you've got it wrong. I'm a great person. I go to church. I donate to orphans. I go to my kid's piano recital and call my mom once a week.\" And you know what, you are probably doing better than most of the other people out there. But are you on the path for greatness? REALLY? Remember what we said-you cannot be great without 100% commitment. Steve Jobs didn't get to be great by taking 3-hour lunches and playing Candy Crush. Serena Williams didn't win 21 Grand Slam singles titles in tennis by going easy on her training sessions or showing up hung over. They achieved greatness by giving 100% effort every time they showed up at the office and at work. They remove all other options and devote themselves to learning everything they can about their professions. Is it unrealistic to expect 100% commitment every day? Let me answer that with another question: Is it unrealistic to expect someone to achieve greatness WITHOUT 100% commitment? Remember, whenever you commit yourself to any line of action, you will get immediate results. When you're not committed all the way, you'll find the results are delayed or nonexistent. Now, that doesn't mean you're going to perform at 100% every day-that's impossible. Even Tiger Woods and Serena Williams have bad days, or bad seasons. But they show up and do the best they can with what they have that day and each and every day, no excuses. That's what makes you a professional. If you feel a little “iffy” on this one, you've got some work to do. Earlier, we went through some exercises about your commitment and your belief. Go review those and see where you need to pick things up. Do you need to convince yourself that you are in the right job? Do you need to research your company's offerings and make a case for how yours are superior to your competitors'? Whatever you need to do, DO IT! You will NOT be able to move forward and execute until you've covered this base. Be honest, brutally honest, and figure out where you're lacking. Then create a plan to address it. You MUST do this before you can execute. 2. The 10X Plan Once your mind is right, you can move forward to the next stage: Planning. Earlier, we talked about how you can be assured of your ability to achieve any goal by determining what the reasonable effort to achieve that goal would be and then 10Xing that. But before you can take massive action, you have to know what you're aiming for! This is where a lot of people make mistakes. They think, “Aha! I'll set goals that are totally doable, and then when I 10X it and blow past the end zone, I'll look like a champ!” That's cheating yourself. Frequently and regularly, most of us have been warned against setting goals “too high.” But the reality is that if you start small, you are probably going to stay small. People's failure to think big enough usually means they will never act big enough, often enough, or persistently enough! After all, who gets excited about so-called realistic goals? Your goals have to light a fire in you. They have to make you drool just a little bit and make you question your sanity! If you don't set a goal that makes at least one person tell you that you're crazy, your goals aren't big enough. So your first step is to name and claim your goal. I choose objectives that seem just out of reach. It turns on the fighter in me, the part of me that says, “I can do this if I commit every day.” I don't want to set goals that I know I'm going to get. There's no point in that. Ask yourself whether the goals you have set are equal to your potential. Most people will admit that their goals are well below their potential- because most of the world has been convinced, persuaded, and even educated to set small, attainable, and realistic goals. Never set realistic goals; you can already get a realistic life without setting any goals. So right now, pick a goal. Ideally, it's related to work. You want to double your production this year. You want to break the seven-figure mark. You want to pay off all your debts. Whatever it is, WRITE IT DOWN. Make sure it makes your stomach turn just a little bit. That's how you know it's worth going for. Next, figure out what level of action you could reasonably assume would get you to your goal. For instance, let's say your goal is to double your production by the end of the month. You're currently producing $50,000 a month, so next month, you want that to double to $100,000. Is it a stretch? Good. Now, what level of activity would get you there? If you're currently calling 25 leads a week and you're generating $50,000 a month, let's say that's 100 leads a month for $500 a lead. The math here is easy. To double production, you're going to have to call 200 leads a month, or 50 a week. Easy enough, right? But wait... we need to 10X that. That means you're going to go for 2,000 leads a month, or 500 a week. Does that make you freak out? I can hear the questions already: “Wait, I don't have enough hours in the day to call that many people... you're crazy! What if they all want appointments? What am I going to do? I might have to hire an assistant... or do group appointments...” GOOD! You know what we just did? We created NEW PROBLEMS for you, which means we're taking MASSIVE ACTION. If you remember, the hallmark of massive action is when you leave your OLD problems behind and give yourself a whole new set of problems. You're on the right track! You've identified your goal, you've laid out what 10X effort looks like, and you've started thinking about the new problems you've created and how you might solve them. That's right where you need to be. Okay, so here's your assignment right now: Figure out what REASONABLE effort it would take to reach your new goal. Then 10X that. Write it down and also write down any new problems that start coming to you. Do it right now. 3."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "Putting It Together: Your 90-Day Massive Action Plan",
    "subsection_topic": "The 10X Execution",
    "text": "The 10X Execution Commitment-and even commitment plus a plan-means nothing if it isn't followed with action. I think about one of my clients whose business was struggling. We were talking and he said, “Man, I'm going to turn this thing around. I'm committed to doing whatever it takes.” I knew he had to lay some people off and make some tough internal organizational changes to cut costs, stuff that wasn't going to be easy. So I followed up with him about a week later to see how it was going and he was like, “Yeah, I'm still working on that.” He hadn't done ANYTHING. That's not commitment, that's a prayer-one that probably won't be answered. You have to be committed, and you have to follow that commitment with ACTION. If no action follows, it wasn't a real commitment. So once you've committed, and once you have a plan, you've got to work the plan. You've got to execute. You might expect that I'd use this time to talk about sales and negotiation strategy, or give you the secret words to make any prospect sign any contract. Well, not today! You'll have to come back to another training to get that! Today I wanted to lay the groundwork so you have the correct framework for what success looks like and what it takes to get there. What we will cover in this section is some can't-miss basics for execution. The truth is, massive action in the right direction will trump sales skills and polish every time. That's why the first thing I want to recommend you do is to KEEP IT SIMPLE. Sales is a contact sport. It's about finding the person who can buy, who has the power to decide, and who's interested. Then you approach them with an offer, talk price, and make an ask. It's really that simple, though not always easy. The most successful salespeople focus on simplifying their sales process. If you get all complicated, you're going to get lost and get so worried about what stage of the buying process your lead is in that you lose sight of the fact that a human being is sitting on the other side of the table from you. Don't worry about being rough. Get out there before you're ready. You can compensate for a lack of polish by taking MASSIVE ACTION, but the reverse is NOT true. Who wins: The rough and ready salesperson who lacks skill but makes up for it in enthusiasm and volume, or the “polished' guy who sits in his office by himself and waits for his phone to ring? And when you start getting the volume going, you can't help but become better at what you're doing. In fact, when you start taking notes on every exchange you have with your clients, their objections, and questions, you'll learn an irreplaceable skill: The Power of Prediction. To predict is to know what's going to happen next. When you take enough action and spend enough time reviewing the exchanges you have with leads and customers, you're going to start to know what they're going to say and what they're going to ask before they even ask it! You're going to become more and more sure of how to handle each interaction, and how the prospect will react in turn. You're going to be able to predict objections and handle them before they even surface! It's going to be like things are in slow motion and you know what everyone's doing and saying and what they're going to do and going to say next. You're going to be in the ZONE. This is the same phenomenon that Michael Jordan and Wayne Gretzky talk about- knowing exactly where the ball's going to go or skating to the exact spot the puck is going to be next. It comes from one thing and one thing only: experience. And experience comes from massive action. You have to start looking at everything that's happening, observe it accurately without emotion or blame, and make a note of it. Assume responsibility for what's going on around you, and believe that you can control it. Pay complete attention, make notes of each and every encounter, and review them for patterns. Once you start sensing patterns, you'll be able to predict. It's really that easy and fast. But you have to pay attention, and you have to write it down. There are no shortcuts! To know is critical to success, as knowledge equals power in life. The ability to predict is one of the first benefits from committing all the way. You'll become responsible, aware, alert and solution-oriented. You'll become a professional. 4."
  },
  {
    "doc_title": "Selling_Basics",
    "section_topic": "Putting It Together: Your 90-Day Massive Action Plan",
    "subsection_topic": "Conclusion",
    "text": "Conclusion If there's one thing I'd like to leave you with as we finish this training it's this: If you want to get anyplace in life, you've got to take action. If you want to take a trip, you've got to get in the car and put your foot on the gas. If you want to build a house, you've got to pour concrete and pound nails. If you want to win the lottery, you've got to buy a ticket. To get results, there's no way around it: You MUST take action. The amount of success you have is limited only by the amount of action you take. Make it a discipline in every area. To become the top of your field, you will have to be out of balance, totally focused, and dedicated-and you have to follow that with tremendous amounts of action. Remember, success is your duty, your obligation, and your responsibility. It's time to get moving!"
  }
]