[
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "A Powerful, Proven System You Can Trust",
    "subsection_topic": "Trust in the Process",
    "text": "Trust in the Process For a moment, imagine what your job would be like if you had to approach every customer, every deal, or every proposal completely differently. How much time that would take-and how much trial and error would you have to go through to get it right? Let's start by throwing that idea out the window. Closing a deal is a system-a process- like building a house from the ground up. Go through the same steps every time, and you'll end up with an end result that anyone would be proud of. In fact, one of the biggest mistakes salespeople make is that they don't trust in any kind of system or process when they're trying to make a sale. That's where the Perfect Sales Process comes in. Each of its five steps are physical, measurable milestones that you'll take to move a customer from considering your product all the way to taking delivery. Here's the catch: Miss any step of this process, and it simply won't work, like trying to build a house without first pouring the foundation. At the end of the day, shortcuts cost you time and money-and you won't need them. So, as we approach these steps, I'm going to ask you to trust the process and commit to doing these five steps in order. Before we dive into the specific steps, I want to talk a little about how the Perfect Sales Process was developed, and the ideas that it's based on. Within the last 50 years, there's been very little change in the way people sell things. Maybe you've been exposed to some of the dated sales material that's out there, which encourages you to spend long periods of time with your buyers, on the assumption that the longer you spend with them, the more indebted they become. People have changed over the last 50 years-in many ways. For example, wives are making more of the decisions about what to buy and how much money to spend. Today, both husbands and wives are more likely to have jobs outside the home. People feel like they have less time, and they have access to much more information. And some might argue that the internet has created a widespread shift in which buyers don't even want to engage a human being when making a purchase. So, in creating the Perfect Sales Process, Grant knew this process would have to do four things: 1. Be fast and easy for the buyer, and easy and effective for the salesperson. 2. Provide credible information as easily as the buyers can access it themselves. 3. Treat the buyers as an informed person, knowing they have access to knowledge. 4. Ultimately, satisfy the customer and the company by closing a sale. Now if you've done any previous training with us, maybe you're familiar with the fact that we used to teach a 13-step sales process. In today's world, buyers are always thinking about how much time they're going to spend, and no one wants to get stuck with someone they don't want to spend time with. So Grant shortened and simplified everything into the five-step Perfect Sales Process you're going to learn today. During this process, you're going to find out the following about the buyers: Who are they? What do they want? Why do they want it? What do I have that will fulfill their wants and needs? How do I show it to them, \"so that you can make sense of it, make an offer that you're willing to pay for, and then close, deliver, and follow up, in hopes to repeat this process again with you and others?\" Ideally, the sales process is rather shorter than longer. You as the salesperson are sensitive to the client's time, willing to spend as much time as necessary but never interested in wasting it. The buyer can get in and out as quickly as necessary or spend as much time as needed to get comfortable enough to make a decision. At the end of the day, Cardone Enterprises believes that an ideal sales process should satisfy these three parties, in this order: 1) the customer, 2) the salesperson, and 3) management. Now, maybe you've experienced the opposite, that many sales programs are designed to satisfy management first. However, in reality, management isn't buying the product and, in most cases, isn't selling it. And here's the real kicker: If the process you're using can't jump the first two hurdles of satisfying the customer and the salesperson, it won't be effective for management-no matter how much management wants it- because both buyers and salespeople will resist it. In other words, it doesn't matter how much the owner or upper management wants something done a certain way. If it doesn't work for the customer and the day- to-day user (that's you!), it will fail everyone! After customizing sales programs for organizations of all sizes and impacting hundreds of thousands of people and organizations worldwide, Grant created this powerful, succinct, and proven selling process. It's the shortest path from Point A to Point B, so you won't waste anyone's time in executing it, and you'll still hit all the important milestones you need to accomplish. The most important feature of this system, in my opinion, is that you could reveal every piece to your customers. In other words, you could pull back the curtain on every step of this process and still feel good about it. Why does that matter? At Cardone Enterprises, we believe that the transparency of our sales process is a vital litmus test for its integrity. This process is not about tricking your buyers or manipulating them. The best salespeople are straight shooters. They don't play games, they tell it like it is, and they know how to get the job done without tricks. The Perfect Sales Process, and our training today, will show you exactly how to get it done. 2."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "A Powerful, Proven System You Can Trust",
    "subsection_topic": "The Five Steps of the Perfect Sales Process",
    "text": "The Five Steps of the Perfect Sales Process Now that we've covered the foundation of the Perfect Sales Process-the “why” it was built around and its ultimate outcomes-let's zoom in a little more and talk about the specifics. Within the Perfect Sales Process, there are five steps that you must go through in every sales situation, whether it be in person, on the phone, or over the internet: Step 1: Greet The goal of the greeting is to introduce yourself, make a good impression, and put the buyer at ease. Your greeting sets the stage for the remaining steps. It opens the door to the reason we're there: to move the prospect into becoming a buyer. After your greeting, you'll immediately transition into... Step 2: Determine Wants and Needs In this step, you'll discover what your buyer wants and needs-and why. The outcome in this step is twofold: 1) to know what product to show your client and 2) to know how to present the product in a manner that will build value in that presentation and drive them to take action. Then, you'll move into... Step 3: Select Product and Present/Build Value Based on what you found out in the first two steps, you should now be able to select and present a solution, as well as demonstrate how it will benefit your buyer. Using the information your buyer shared in Step 2, you'll focus your presentation on what's important to that particular person, creating urgency and increasing the desire for your buyer to give you money for the product you are offering. Then, you'll head into... Step 4: Make Proposal As we'll discuss today, this is a step you probably already do, but you don't do it nearly enough. So although we're going to talk about the mechanics of delivering a proposal, we're also going to talk about the mindset shift of making a proposal to everyone you greet. I'll show you why this is so critical, when we cover this step in detail. Once you present your proposal, you'll move into... Step 5: Close Closing the transaction is a completely different art from selling. You have to be prepared to do it-and you have to be prepared to do it well. But here's the great news: Once you hone the art of closing, it creates confidence in your ability to handle all the objections, stalls, and problems you might encounter, which will only increase your confidence to do more selling. Approach this skill like you would if you were attempting to get a third-degree black belt, and you'll become a better salesperson overall. As you start to put this system into action, your first goal is to memorize these five steps by heart. I want you to be able to recite them backward and forward, both by name and with the associated meaning. That's going to be your first piece of homework as you take this system back to work and start to put it into practice. Then, as you're working through the process, make sure you always know exactly where you are within the Perfect Sales Process-and where you need to go next. Now, there's one more key to making this system work, and it starts with you. 3."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "A Powerful, Proven System You Can Trust",
    "subsection_topic": "Commitments: The Key to Making the System Work",
    "text": "Commitments: The Key to Making the System Work If you really want to make the Perfect Sales Process work, I'm going to need something from you: a set of commitments. If you're not willing to make them, I'm going to give it to you straight: The Perfect Sales Process just isn't going to work for you. But if you're willing to make these eight commitments, I can practically guarantee that this system will help you close more deals. So, let's talk about what these commitments are: Commitment #1: Learn these steps by heart. I want you to know them inside and out, so you can hit every single step and transition easily between them. That's when the system is really going to start to work for you. Commitment #2: Know the purpose of each step and know the benefits to the customer first. Make sure you know, for yourself, the “why” behind each of these steps. It will help you move through the steps with much greater fluidity. Commitment #3: Commit to every step. Commit to all the steps, and commit to doing them with every customer, every time, every day, regardless of the situation. Otherwise, this system just simply isn't going to work for you. I also want you to commit to practicing them until you're what we call “fluid, not mechanical.” When you're learning something new, you're not fluid. You're awkward. Have you ever seen someone learn to surf? Or skateboard? Or dance? There's nothing fluid about it. When you first start to use this system, you're going to be mechanical. Moving customers through the steps will feel awkward. So you'll need to get very, very fluid, and the only way to get fluid is through repetition, training, education, and practice. Keep at it and you'll hit your stride. Commitment #4: Always get answers to every question you ask. This is a massive problem I see with salespeople across the board. Make it a personal rule that when you ask a question you always, always, always get an answer. Why? Because if you can't get people to answer your questions, you can't close them. So if I ask a man for his name, and he doesn't answer me, I'm going to say, “Sir, your name please?” And if he doesn't answer, I'll follow up with, “Forgive me, sir, your first name?” If you can't control the asking of questions and the receiving of answers, you're in trouble. If you're not persistent about getting answers to questions that you ask, you will never control the sale, you will never build trust, and you will never close the deal. People that don't talk to you will not buy from you. And one more distinction: If one of the answers you get is, “I don't know,” you need to realize that's not an answer. So, let's say you ask, “Are you going to be paying for this at one time or over a period of time?” and your customer says, “I don't know,” you have to follow up. Commit to getting that answer. Here's how it might go: You: “Well, what would you prefer doing if you were going to make a decision right now?\" Your buyer: “You know, I really don't know yet.” “I understand. How'd you do it last time?” “We made payments last time.” “And the time before that?\" “We made payments.” “And the time before that?” “We made payments.” At this point, I think it's safe to say that you have your answer-but only because you committed to getting it. Commitment #5: Always handle the customer's originations and objections. “The weather's terrible today” is an origination. Handle it with a simple, “I agree with you.” Or maybe your customer has an objection, like “I don't need to drive it.” Don't act like it didn't happen. Handle it: “Sir, I totally understand you don't need to drive it. You know what? I'll tell you what. I'll drive it. You will be the passenger.\" Or to put it another way, your customer is saying, “Hey [insert your name], I don't want to dance with you.” Your answer? “No problem. How about we have a drink instead?\" Deal with the origination. Acknowledge it. If it's an objection, handle it. We'll talk more today about exactly how to do that. Commitment #6: Always be positive with everything you do. “Can do,” “no problem”-that kind of attitude is contagious. It's everything to you, your career, your happiness, and your bank account. That's why you need to work on your training every day. Consult it before and after deals to keep you sharp. If you've ever lost a deal, your attitude drops. That's when you want to go get it fixed, immediately. Don't wait for three days. Get back to your training, fix your attitude, and keep it positive. Commitment #7: Always agree with your customer. This is the first rule of selling. If you've been through Sales Success from the Ground Up, you already know this rule: Always agree with the customer-because if you don't agree with people, you can't handle all their points of resistance. If you can't handle the points of resistance, you will not control the sales process, and you will not make it through the steps and close the deal. Commitment #8: Always approach each of the steps from the mode of service. People do business with people they like. Agreed? People do business with people they like and feel good around. Agreed? People do business with people they like, feel good around, trust. And they're more likely to do business with me and pay me because they feel good around me. Those are the benefits of approaching these steps from the mode of service. Those are your eight commitments. We're going to work with them just a little bit more before we move on to the next section. PART 2: SETTING THE FOUNDATION: ATTITUDE 1."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Setting the Foundation: Attitude",
    "subsection_topic": "What Is Attitude?",
    "text": "What Is Attitude? What exactly is attitude? Attitude means your mental disposition-your feeling or position toward something or someone. Your attitude is your X factor. It's what makes you unique. Now, your attitude can be negative or neutral, good or great. But to sell, you need one attitude: A great attitude. Bad, neutral, or even good isn't going to work for you. Without a great attitude, you have zero chance of closing a deal. Here's what's so interesting about attitude: You need a great attitude before you ever meet a customer, before you pick up a phone, before you send out a letter, before you get on your laptop to send an email. Your attitude can literally be felt over an email, can't it? So before you handle an appointment, take a call, or physically greet a customer, you have to make sure you have a great attitude. After all, without the right attitude, the five steps of the Perfect Sales Process don't even matter. Now, agree or disagree: People typically don't buy from people they don't feel good around. Now if they DO buy and they don't feel good around you, they're going to make a decision on what? Price. So if you want to ensure that you get the lowest price for your product-that's right, the lowest price every time-go ahead: Keep your negative or neutral attitude. However, if you want every chance to get the highest price for your product or service, cultivate the most positive attitude that you can possibly have. And that's about standing in a state of confidence, knowing deep in your gut that you're going to sell the customer. Attitude will determine how far you ultimately get in life, not just in the job you're in. It will also determine whether or not you're happy in life. Hard work alone will not ensure that you get far in life. And even if hard work helps you achieve certain things, without a great attitude, you can still be miserable. Because if you have a neutral or negative attitude, hard work will just be hard work. Cultivate a great attitude. It will change everything. Now, once you agree that a positive attitude is absolutely necessary, a couple of items you need to complete the package: Dress like a winner. Don't dress to be comfortable. Dress like you're a professional. Dress like you're going after a million dollars or a hundred million or even a billion. Carry yourself like a winner, like you're Tony the Tiger or Tom Brady- anyone who's at the absolute top of his or her game. Even when things get tough, carry yourself like a winner. Have that light in your eyes. Have you ever met somebody who literally has light beams coming out of his or her face? Try to project that same kind of light when communicating with people. Next, put a smile on your face at all times. Your buyers might say things like: \"We're not buying today. We can't afford it. We're not doing it. We're going to wait until the economy returns,\" My response goes like this. \"I understand. I understand you're not buying today. I understand the economy's bad. I understand you're on a budget. I understand you don't feel good. I understand.\" Always keep doing this. Last, you need service in your heart. When I go and meet with a client, I'm not thinking, “I've got to sell the client.\" I'm thinking about service in my heart. It doesn't matter for me whether I'm picking up my child, asking a woman to go out with me for the first time, or selling a customer a $10 book: I want service in my heart. You have to make the decision to approach every scenario like that. And when you have service in your heart, you'll have a smile on your face. You'll stand up differently-and you'll have a great attitude. In fact, service is such a necessary part of your sale, that I'm going to take a few minutes to focus on it. 2."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Setting the Foundation: Attitude",
    "subsection_topic": "Keeping Service in Your Heart",
    "text": "Keeping Service in Your Heart An attitude of service lets people know they're being taken care of, not being taken advantage of and not being taken for granted. To be a successful salesperson, you need to concern yourself with your customer first. What do they get? How do they win? How do they benefit? Notice that I'm not talking about what YOU get out of the sale. What do THEY get? How do they win? If you have that in your heart, they're going to know it. And look, if you take care of enough other people, I promise you you're going to be taken care of. But it has to be genuine, and it requires some trust on your part. I want you to think that if you approach a sale with enough service in your heart-if you really, really take care of people-it will pay off. I think, deep down, most of you believe that. Am I right? So what about those who give up on this idea of service and giving? Have you ever made this mistake or seen someone else who did? [FACILITATOR: Optional: If applicable, add “I've made this mistake” and share your story.] That's the path to failure. Maybe you've tried this “service thing” and you didn't get results. There are four reasons that might happen: 1. You didn't stay with it long enough. 2. You came up just short of really, really serving people. 3. You weren't genuine in your service. You were doing it to serve your own desires- like getting a bigger paycheck-not from a desire to authentically, genuinely care and service. 4. You quit being interested in the service angle. It just doesn't work if you lose interest in serving a client. I've heard it said that the only way to be a real master is to first become a master at being a servant. People don't want to be sold. People want to be serviced. People want to be taken care of. Will they need help making a decision? Of course. They don't know the product like you do and they came to you for assistance. Will they need you to help them close? Absolutely. But without that quality of service, without you taking care of them, without you really giving into, “I'm here to assist, not just sell,” you're probably not going to get to the close. Service is an action word. Service means to be useful or of some value, help, aid, or assistance to another. You should never ever have to tell a customer that you want to be of service to them. Why would you tell them? Your actions should speak for themselves. I'd never tell someone, “I want to get you a glass of water.” I'd just get it for them. Or maybe your customer asks for information. Service-oriented salespeople would respond with, “I'd be happy to get that for you, sir. I'm going to get you this, and this, and I'm going to get you this, and I'm going to get you the warranty, and I want to get you the payments, and I want to get you terms, and I want to show you the lenders we're using.” In other words, you want to be of so much service that your customers don't have to ask for anything. You want to overwhelm them with service. When you make your attitude one of service, the selling will take care of itself. 3. How to Deliver a Great Attitude-Verbally Now that you understand why a positive attitude is so important, I want to dive into the “how.” How do we deliver a great attitude, day in and day out? It's not an esoteric concept, really, and you don't have to talk to yourself in the mirror or go on some kind of long retreat to cultivate it. Instead, a great attitude is about getting your head on right and understanding how to communicate positively. I'm talking about eliminating things like “I can't” and “we won't” from your vocabulary and replacing them with things like, “Can do. Excellent. No problem. You got it. Be happy to. Great. Hey, whatever you want, I'm here to get it for you. Look, I'm here to serve you, not sell you. I agree with you, sir. You're right. I love that idea.” All of these phrases communicate a great attitude. By the way, you don't have to feel good to have and project a great attitude. Maybe you've got a 102-degree temperature. Maybe you're getting over the flu. Maybe your girlfriend or your boyfriend left you. So what? Have a great attitude anyway. Communicate that great attitude-and the easiest way for you to deliver that is verbally. A great attitude is also the best way to stand out from your competition. Think about it this way: You've probably got at least four other people selling something similar. Three of them will sell it for cheaper. How do you get people to buy from you? Here's your edge: I am so positive. I've got light coming out of my eyes. Everything they say that's negative, I'm coming out positive: “Hey, be happy to. No problem. We can do it. I'd be happy to get that for you. I understand how you feel.” When the rest of the world is negative, you'll be like a bright star. Because let's face it, there are very few people on this planet who are positive. A majority of the population is actually negative. So when, all of a sudden, you meet somebody who goes around with an attitude of: “Hey, I can do that. Oh, no problem. Oh, you've only got ten minutes? That's more than enough time,” that person stands out. Just like everything else we'll discuss today, you want to practice these positive phrases so that you can communicate a great attitude, regardless of how you feel, regardless of what's going on. Then you can deliver to your customers something they can actually experience. Because, at the end of the day, you don't just need to change your attitude, you have to change theirs, too. 4."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Setting the Foundation: Attitude",
    "subsection_topic": "How to Deliver a Great Attitude-Verbally",
    "text": "Now that you understand why a positive attitude is so important, I want to dive into the “how.” How do we deliver a great attitude, day in and day out? It’s not an esoteric concept, really, and you don’t have to talk to yourself in the mirror or go on some kind of long retreat to cultivate it. Instead, a great attitude is about getting your head on right and understanding how to communicate positively. I’m talking about eliminating things like “I can’t” and “we won’t” from your vocabulary and replacing them with things like, “Can do. Excellent. No problem. You got it. Be happy to. Great. Hey, whatever you want, I’m here to get it for you. Look, I’m here to serve you, not sell you. I agree with you, sir. You’re right. I love that idea.” All of these phrases communicate a great attitude. By the way, you don’t have to feel good to have and project a great attitude. Maybe you’ve got a 102-degree temperature. Maybe you’re getting over the flu. Maybe your girlfriend or your boyfriend left you. So what? Have a great attitude anyway. Communicate that great attitude—and the easiest way for you to deliver that is verbally. A great attitude is also the best way to stand out from your competition. Think about it this way: You’ve probably got at least four other people selling something similar. Three of them will sell it for cheaper. How do you get people to buy from you? Here’s your edge: I am so positive. I’ve got light coming out of my eyes. Everything they say that’s negative, I’m coming out positive: “Hey, be happy to. No problem. We can do it. I’d be happy to get that for you. I understand how you feel.” When the rest of the world is negative, you’ll be like a bright star. Because let’s face it, there are very few people on this planet who are positive. A majority of the population is actually negative. So when, all of a sudden, you meet somebody who goes around with an attitude of: “Hey, I can do that. Oh, no problem. Oh, you’ve only got ten minutes? That’s more than enough time,” that person stands out. Just like everything else we’ll discuss today, you want to practice these positive phrases so that you can communicate a great attitude, regardless of how you feel, regardless of what’s going on. Then you can deliver to your customers something they can actually experience. Because, at the end of the day, you don’t just need to change your attitude, you have to change theirs, too." 
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Setting the Foundation: Attitude",
    "subsection_topic": "Your Attitude Is a Reflection",
    "text": "Your Attitude Is a Reflection Now that you know what you're going to say to project a great attitude, let's talk about the biggest question we get at our Cardone Enterprises seminars: How do you KEEP it? How do you stay positive? It's a great question. Here's our take: Your attitude is determined by your thoughts: what's going on in your head. And your thoughts are determined by the content of your mind. And the content of your mind is determined by the environment around you. That includes newspapers, TV, radio, your friends, the people you live and work with, etc. So when it comes to your attitude, it's a reflection, just like your body. Your body is a reflection of what you put in it and how you take care of it, right? Your mind is the same thing. Whatever is going in your head is going to come out of your mouth. So how do you stay positive all the time? You control the content of your mind. You control what goes into your head. If you've got angry content in your mind, you're going to project what? An angry attitude. If you've got apathetic, quitter, give-up, no-solution content, you're going to probably have what? An apathetic, lazy, lethargic, “I've got no juice” attitude. But if you have positive, solution-oriented, can-do content in your mind, what are you going to communicate? A great attitude: “No problem. You've got it. I'd be happy to.” Now, here's a great example of this: How many of you browsed the news today? Now, I'm just going to read you a few headlines from this morning. What do you notice? Most of it suggests you should be upset, that there's a conspiracy going on somewhere in the world, or that you should just give up because there's no solution to anything. If this is how you start your day every day, no wonder you're feeling negative. And this is coming at us nonstop, 24/7-all negative content. By the way, this isn't a political statement. It doesn't matter whether you're listening to the right or to the left. They both share plenty of negative content. So if you really want to stay positive, you've got to choose better content. Here's one easy way to do it: Surround yourself with positive books. Keep them all over your house. Next to your bed, in your bathroom, anywhere you can grab them. Did you know that when you read something that you don't know, you actually generate curiosity-and when a person becomes curious, they're interested in learning more? In other words, if I actually taught you more, you'd be interested in learning more. Conversely, the less you learn, the less interested you are in learning. So who do you think is more excited? The person who's learning or not learning? That's the power of keeping positive, interesting books around. So what does this all roll up to? Your life and your career depend on your attitude. Control your environment and what goes into your head, and you can shape your attitude in any direction you want. 5."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Setting the Foundation: Attitude",
    "subsection_topic": "Seven Tricks for Staying Positive",
    "text": "Seven Tricks for Staying Positive Now, in addition to controlling what goes into your head, I have seven other tricks to help you stay positive through some simple actions you can take every day. As I walk you through these, I want you to pick out two that you're going to implement in the next week, so think about that as I share this list with you: 1. Write down your goals each morning, and write them as though they're already yours. For example, “I sold X products this month. I made Y in commission. I own a helicopter. I just bought a lake house in Italy.\" Whatever your goals and dreams are, keep writing them down every morning. Keep putting them in the physical universe until all your attention starts moving to those things that you want. 2. Work out every day. Move your body for ideally 30 minutes, but if you can't get more than ten minutes in, get ten minutes in. Move in the direction of health because it will make you feel positive. Think about it this way: If you wake up at 6:00 and finish your workout at 6:30, you've already accomplished more than what 90% of the entire population on planet Earth has. And listen to positive stuff during that workout- information, knowledge, music, anything that makes you feel good. 3. Finish things left undone. That stack of paper on your desk, that mail that you haven't sent out, the bill that you haven't paid yet: They're all killing you because they lock up attention units. Leaving things unfinished can also get you in a mindset where you start believing things like, “I don't finish projects. I don't complete cycles of action. I don't accomplish things.\" That's not a positive place to be, so just start knocking things out, out one by one. 4. Treat everyone with a great attitude. Go out of your way to help someone else or make somebody else feel good. Maybe you see a woman struggling with her bag on the plane. Volunteer to help: \"Can I help you with your bag, ma'am?\" What does that do to the people around you? More importantly, what does it do for you? It instills a sense of contribution, a feeling that you're helping the people around you. 5 Make a gratitude list on a daily basis. That will start shifting your thinking. What do you have to be grateful for? Everybody's got something. You've got enough resources at your disposal to be here right now, so I guarantee you've got something to be grateful for. You're actually studying material right now to change your attitude. That's something to be grateful for. Find these things and list them daily. 6. Put a sign up in your office. You can put something like “NO NEGATIVITY ALLOWED” on your wall, and take a stand on negativity. You can even point to the sign and say, “Look, negativity isn't allowed here. I don't want it in my environment.” So the next time one of your coworkers, a manager, a fellow employee, or an executive comes in and starts saying, \"Business sucks, this is a problem, and that's a problem,” you can point to the sign and cut the conversation off immediately. Because you can't afford it. It is killing you. You think sales training costs money? A bad attitude will cost you millions of dollars over your lifetime. And if you're surrounded by it, it might be time to make a change. 7. Get rid of the people in your life that are not positive. Reach up. Don't reach down to your peers. Reach up. Find people that are positive, find people that are creating wealth, success, happiness, taking care of their bodies, etc. and make them a part of your life. Get rid of the negative people in your life. And if you can't get rid of them completely, control your environment. Use the sign, use whatever you need to keep negativity at a minimum. The best thing you can do for yourself-the single thing that will make the biggest difference in the success of your life-is to reach up and grab yourself a positive attitude. These strategies will get you started. I want you to commit to implementing two of these in the next week. On page [FACILITATOR: Share page number], circle the two that you're going to put into action. Ideally, I'd love to see you start these tomorrow. Which two are you going to adopt first? I'll give you a second to mark them. [FACILITATOR: Pause to allow them to complete this.] 6."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Setting the Foundation: Attitude",
    "subsection_topic": "Wrap-Up: The Most Important Sale You Will Ever Make",
    "text": "Wrap-Up: The Most Important Sale You Will Ever Make Finally, there's one more distinction I want to cover on this topic before we dive into the Perfect Sales Process. Earlier in the day, we talked about what determines your attitude: Your attitude is determined by your thoughts: What's going on in your head. And your thoughts are determined by the content of your mind. So if your attitude comes down to the content of your mind, it only makes sense that the biggest, most important sale you will ever make in your lifetime is the one you make to yourself. Because if you can't sell yourself-if your mind isn't utterly sold on your product, your company, and yourself-how can you possibly have the right attitude to sell anyone else? So let me ask you: Are you sold on your product? Are you sold on your company? Are you sold on yourself? If you cannot, unequivocally, answer 100% “yes” to those questions, you will suffer. At the end of the day, you have to be completely, unequivocally, totally overboard, unreasonably, fanatically sold on your product, sold on your company, and sold on you. What do you love about your product? Why is your product worth the hundred grand? Why should people go into debt over it? Why should people actually pay more than they can actually afford for your product? What are all the ways people benefit? How many different things do they get from your product? You have to stay constantly connected to how sold you are on that product. Not how your customers are sold on it, but how YOU are sold on it. You have to do the same thing regarding your company. What are all the benefits of your company? What have they done to invest in their people? What does your company do for your customer that you need to know about? And then, what about you? How do you do? How do you go the extra mile? Why should you earn the sale? How are you going to show up differently than other people? Why should they be willing to give you that commission? Why you? Look, if you don't have answers to these questions burned into your heart, you'll never have the right attitude-and you won't fully become a champion. Because that's what this is about. Making you a champion, a master-and making whatever goal or goals you have achievable and real. Part 3: Steps of The Sales Process - Step 1: Greet 1."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 1: Greet",
    "subsection_topic": "Your Greeting Sets the Tone",
    "text": "Your Greeting Sets the Tone Welcome back! Now that we've covered the foundation that sets the tone for the Perfect Sales Process, we're going to dive into the five steps of the process. We'll start with Step 1, which is absolutely critical for closing the deal. In fact, blow this step and you'll blow the whole deal. Now, even though this step may only last a few seconds, it's going to set the tone for everything that comes afterward-but you've only got one shot. Whatever happens in these first few seconds can never be changed. That's why it's so important to be prepared-because you've got to do the greeting just right. When you look up “greeting” in the Merriam-Webster Dictionary, the definition says: “To address with expression of kind wishes upon meeting or upon arrival.” This gives us a guideline for what we want to achieve in this step: 1. We want to make people feel welcome. But that's not the only goal for this step. You also want to: 2. Introduce yourself and make yourself known to the customers. 3. Put the customers at ease so they start dropping their guard. 4. Get on common ground. 5. This next one is very, very important, yet it's not something a lot of people talk about a lot: You want to differentiate yourself from others they'll meet later and those they have already met. And you also want to differentiate yourself from any experiences people have had in the past with your product, your service, or your company. 6. Get the buyer to turn control over to you. Now, this word “control” confuses a lot of people. So let me be clear: Your goal is to influence people to turn control over to you. You're not trying to take it from them. Ultimately, the greeting is the foundation for every step that follows this one. It's also a step that you must continue to perfect throughout your career. It's not something you learn once and move away from. So let's try our first greeting right now. I'll get us started: “Welcome, my name's [FACILITATOR NAME].” Try it now. Turn to the person next to you and try it on each other: “Welcome, my name's...” This is something you're going to practice until you feel fluid, not mechanical. Get that first phrase down. Because if you can't put people at ease, you're going to struggle with getting on common ground. And if you don't differentiate yourself, you'll never control the process. And when it comes to control, it's absolutely essential to selling. During a sale, you'll either have control or you won't control, period. There is no in-between. This will come naturally as a result of working the steps perfectly. Skip the steps in the Perfect Sales Process or let people talk you out of doing them, and I promise you, you will never ever have control-and control equals a close. It all starts with the right greeting. Let's work on perfecting yours. 2."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 1: Greet",
    "subsection_topic": "Three Steps to a Winning Greeting",
    "text": "Three Steps to a Winning Greeting There are rules to every game, and greetings are no different. Violate the rules, and you're going to lose. Play by the rules, or, even better, learn to manage those rules, and you're going to win. First, let's talk about the three steps in your greeting. I'm going to go through them quickly first so you get the flow, then I'm going to go back and break everything down for you: 1. Go to them. Don't have them come to you. You're going to go greet them, and you want to go further toward them than they're going to come to you. 2. You say, “Welcome, my name's [FACILITATOR NAME].” And you put your hand out and say, “And yours?” 3. Remember, they're there for them. They did not come for you. You need to know that. They're not interested in you. You need to be interested in them. Those are the three basic steps. Now let's go through a couple of nuances. • Step 1: Go to them The person that travels the furthest is the person most interested. They might have traveled 30 miles. You need to walk 30 feet. They've done all the work, so you have to go to them. Go greet your customer without rushing them. Show them, by your actions, that you're interested in them. • Step 2: You say, “Welcome, my name's [FACILITATOR NAME].” And you put your hand out and say, “And yours?” It's not, “Welcome to our dealership” or “Welcome to our company.” It's “Welcome, my name's [FACILITATOR NAME],” and then you put your hand out. Leave it there until they shake it. Make eye contact. Be present. Do you know what I mean when I say that? Show up and be there-nowhere else. Ask for their name, pay attention to that name, and duplicate that name over and over again in your conversation. Two more tips for you in this step: 1. Don't be offended by brush-offs. They're going to happen. Oftentimes, it's because the last salesperson that worked with them wasn't a professional. They see you as the same kind of person. It's not about you, so don't take it personally. 2. Give a firm handshake-no dead fish handshakes-and look your customer in the eyes. Make eye contact. Show interest. Have that light beaming out of your eyes and smile. See the deal before it happens. See the client buying your product and taking delivery. • Step 3: Remember that they're there for them. They didn't come for you. And as you keep this in mind, I've got one last rule to guide you: Every person who walks in the door should be treated like a buyer. Regardless of what they tell you, there is an opportunity with this client. Every prospect that you meet is an opportunity. One day, someday, somehow, some way, he or she will be a buyer. There is no exception to this rule. 3."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 1: Greet",
    "subsection_topic": "People Are Naturally Guarded",
    "text": "People Are Naturally Guarded Let's start by setting some context here. When people meet new people, they're naturally guarded, not wide open. Think of the last time you went into a car dealership, the dentist's office, or a lawyer's office for the first time. Did you feel comfortable? Probably not. Now, if you went there three, four, five, or six times and you knew everybody there, you'd feel a lot different, wouldn't you? So unless your customers visit you every day, they are not going to be in their comfort zone. That's why your job in the greeting is to make people comfortable, to put them at ease, to remove all defenses that they may have so that they don't continue to guard themselves. After all, when a person's guarded, you're not going to get on common ground with that person. You're not going to convince him or her to turn control over to you. You're not going to build trust and confidence. Let's talk about what “guarded” looks like. You open with: “Welcome, my name's [FACILITATOR NAME].” Note: Also put out your hand and smile to demonstrate the perfect greeting every time you repeat these phrases. “And yours?” And then you immediately start hearing things like, “I'm not buying today. Leave me alone. I just want to look. We're not buying for three months. You'll be wasting your time. I just need a price, and I want to get out of here and go shop around. Do you have this? Do you have that? How much over invoice can you sell it to me for? What kind of discount can you give me? Can you match or beat this price I have in my hands?” Ever encountered anything like that? If you've been doing this for more than five days, I bet you've heard all that before. But what you may not know is that these are just things that people say to you because they're on guard. We call them Reactionary Defense Responses or RDRs. They don't mean much. They're just reactions. All this, “I'm not shopping,” or “I'm just looking, I'm not buying, we only have five minutes...” those are RDRs. They're not objections. They're just automatic. They're not thought out. They're designed to defend and protect, and hopefully, make you lose interest in serving the customer. And let's be honest: Most of the time it works. But here's what I want you to know: Don't take them personally. They mean nothing. Always, always be positive when you hear these things, and just disregard them. Now “disregard” does not mean “don't acknowledge them.” I can acknowledge something and disregard it at the same time. Let me give you an example: Your customer says to you: “Hey, [FACILITATOR NAME], the weather sucks today.” You say: “Hey, I understand.” You don't have to go into a conversation about it. You can acknowledge it, then disregard it. But, no matter what, continue to show interest, regardless of what you hear. Let me repeat that: Show high levels of interest, no matter what your buyer says. It helps if you can understand and predict what you'll hear. Don't be caught off guard. Know that they're going to say, “Hey, I'm not buying today. We're just looking. We're just shopping. First place we've been to. Can you match this price? Can you beat this deal? I didn't bring my wife with me. I only have five minutes.” Understand this and predict it. Then you can use it. Let's talk about how. 4."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 1: Greet",
    "subsection_topic": "Handling Reactionary Defense Responses",
    "text": "Handling Reactionary Defense Responses Now, before we dive deeper on RDRs, there's something you need to understand: You're not in the product business. You're not in the car business. You're not in the radio business. You're not in the insurance business. So if you're not in any of these businesses, what business are you in? You're in the people business. So you need to understand what's behind these statements. What causes people to say these things? Why do they have this reactionary response? Reactionary Defense Responses are a defense mechanism, an automatic response that's born out of your buyer's beliefs and complicated by their fears. They're thinking things like “I can't trust these people\" and \"this guy won't tell me the truth.\" They've been ripped off before. Now, here's what's important to remember: This doesn't have anything to do with you. You're telling the truth. You're not the person who ripped them off before. However, you still need to take responsibility for the situation because you want to control the sales process. You need to solve this problem. Let's talk about the fears that make people feel defensive: 1. Pressure to buy. \"If I show interest, the salesperson is going to start pressuring me to buy today.\" This is a customer trying to protect him or herself. 2. Getting stuck for hours. “It's going to take too long. I only have ten or 15 minutes. I don't want to be here for two hours. The last time I came in, it took two hours.\" Have you ever avoided going to a party because you feel like you're going to get stuck there for hours? See, this is about human psychology. It's not just about selling. People feel like they're going to be obligated: \"If I show interest, if I spend time with this person, I'm going to be obligated if they show me their product.\" Or: \"If I go for a ride in it, I'm going to feel obligated that I'm going to have to be nice to them and I'm going to have to buy something.\" Understand? By the way, do you have family members who don't want to come buy from you? Maybe you've got an uncle who needs what you have, but he won't ever come down to see you. Do you know why? Because your uncle doesn't want to feel obligated. That's what's holding him back. He thinks, \"If I go and sit down with my nephew or niece and look at this proposal, I'm obligated to buy.\" This is a perfect example of a Reactionary Defense Response. And until you handle that, you're not going to be able to handle him. Let's talk about other fears your buyers are going through: 3. Making a decision. Decision making is more difficult for people than paying the money. They're scared to make the wrong decision. What's going on in their head? A loop that's all about fear: \"I didn't make the right decision. I'm going to feel like a fool later.\" 4 Overpaying. What's your customer worried about? \"I'm going to pay too much and get ripped off.\" 5 Financial insecurity. Your customer might even be thinking things like: \"I probably can't even afford it.\" This isn't the truth, by the way. You'll get a lot of people who come to you who can easily afford your products, but don't think they can. Now, why are we going through all of these fears? Because the only way to put people at ease is to know what's going on with them. And once you put people at ease, you can get on common ground and convince them to allow you to control the process. Assure them that they're in good hands. Address their fears, even when they're not stated. \"Look, you don't have to make a decision here today and you don't have to buy here today. My job is to service you.\" By the way, I'm starting to use some language that we're going to go over in more depth shortly. What about the person who's sensitive about time and comes in saying, “How long is this going to take?” You could say, “I'll get you everything you need in the next 20 minutes.\" And if they say: \"I only have 15.\" You could respond: \"I'll do it in 15.\" Why not? To sum this section up: 1. Your job is to put your buyer at ease by handling their RDRs. Realize that some of these RDRs are never spoken, but they're definitely projected. Handle them all. 2. Understand that what buyers say when they come in the door are RDRs. These are just a defense mechanism, nothing more than that. 3. Figure out what people need so that they can feel at ease. 4. Look at these common fears and create responses you can use for each one of them. These exist for every person that comes into your home or into your office. You need to be prepared to handle them. 5."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 1: Greet",
    "subsection_topic": "Getting on Common Ground",
    "text": "Getting on Common Ground In this next section, we'll continue the process of breaking down every part of this step of the Perfect Sales Process, so you can understand it perfectly. More specifically, we'll move on to the next part of Step 1, which is about getting on common ground. The Merriam-Webster Dictionary defines common ground as “the basis of mutual interest or agreement.” In plain English, it means that you and I have something in agreement. The keyword here is what? Agreement. You can't get on common ground with someone if you disagree with them. Maybe you've heard the phrase “opposites attract?” In sales, it's just not true: Opposites never, ever attract. If you ever want to gain the other person's trust-as well as control of the sale-you have to get on common ground and establish some mutual interest or agreement without wasting his or her time. It's a challenge. Agreed? A lot of salespeople do it wrong by going out of their way to hunt for this thing called “common ground” with phrases like: \"Where do you live? Where do you work? How far did you drive today? Nice little kids you got there.\" These are hit or miss. People didn't come in to talk about where they live or their kids. That's not why they came in to see you. It's not authentic, it's not genuine, and they know it. So what happens? Most salespeople realize this isn't working so they skip getting on common ground, and they find they can't close the sale without it. We take a different approach. Let's think about what you have in common with every customer. Let's make a list. [FACILITATOR: Optional: Ask for input from the audience to make this list, either by asking them to contribute in the room or type into the chat in a virtual setting.] What do we each have in common with every other human being on planet Earth? There are 7.5 billion of us, last time I checked. We all have a heartbeat. We all have blood running through our veins. What else? Because the more we can find in common with people, the more we can communicate with them. Let's think about this more specifically in terms of your customers. What do you have in common with your customers? 1. They want information. You have it. 2. They want to get in and out. You want that too, if you're honest with yourself. You want them to come in, buy your product quickly, and get out of there, so you can go do it all over again. 3. They want to be sure that they don't make a bad decision. And you want to be sure too, although, for you, a bad decision would involve them buying somewhere else or not at all. 4. They don't want to be pressured. And if you don't have to pressure them, you don't want to do that either, right? 5. If you're selling them a car, they're probably going to be interested in things like price, payments, interest rates, and figures on the vehicle they're driving now. You don't think that you have that in common? If you don't give them those five things at some point today, you're not going to sell them anything. So you have that in common with your customer: You both want to get to the information stage. Maybe for different reasons, but you both want to get there. 6. Neither of you wants to waste your time. Look at all those things you have in common with the customer. What if you could put all that into one of the most effective greetings you could possibly use? What about something like this? \"Welcome, my name's [FACILITATOR NAME]. And yours? My job is to make sure you get all the information you need and to make sure you get the right product. I'm going to leave the decision making up to you, and I want to do it all in the shortest period of time possible.” Learn this greeting and it can change your life. Now that you've got a greeting that will get you off on the right foot, I want to teach you the ultimate way to grab common ground. It's called “Information Assisted Selling.” 6."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 1: Greet",
    "subsection_topic": "Using Information Assisted Selling",
    "text": "Using Information Assisted Selling Information Assisted Selling is a unique system, one that Grant Cardone has trademarked. It's something that has transformed entire industries, and it will position you head and shoulders above any competitor who refuses to use it. When you put Information Assisted Selling into action, your productivity will go through the roof, and you'll easily maintain control of the sales process. Here's what this system hinges on: What do customers who come in your door or enter your sales process have in common? What are they all coming for? Here's a hint: It's not you. It's information. Even when someone says they're “looking for a salesperson,” you need to understand what they're actually saying: They need information. Now, you might tell me that they're coming to buy your product. That's not entirely accurate. They're coming to get information so they can buy your product. Without the information first, they can't hook, they can't buy, and they can't make a decision. In fact, most sales processes break down because the organization does not want to give information. Let me repeat that: Most sales processes break down- and most salespeople do not succeed-for one reason. It's because the organization believes it should not give information. This is a mistake. Most salespeople fail because they don't get to the information phase. Your paycheck reflects the number of clients you can get into the information stage and then close. Information is good. No matter how many sales you made last month-I don't need to know the customers' names, I don't need to know the terms, I don't need to know how much money you made-I can still guarantee you one thing. Those people you sold? They all got information. Information is the ultimate common ground. Before you get nervous or confused, or run out and give people a ton of information, I need to tell you that you can't just give people information. You have to deliver it in a very specific way. In fact, we're going to use the offer of information separately from the actual giving of information. Stay with me here for a minute. Why do you want to separate the offer of information from the giving of that information? Here's one reason: You don't want to give information before you know you're offering the right product and before the customers are sold on that product. And you don't want to give it while we're standing up and walking around. Instead, you want to do it when you give your presentation or proposal. Think of it this way. Let's say I ask you something like: “Are you interested in the weather? How about I tell you about tomorrow's weather forecast?\" And your customer says, “Absolutely. I want to know about tomorrow's weather forecast.” Have I given them the information yet? No. I just offered it. If this were a TV show, the script would say something like: “We're going to go to a commercial break now, and we'll come back with tomorrow's forecast.” In other words, we want to use information as the hook. Here's a greeting you could use: “Welcome, my name's [FACILITATOR NAME]. And yours? What can I get you information on?” Those of you who have attended a Cardone Enterprises seminar in the past will recognize this as a power greeting, where we take the information customers want and push it to the front of the process. To be clear, though, we're not talking about the giving of information, but the offering, this proactive, “Can I get you information?” This offer of information is what we use to break through the RDR, the customer's Reactionary Defense Response. That way, we can get on common ground quickly and convince the customer to give us control. Watch how this works: “Welcome, my name's [FACILITATOR NAME]. And yours? What can I get you information on today?” Your customer might say something like, “Uh, you want to give me information?” You say something like: “Sure. Be more than happy to. I'd like to get you price, payments, down payments-everything you need.” Do you see how that breaks the cycle? There's an interesting thing that happens. What I've used here to break the pattern is surprise. Most of you are not using surprise in your presentation. Advertisers know about surprise. It's a way to gain people's attention. You also interrupt what your customer thought they were going to see. And if I interrupt what people thought they were going to see or thought they were going to experience, I can generate some interest. Here's another example. At Cardone Enterprises, we're a training company. So what if we answered the phones like this? “Thank you for calling Cardone Enterprises. This is [FACILITATOR NAME]. What problem can I help you solve?” Now, why would I use that opening? Because people call our office to solve problems. Right? The people who call us don't really want sales training. They only want sales training because they want to solve a problem. So by asking that question, you'll get to what your customers want as quickly as possible. Open the conversation with what you believe to be on their mind. And, remember, you're not on their mind. Information's on their mind. But I don't give information here, do I? I offer it. I'm looking for a yes, which looks like: “Well, I'm looking for information on this and this.” Or: “I need help getting my sales team's numbers up.” That's agreement and that's also common ground. Just remember this distinction: Separate the offering and the giving of information. They're separate things. They don't have anything to do with one another. We're offering information to get an agreement-common ground-and then you're going to transition into the next step. What's the next step? Does anyone remember? Determine Wants and Needs. The actual giving of information comes later-in Steps 3 through 5. Remember my example? \"Would you like to know what the weather's going to be like tomorrow?\" Again, I haven't given the forecast yet. Your customer says: “Yeah, I'd love to know what the weather is.” Then you'd say something like: \"Great. I want to be sure that you get an accurate report of tomorrow's weather. By the way, where will you be tomorrow?” See how easily we moved into determining wants and needs? Here's another example from a car dealership. “Welcome, my name's [FACILITATOR NAME]. And yours? What can I get you information on?” They say: “Oh, I want information on this car.” You say, “Great. What do you want it to come equipped with?” Or: “Are there any other models you want information on as well?” See, we've moved into wants and needs. You see what we're doing here? Offering to get information to get on common ground, then fact finding to determine wants and needs. Information gets you information. The offer, “Hey, what can I get you information on?” immediately accomplishes a number of things. First, it's going to differentiate you from others in the greeting. Second, it's going to move you immediately into Step 2. You don't want to ever stop the sales process. You want to move it along, control it. Offering information puts you on common ground and it puts you in control, not by taking control, but because they'll want to give you control, which moves the process forward. We're in the information age here. We're also in the age of transparency. As I mentioned in the intro, selling has changed very little in the last 50 years. However, your customer's changed, the economy's changed, your competition's changed, and, as a result, you must change the way you handle customers. Information is free today. It's everywhere. The salesperson who most proactively and most professionally assists the client with the offering and delivery of information, satisfying the customers wants and needs, will position themself for the close and for the business. Period. Now, we're going to spend a little time practicing your greeting, but before we do that, I want to give you a few examples of great greetings. 7."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 1: Greet",
    "subsection_topic": "Examples: Great Greetings",
    "text": "Examples: Great Greetings Great greetings. Learn these and use these. Every single one of these will keep you moving forward within the Perfect Sales Process. [FACILITATOR: As you deliver each of these, deliver the greeting with the right physicality and tone of voice, so students can use you as a model for delivering their own greetings. “Welcome, my name's [FACILITATOR NAME]. And yours?” [pause] “John, great. What information can I get you while you're here?\" Do you see the smile, the posture, the light in my eyes, and the interest in the customer? Let's do another one: “Welcome, my name's [FACILITATOR NAME]. And yours?” [pause] “Before we get started, Elaine, I'd like to tell you that my job here is to give you all the time and all the information you need, so when you do get around to making a decision, I'm confident you'll consider us.” Here's another for you: “Welcome, my name's [FACILITATOR NAME]. And yours?” [pause] “Greg, if I could just take a moment to tell you our philosophy here. First, if we don't have the right product for you and are not able for some reason, to make the money agreeable, we don't expect you to do business here. Is that fair enough?\" Finally, here's one more: “Welcome, my name's [FACILITATOR NAME]. And yours?” [pause] “Kelly, my job is to find you what you want that fits your needs exactly, and provide you with figures you can agree to in the shortest period of time possible. That's my focus and that's my job. Is that agreeable to you?\" These greetings are proven ways for you to gain control and separate yourself from the competition. They're quick. They're fast. They're friendly. They reduce confrontation. And the buyer will turn control over to you so that you can keep moving them toward the close. 8. “Objections” in Step 1 Now, in this final segment about Step 1: Greet, we're going to handle, and I quote, the “objections” [FACILITATOR: Make air quotes with your hands as you say this] you'll experience in this step. I'm calling them “objections” because that's what many other sales trainers and salespeople call them. However, I want you to understand this: They're not really objections. They're RDRs, Reactionary Defense Responses. They're automatic things that people say without even knowing. As we discussed before the break, RDRs are designed to protect your customer and put you off. Most of the time, because salespeople are not trained well enough, they work. Many salespeople take them personally and give them far too much significance, even going as far as calling them objections. I'm talking about things like: “Hey, I'm just looking.” “I only have ten minutes.” “I'm looking for someone else.” “Let me see your manager.” “We're not buying for three months.” “We're going to wait for an insurance check.” There are three keys to handling these: 1. Handle them not like objections but as Reactionary Defense Responses. 2. Know that every one of these things, every one, that whole list that I just gave you, suggests that you have a real opportunity in front of you- a client, a customer. 3. Never let these things affect your attitude, and always agree to what the customer says or asks for. “I'm waiting three months.” Your response? “Excellent.” It's better to surrender here and close later than to fight people and never be able to close a deal. In these next 15 minutes, I'm going to help you prepare for these, so you don't get caught off guard. As you continue to work your position, you may want to keep a log of the RDRs you hear in Step 1. You might think it's going to be infinite, but you'll come to realize that there are probably no more than 15 or so RDRs you'll hear in this step. List them so you're prepared to handle every one of them that you hear. I'm going to show you exactly how to handle the most common RDRs you'll encounter. As we go through them, you're going to notice a theme: Many times, your buyer will ask for one thing, but they actually want something completely different. It's kind of like when a friend asks you for advice. Let's be honest: Most of the time, they don't really want it. So in this segment, we're going to talk about understanding how to determine the difference between 1) what people ask of you and 2) what they really want. This will be vital to your success as a salesperson. 9."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 1: Greet",
    "subsection_topic": "'Objections' in Step 1",
    "text": "Now, in this final segment about Step 1: Greet, we’re going to handle, and I quote, the “objections” [FACILITATOR: Make air quotes with your hands as you say this] you’ll experience in this step. I’m calling them “objections” because that’s what many other sales trainers and salespeople call them. However, I want you to understand this: They’re not really objections. They’re RDRs, Reactionary Defense Responses. They’re automatic things that people say without even knowing. As we discussed before the break, RDRs are designed to protect your customer and put you off. Most of the time, because salespeople are not trained well enough, they work. Many salespeople take them personally and give them far too much significance, even going as far as calling them objections. I’m talking about things like: “Hey, I’m just looking.” “I only have ten minutes.” “I’m looking for someone else.” “Let me see your manager.” “We’re not buying for three months.” “We’re going to wait for an insurance check.” There are three keys to handling these: 1. Handle them not like objections but as Reactionary Defense Responses. 2. Know that every one of these things, every one, that whole list that I just gave you, suggests that you have a real opportunity in front of you—a client, a customer. 3. Never let these things affect your attitude, and always agree to what the customer says or asks for. “I’m waiting three months.” Your response? “Excellent.” It’s better to surrender here and close later than to fight people and never be able to close a deal. In these next 15 minutes, I’m going to help you prepare for these, so you don’t get caught off guard. As you continue to work your position, you may want to keep a log of the RDRs you hear in Step 1. You might think it’s going to be infinite, but you’ll come to realize that there are probably no more than 15 or so RDRs you’ll hear in this step. List them so you’re prepared to handle every one of them that you hear. I’m going to show you exactly how to handle the most common RDRs you’ll encounter. As we go through them, you’re going to notice a theme: Many times, your buyer will ask for one thing, but they actually want something completely different. It’s kind of like when a friend asks you for advice. Let’s be honest: Most of the time, they don’t really want it. So in this segment, we’re going to talk about understanding how to determine the difference between 1) what people ask of you and 2) what they really want. This will be vital to your success as a salesperson."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 1: Greet",
    "subsection_topic": "Initiate and Disarm Your Buyer",
    "text": "Initiate and Disarm Your Buyer We'll start with our favorite way at Cardone Enterprises to handle an objection or an RDR. This strategy is a little “out there,” but it works in person, on the phone, or even in an email: Initiate the objection or RDR before your buyer can bring it up. Now, remember that list I just mentioned? Here's where it comes in handy. In order to initiate, you have to know every possible objection or RDR you might hear. That way, you can initiate them, take the sting out, control the process, and differentiate yourself from everyone else in your market immediately. Because, after all, why would you wait? If you know that your buyer is going to have a question or initiate some objection, why would you wait for them to bring it up? Why not just bring it up and disarm them? Maybe it's price, maybe it's payments, maybe it's about what you have in stock vs. what you have to special order, or maybe it's about how long the process will take. But before we get there, you need to anticipate what you, in your specific business and role, are going to hear. And instead of crossing your fingers and hoping they don't bring it up, get on the offensive, and address it. Bring it up yourself and you'll have immediate control of the process. Here's how it works: “Welcome. My name is [FACILITATOR NAME]. And yours? My job here is...” And initiate right here: “...to get you the product you want in the shortest time possible” or “...to get you the best price and terms, and anything else you need in the shortest period of time possible. Is that fair enough?\" Already with that opening, I'm initiating whatever my customers are most sensitive to-time, price, how long it's going to take-and this moves us further into the process. You have to assure people, guarantee them you're not going to waste their time, and immediately remove any confrontation from your process. The reality is that if you bring up buyer-sensitive issues before they're able to, you're going to force yourself to learn how to handle them. You're not going to be cringing inside, waiting for your buyer to bring them up. You're going to learn how to handle them with confidence so you can keep control of the sale. Be a pro here. Initiate sensitive issues, and I promise you, you will immediately differentiate yourself from everybody in the market. Now, let's talk about the three RDRs you're likely to encounter in Step 1, ones you'll want to get in front of. The first one, of course, is price. 10. “What's Your Best Price?” We're starting here because all of our students ask this question: “How do I handle price when a buyer brings it up early-before I want to talk about it?” We're going to talk about price a lot today, and it's such a misunderstood issue. However, the first thing you need to know is that if you're asking that question, you're focusing on the wrong thing. Let me explain. You've probably been told things in the past like, “Don't talk price. Don't give a price. Avoid price. Get control. Don't give it prematurely;” if you actually do any of those things, you're going to turn your buyer off. You'll also probably look like you have something to hide-and maybe even like you don't know what you're doing. None of these will reflect well on you or your company. And, in fact, it will likely create the exact reaction that you don't want. The bottom line is this: The more you hide from price, the more your buyer will want to hunt you down to get it from you. When a customer wants to talk about price, your best attitude is one of agreement. It's basically the first rule of selling, no matter whether you sell a $1 product or a $10 million one. When your buyer asks about price in Step 1, your response could be, “No problem. I'd be happy to get that for you. I know it's important, and I assure you, we will get you the best price.” Or you could say, “I'd be happy to get you our best price,” or “If the price isn't agreeable, look, I wouldn't expect you to do business with me.” Or here's the supercharged version: “Not only will I get you the price, but I'd also like to get you the terms, show you the most effective way to XYZ, and share some other options that you may not have considered yet.” What does every one of these say? That I'm confident. Here's the real trick: Every one of those statements has to be followed immediately by a question. Why? So that you can get off that topic and transition to another one. So although pretty much everyone we've ever taught at Cardone Enterprises asks us, “How do I handle price prematurely?”, there's another question they should be asking: “What's the transition question I need to ask right now to get off price and get to the next step of the Perfect Sales Process?” Do you understand what I'm saying here? Instead of asking us how to handle price prematurely, you should be focused on what question to ask so you can transition out of the price discussion. There's a vital rule governing the sales process: He or she who asks the questions and gets answers controls the process. Let me repeat that: He or she who asks the questions and gets answers controls the process. If the buyer says, “Hey, I want your best price,” and you give it to him here in Step 1, you're not in control. They are. So, instead, when you hear “[STUDENT NAME], I need your best price,” you say: “Sure, I'd be happy to get you the best price. I'd also like to get you payments, terms, and share some other options that might be possible for you. And by the way, I'd like to do it in the shortest period of time possible. Does that work for you?” Get agreement and then ask that transition question: “Exactly how did you want me to outfit it?” Or: “I'd be happy to. In addition to price, can I also show you alternatives that maybe you and the company haven't even considered?” What's the formula here? Agree, assure, and transition. Agree, assure, and transition. That transition question is going to move you right into the next step of the Perfect Sales Process: Determine Wants and Needs. That's where you need to be. And one final note: Never be scared of price. Be scared when they don't want a price. People that ask about price are buyers. People that never ask aren't buyers. So when you get the price question in Step 1, handle it: Agree, assure, and transition. Now, let's talk about the next RDR you'll hear a lot: “I'm just looking.” 11. “I'm Just Looking” If you've been in sales for any length of time, I know you've heard this one: Now this phrase, “I'm just looking,” suggests what? In my opinion, opportunity. “Hey, I'm just looking for some insurance. I'm just looking for a mortgage. I'm looking for some jewelry. I'm looking for whatever.” Think about it: Who doesn't look before they decide they want something? What does it mean? Usually that you've got a buyer who has some money to spend. They're looking because they're interested. Now, maybe they're not interested in your product, maybe they're not buying today, but they're interested in something. Salespeople hear “I'm just looking” so often, and because they don't know how to handle it-or their own attitudes about it-they become sold on the idea that people are just killing time. Look, nobody's got time to kill. People who kill time go lay on the sofa and watch Netflix. Never forget this: Under the right conditions, under the right situation, when sold the right product, “just looking” becomes “just sold.” But you have to know how to handle it, so let's run through this scenario. 1. Get your attitude right. If you don't have a positive attitude, you're never going to get past “I'm just looking.” That's why we went over your attitude first, before we even started talking through the Perfect Sales Process. 2. Know that “just looking” means they want to do something. What it is exactly may not be clear-not to you and not to them. “Just looking” for a watch might mean a ring for their partner. It means they want to at least move in the direction of buying something that you sell. It's up to you to help them get there, and that's what the Perfect Sales Process is all about. 3. When you hear “just looking,” realize what it actually means is “I need information.” And what's the next logical step here? They're looking for someone to give them that information-that's you. So show them what they need, and help them make sense of it all. Now that you understand what's really going on when someone says, “I'm just looking,” what kind of language should you use to handle it? “Great. I'd be happy to point you in the right direction. Are you looking for something bigger or smaller than what you have now?” You can adapt this to fit just about any industry: “Are you looking for more insurance than you have now or less?” Or: “Something that will provide you with more or less protection for the same or less money?” Or even more positively: “Great. You'll be happy to know we have an excellent selection of those to look at. Are you considering yellow or white gold?” Now, what do these questions remind you of? They're transitions, right? Just like we discussed in the last section on handling price. All of these questions transition you into the next phase of the Perfect Sales Process: Determine Wants and Needs. They keep the sale moving forward. Just like with the price questions, you're going to follow the same formula: Agree, assure, and transition. Here's another response to “I'm just looking:” “Great to have you here. Take as much time as you need to look. Can I at least point you in the right direction?” This works in any type of selling, particularly retail, and your buyer is going to tell you what he or she is looking for, which transitions you into the next step and keeps the sale moving forward. Don't be put off by “I'm just looking.” Remember what I said earlier. Under the right conditions, under the right situation, when sold the right product, “just looking” becomes “just sold.” Now, let's talk about the third common objection or RDR you might hear in this first step of the Perfect Sales Process. 12. “"
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 1: Greet",
    "subsection_topic": "What's Your Best Price?",
    "text": "We’re starting here because all of our students ask this question: “How do I handle price when a buyer brings it up early—before I want to talk about it?” We’re going to talk about price a lot today, and it’s such a misunderstood issue. However, the first thing you need to know is that if you’re asking that question, you’re focusing on the wrong thing. Let me explain. You’ve probably been told things in the past like, “Don’t talk price. Don’t give a price. Avoid price. Get control. Don’t give it prematurely;” if you actually do any of those things, you’re going to turn your buyer off. You’ll also probably look like you have something to hide—and maybe even like you don’t know what you’re doing. None of these will reflect well on you or your company. And, in fact, it will likely create the exact reaction that you don’t want. The bottom line is this: The more you hide from price, the more your buyer will want to hunt you down to get it from you. When a customer wants to talk about price, your best attitude is one of agreement. It’s basically the first rule of selling, no matter whether you sell a $1 product or a $10 million one. When your buyer asks about price in Step 1, your response could be, “No problem. I’d be happy to get that for you. I know it’s important, and I assure you, we will get you the best price.” Or you could say, “I’d be happy to get you our best price,” or “If the price isn’t agreeable, look, I wouldn’t expect you to do business with me.” Or here’s the supercharged version: “Not only will I get you the price, but I’d also like to get you the terms, show you the most effective way to XYZ, and share some other options that you may not have considered yet.” What does every one of these say? That I’m confident. Here’s the real trick: Every one of those statements has to be followed immediately by a question. Why? So that you can get off that topic and transition to another one. So although pretty much everyone we’ve ever taught at Cardone Enterprises asks us, “How do I handle price prematurely?”, there’s another question they should be asking: “What’s the transition question I need to ask right now to get off price and get to the next step of the Perfect Sales Process?” Do you understand what I’m saying here? Instead of asking us how to handle price prematurely, you should be focused on what question to ask so you can transition out of the price discussion. There’s a vital rule governing the sales process: He or she who asks the questions and gets answers controls the process. Let me repeat that: He or she who asks the questions and gets answers controls the process. If the buyer says, “Hey, I want your best price,” and you give it to him here in Step 1, you’re not in control. They are. So, instead, when you hear “[STUDENT NAME], I need your best price,” you say: “Sure, I’d be happy to get you the best price. I’d also like to get you payments, terms, and share some other options that might be possible for you. And by the way, I’d like to do it in the shortest period of time possible. Does that work for you?” Get agreement and then ask that transition question: “Exactly how did you want me to outfit it?” Or: “I’d be happy to. In addition to price, can I also show you alternatives that maybe you and the company haven’t even considered?” What’s the formula here? Agree, assure, and transition. Agree, assure, and transition. That transition question is going to move you right into the next step of the Perfect Sales Process: Determine Wants and Needs. That’s where you need to be. And one final note: Never be scared of price. Be scared when they don’t want a price. People that ask about price are buyers. People that never ask aren’t buyers. So when you get the price question in Step 1, handle it: Agree, assure, and transition. Now, let’s talk about the next RDR you’ll hear a lot: “I’m just looking.”"
  },  
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 1: Greet",
    "subsection_topic": "I Want to Speak to Your Manager",
    "text": "I Want to Speak to Your Manager” Have you ever had someone walk in and say to you, “I want to see the manager”? Or “the owner,” “the president,” or someone else high up? This makes some people nervous. However, I want to shift your mindset around this request. What if you approached this as an opportunity? What if you had the confidence that you knew everything you needed to turn any situation-vendor, complaint, problem-into a closed deal? What if you had the mindset that said: “Give me any living human being to convert into a sold customer, and I'll create my own economy”? What could you achieve? Think about that. Now, when someone comes in looking for the manager, you have one of three things: 1) a vendor trying to sell management on what they have, 2) a complaint, or 3) a buyer. If you have the kind of unstoppable mindset that believes you can sell anyone, those first two can also be made into clients: the complaint and the vendor. Grant loves to tell the story of an advertising exec who walked into a retail environment, looking to talk to the owner so he could sell him an advertising package. Grant sold him a house full of furniture before turning him over to the manager. With the right mindset and the right system, you can do the same thing. Now, how about the complaint? It might not seem like it at first, but they're even easier to turn into customers. How? By solving their problems quickly and easily-and just as effectively as a manager would. You just need to figure out what the problem is and solve it right there on the spot, if you can. Then the person doesn't have to wait around for a manager. Now, sometimes a buyer walks in asking for a manager because they think it will save them time-and maybe get them a better deal. This can be an opportunity, if you handle it. Because let me be clear: All of these scenarios are opportunities. Don't let them pass you by. Go into every interaction and every opportunity with the intent to sell. If you don't have the intent to close and finish, you won't. Right conditions, right situation, right product: Anyone can be converted. Let's talk about a couple of ways to handle this request: “I want to speak to the manager:” You say: “Your name, sir? Mr. Jones? Mr. Jones, thank you for coming in today. I handle all the accounts for management here. My position was created to save you time, determine what you want, and introduce you to alternatives that will save you money. My job is to treat you the way the owner would if he were able to wait on you himself. Will you allow me to do that for you?” Or, a simpler way to handle it: “I'm part of the management team here, sir. Your name?” Problems are opportunities, remember that. Convert problems, solve them- opportunity. Your management team hired you to handle customers, not turn them back over to management. Stay with this customer, be a service to this customer. They're not asking for a manager because they don't want something. They're asking for a manager because they do want something. Be professional. Act like you know what you're doing, act like a manager, act like part of the team, act like you can handle the problem, and, I promise you, with everything you'll learn today, you'll make the sale. Now, before we take a break, I'm going to take you through the next step in the Perfect Sales Process: Step 2: Determine Wants and Needs. Part 4: Steps of The Sales Process - Step 2: Determine Wants and Needs 1."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 2: Determine Wants and Needs",
    "subsection_topic": "The Importance of Determining Wants and Needs",
    "text": "The Importance of Determining Wants and Needs In this final session before our lunch break, we'll move into Step 2 of the Perfect Sales Process: Determine Wants and Needs. In this step, you'll discover what your buyer wants, what they need, and why. The fastest way to do this is a process called “fact finding.” You might also have heard it referred to as “qualifying,” “identifying wants and needs,” or even “investigation.” Whatever you call it, this step is all about getting quality questions answered. The ultimate purpose of this step is twofold: (1) to know what product to show your client and (2) to know how to present the product in a manner that will build value in that presentation, and cause them to want to act. When you ask the right questions, they clarify for you and your buyer what they want, why they want it, how they can justify actually buying it, and how you can make sense of them making that decision to buy. As we go through this step, keep in mind that even things of equal value are not identical when the motivation for that thing changes. A glass of water, for example, is the same as any other glass of water, right? That's true until you discover the reason why someone might want the glass of water. You'll uncover these in Step 2. For example, a glass of water for the Thanksgiving dinner table has a different connotation than a glass of water that would be used to wash poison out of someone's eye or one used to satisfy the thirst of someone who's dehydrated. You'd approach the selection and presentation differently for all these three scenarios, right? You would-if you wanted to make the sale. Remember all purchases or investments are trying to solve a problem of some sort. All of them. In this step, it's your job to understand your buyer's specific problem- the wants and needs driving the purchase. In order to do so, you'll be seeking out information such as: Why that product? Why did they decide to come in today? Why now? What's the motive? During Step 2, you might find yourself asking questions like: “What do you like about what you have now?” or “What would you change about what you have now?” or “What are you trying to accomplish by buying this product?” Ultimately, if you don't find out what is driving or motivating your customer, you won't know the right product for that person. You won't know how to present it correctly and you won't close the deal. We call this the Dominant Buying Motive-the DBM. In other words, what's that one thing that would push somebody over the edge and buy? Your challenge is to get away with asking the right questions and getting the answers, so you can collect the information you need to control the sale-and close the deal. 2."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 2: Determine Wants and Needs",
    "subsection_topic": "Overcoming the Challenges of 21st Century Fact Finding",
    "text": "Overcoming the Challenges of 21st Century Fact Finding Why did I frame asking these quality questions and getting the answers you need as a “challenge?” Your customers are guarded, for all the reasons we discussed this morning. They're trained not to give much. Maybe they even have bad perceptions of salespeople-because they've possibly been manipulated in the past-and they'll resist answering your questions. That's why your attitude is so critical. You need to present an attitude of service, not control; of helping people, not manipulation. Only then you will get your questions answered. Finally, it all comes back to something we've talked about earlier: putting your buyer at ease so they will answer questions. That's why the first step of the Perfect Sales Process-Greet-is such a critical foundation for the rest of these steps. Follow the system, and you're going to show up differently than your competitors. Because ultimately, you care more than anyone else and you need to present yourself that way. That's why you're asking these questions. Because you're more willing, more helpful, and you'll give more of yourself. That entitles you to ask more of your buyers. Lastly, one more thing to keep in mind: Practice the questions you'll use in this step until you feel natural. This is critical because you don't want to waste your attention on your questions. You want your attention on what? The answers. You need the quality information the buyer's answers will offer you. Now let's take a closer look at your goal in this step-the what, the why, and the how- as well as how those three things are going to help you close more deals. 3."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 2: Determine Wants and Needs",
    "subsection_topic": "The Goals of Step 2: The What, the Why, and the How",
    "text": "The Goals of Step 2: The What, the Why, and the How Why do people buy things? Ultimately, it all comes down to two reasons: 1) to solve a problem or 2) because they fall in love. People do crazy stuff to solve problems, and people do even crazier stuff when they're in love. Our goal is to find out what problem your customer's trying to solve and what they consider something they love. When it comes to Step 2: Determine Wants and Needs, we break it down into three areas we're looking to understand: 1) the what, 2) the why, and 3) the how. What do you want? Why do you want it? And how do you want it? In other words, what's the right product for this customer? Why do they need it? And how should you present that product and present the offer to close the deal? If you lack any one of these pieces of information, your customer simply won't buy. If you don't know what and why, you won't know how. So memorize these three things: the what, the why, and the how, because they're your key to closing the deal. Here's an example. Let's say you're selling phones. A woman walks into your store and says, “I want a new telephone. This is the phone I want.” Now if you really want to sell her a phone, here's the question you need to ask: “What's important to you in your next phone?” Why would you ask that question? She said she just wanted this phone. But you don't know what to show her. Are you going to show her how easy it is to unlock the phone, how to use Siri to dial hands-free, or how much capacity this new model has to hold apps and photos? You wouldn't know. She just asked for a phone. But what if she says: “Video is most important to me.” Now you have some direction. So you might say, “Let me ask you, why is video so important to you?” She might say: “Because I want to make videos for social media that I want to drop on YouTube. I also just had a baby and I want to send videos of her to my parents.” Now you know all the elements. You've got the what, you've got the why, and you know how to present that phone to her so she buys on the spot: It's all about those videos for her. Here's another example. Let's say you're a real estate agent. Your buyer comes to you and says, “I'm looking for a new house. I see you have that one for sale in Malibu. I'm interested in taking a tour.” You might say: “Excellent. Let me ask you, what's most important to you when you're considering a home? What is it about the location? Why is that important?” And he might say something like, “My wife is pregnant with our second child, and our current home is too far away from the school system we want our kids to go to.” You thought he was buying a house, just like you thought the previous woman was buying a phone. She was buying a video camera that uploads to YouTube, and he's buying access to a new zip code and the school system. All it takes is just a few simple, relevant questions so you know the three things-the what, the why, and the how to present it, so you can close those deals on autopilot. Let's do one more here, and I'm going to take you a little more in depth, so you can see how to use relevant questions to get the information you need. Let's talk about Thanksgiving. Have you ever found yourself in the grocery store, staring at the 16-pound, 20-pound turkeys, trying to remember what the formula is for how many pounds you need to buy for each person? If ever there were a scenario that needs the help of a caring salesperson more, I can't think of one. So let's say that we fly in a Cardone-trained salesperson to assist. That's me. So I arrive and I see a woman staring at the turkeys with a blank look on her face. I say: “Welcome, my name's [FACILITATOR NAME]. Are you getting ready for Thanksgiving? What information can I get you?” She says: “I'm looking for a turkey.\" I say: \"Excellent. How many people will you be feeding?” She says: \"Twelve people.\" \"Great. Are they all going to be eating turkey?\" \"No, three of them are vegans.\" “Excellent, now what would you like to serve them?” She tells you. You continue: “Great. What have you already purchased for that dinner?” She tells you. I say: “Excellent. Let me ask you this, Last year what did you do?” “Last year we did pork.” “Have you picked out your pork yet?” \"No, we haven't done that.\" “Good. So you're going to need turkey, and you're going to need pork roast. What about sides? Have you considered sides? What about desserts?” What do you notice here? See, I'm not going to sell her one turkey. I'm going to sell a turkey, a pork roast, something for the vegans. I'm going to get her four sides. I'm going to get her four desserts. I'm probably even going to get the alcohol handled for her. I'll be in business forever. I'm creating my own economy by taking the time to take interest in this woman. I'm not trying to control or manipulate her with questions. I'm trying to find out the what, the why, and the how. She came in looking for a turkey, right? Or rather, she said she was looking for a turkey. But she's not looking for a turkey. She's here to solve a problem. She's in this store to buy dinner to take care of her friends, her neighbors, her family, or whoever is going to her Thanksgiving dinner. Look, if you don't sell her a turkey, a pork roast, something for the vegans, the side dishes and desserts, then you're the turkey. And by taking the time to ask smart questions, you're going to be able to get the customer to give you control. You're showing interest, and you're going to speed up your process. You're actually able to speed up her process as well by clarifying the difference between what she wants and what she needs that she can be closed on. To be clear: Your goal is not to change the customer's mind about what they're buying. Your job is to find the right product or solution that will satisfy their needs. The most important person in the sales cycle is not you. It's the customer. The more you ask questions, good questions, the more important the customer is going to feel. So let's talk about four great questions that will help you figure out what people want, why they want it, and how to present it so you close them. These questions will also reveal some additional information: what they're willing to give up and what they're not willing to give up. Question #1: What would you like to have if you could afford it? Question #2: What do you need to have that you're not willing to give up? Question #3: What do you have now that you'd like to have next time? Or: What have you done before that you'd like to repeat? Question #4: What would you like to have next time that you don't have now? Make these questions a part of who you are, so you can do a better job of finding out what people want, why they need it and how to close them. Now let's talk about another method that can give you some clues as to how your buyer will respond during the sales process. 4."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 2: Determine Wants and Needs",
    "subsection_topic": "Uncovering Clues from Past Purchases",
    "text": "Uncovering Clues from Past Purchases Detectives inspect the scene of the crime to find the clues they need to solve that crime. In sales, we do something similar, but what we're doing is going back to the last thing your buyer bought that's similar. That purchase leaves clues. I don't care what you sell. Go back to a similar purchase, something they can relate to, one that they'll talk about, and it will show you what your buyer will do in the future-and, more specifically, how they'll respond during the sale you're trying to close. To return to the example of selling phones, you might ask questions like: Tell me about the last phone you bought. Who'd you buy it from? What plan did you buy? What did you like about that phone? What didn't you like about that phone? What would you change about the phone? If your new phone could do one thing that your old phone couldn't do, what would it be? Your buyer might tell you, “I hated my last phone because it took terrible pictures.” She's telling you exactly how to sell her a phone. Even when they're not getting rid of the old product, this still works. For example, if someone were buying a vacation home from me, I'd want to know about where they're living now. Why? So I can understand how to build value. So I can discover what they think is important in a home. You're controlling the sale with questions like, “Let me ask you, what do you want your new purchase to do that your other one didn't accomplish for you?” or “If the next could only do one thing or solve one problem, what would that be?” Go back to the scene of the last crime. And remember, what I said earlier: Always get an answer to your question. Don't move on to another question without an answer. That way, you keep control of the sale and keep collecting information that's going to help you close. 5."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 2: Determine Wants and Needs",
    "subsection_topic": "Questions You Should Never Ask",
    "text": "Questions You Should Never Ask Now, there are a few questions you never want to ask in Step 2. Salespeople who have asked these questions have gotten their hand slapped. Then they quit determining their buyer's wants and needs, and their close rate bottoms out. Why? Because they're skipping steps within the Perfect Sales Process-and because these are just bad questions to ask in the first place. I'm going to lay these out for you, and I never want to hear you ask any of these: What can you put down? What can you pay? What do you owe? What is your budget? Will you buy today? How's your credit? Where do you work? How long have you been there? What do you make on your job? Is your spouse going to be involved in the decision? Do you rent or own your home? Are you shopping anywhere else? What price did they give you? Now, what's the big problem with all of these questions? First, they're not going to put your buyer at ease. They're too personal-and they're negative. Instead of putting the buyer at ease, you're going to put them on alert. Additionally, when you ask questions like this too early in the sales process, you also run the risk of your buyer locking in on a figure that's too low. They're not sold on the fact that the product will solve their problems, and they haven't discovered that they love it. As a result, your buyer's going to minimize any figures they're going to pay, because they don't like you yet. There's no relationship there. As a result, you're going to get some really unrealistic answers that won't be useful to you. Your customer will become inflexible because they're going to lock down on a price that's not realistic. It's going to make your close very difficult. So stay away from these questions. They don't get you smart answers. They don't move the sale forward, and, worst of all, they make you sound like everybody else. 6."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 2: Determine Wants and Needs",
    "subsection_topic": "Great Questions to Learn Cold",
    "text": "Great Questions to Learn Cold Now that you know what not to ask, I'm going to give you a list of great questions to use in this step. In just a moment, we're going to take a few minutes and customize these to what you do. Then when you go home, you need to sit down and memorize these so you know them backward and forward. Why? So you're fluid, not mechanical. Then you can focus on the answer, which is going to give you the critical information you need to make the sale. First, let's go through some questions about their current and future situations-in other words, what they're looking for: “Do you want to go bigger or smaller than what you have now?” When you customize this phrase for your product, the question might become “longer or shorter” or “heavier or lighter.” Find the features that differentiate your products and use them here. “Who will be the primary user? Who will be the secondary user? Will that person be involved in the selection?” “How do you want it to come equipped?” “What options would you like to have, if affordable?” “What do you want on your new one that your present situation doesn't have?” “What do you want the new one to do for you that your present one doesn't do for you?” “What major benefit do you hope to get from your new product?” “What else do you hope to get?” “Oh, by the way, why do you have an interest in this? Why is this product important to you?” “Why are you considering it at this time?” or “Why now?” “Why did you call today?” or “Why'd you come in today?” “Have you ever owned something like this before?” “What is the single most important thing that you want from your next purchase and why?” “What's the second most important consideration of this purchase and why?” Next, I'm going to run you through a list that's going to help you even more than the previous list-one with questions about their previous purchases: “What are you using now to solve this same problem?” “What do you like about what you're using now to solve this problem?” “What don't you like about it?” “When's your next payment due?” Even if they tell you they paid cash for it, that still helps you. It leaves clues about how you can help them later. “Did you buy it new or used or did you buy it as a floor model?” That's good info to know. “How long have you had it?” “What was the list price back when you bought it?” That's going to help you justifyyour price. “Let me ask you, would you purchase that product again?” If yes, “Why?” or if no, “Why not?” “What do you like most about that product? What did you like least about that product?” “Do you feel your present situation has been worth what you paid for it? Do youthink it was a good deal?” Would they repeat it? That's what you're trying to find out. “Have you made any changes to it since you purchased?” See what I'm doing here? I'm using their current situation to collect information on how to close on the next situation. The first list of questions helps you understand what they want. Then, this second list, by discovering what they've had and what kind of experience they've gone through, will show you how to close them. Customize these lists for your particular situation, put both of them together, and know them cold. Do those things, and I know you'll close more deals. Part 5: Steps of The Sales Process - Step 3: Select Product and Present/Build Value 1."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 3: Select Product and Present/Build Value",
    "subsection_topic": "The Keys to Step 3 of the Perfect Sales Process",
    "text": "The Keys to Step 3 of the Perfect Sales Process Welcome back! Before lunch, we covered the first two steps of the Perfect Sales Process in detail: Step One: Greet, in which you discovered how to introduce yourself, make a good impression, and put the buyer at ease, and Step Two: Determine Wants and Needs, in which you investigated not only what the buyer wants and needs, but also why they want it. Now, we're going to move into the next phase: Step 3: Select Product and Present/ Build Value. Step 3 of the Perfect Sales Process centers around three things: 1) knowing what product to show your client and then 2) demonstrating that product in a manner that builds emotional urgency to own it, and then, finally, 3) putting together a presentation that demonstrates value that exceeds the value of their money. In this first section, I'll cover that first point. Then, we'll take a quick break and do a deep dive on putting together a great presentation. This step hinges on these principles: You cannot close if your product doesn't exceed the value that your buyer puts on it. You also can't close if you show your buyers the wrong product. If it doesn't fully satisfy their wants and needs, they will not buy it at any price. If it's outside their ability to pay for it, they will also not buy it. Would you agree? [FACILITATOR: Get assent before moving on.] If the product doesn't solve problems, they're not going to buy. If they don't have complete confidence in the product or if they don't love it, they're simply not going to buy. I'm going to show you how to overcome all of these challenges in this step. First, we're going to talk about how to select the right product. Then, I'll show you how to demonstrate it in a professional manner whereby quickly you can validate that the product solves their problems, fulfills their wants and needs, creates urgency, engenders love in their heart, and leaves them with the feeling of: “I've got to absolutely have this!” And here's a distinction I want you to understand in this step: Select for your client rather than allowing them to wander through your inventory and select for themselves. Whether your product is tangible or not doesn't matter. If you're selling insurance, based on what you found out in the first two steps, you should now be able to select and present a solution, while explaining how it will benefit your client. The same holds true with any other presentation, whether it be a piece of art, a car, furniture, a membership at the country club, a gift for a charity event-or even a simple glass of water. You should present your product based on what your client told you was important to them. If you've got a man choking in front of you, he doesn't care about the quality of the crystal or the quality of the water. If you haven't taken the time to find out in Step 2 what's important to your buyer, you'll waste time in your presentation showing them things that just don't matter. That's why it's so important to do every step of the Perfect Sales Process-in order. Shortcut the demonstration and you only reduce your chances of making a sale. Spend too much time during the demonstration on things that the buyer doesn't find valuable, and you not only waste time but also reduce your chances of making a sale. By the way, we used to teach these two steps separately, as the selection and the demonstration. However, they're so interrelated that we're going to discuss them together. Selecting the right product and knowing how to present it will determine whether you're able to close the deal, and both will also have a direct impact on how successful you are as a salesperson. Let's dive into the first part of Step 3, the selection. 2."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 3: Select Product and Present/Build Value",
    "subsection_topic": "Selecting the Right Product",
    "text": "Selecting the Right Product Now as we move into the first part of this step, the selection, there's one fact I want you to know: Understand that if your buyer already knew what they wanted for sure, they would have already bought it. I'm going to repeat that, and you should take it as a rule. No matter how crystal clear your client may appear regarding what they want, know this: If they were certain, they'd already own it. So any time a buyer is shopping with me for anything, I know that they're not sure about something. Assumptions are rarely safe, but this one is: I assume in every selling situation that the person you're working with is only closed on what he or she wants, and never, never completely clear on why he or she wants it. Understood? Another fact that I've discovered from personal experience: Around 50% of the time, your buyer will be interested in a product that will not fulfill his or her wants and needs. Think about that. Now do you understand why you can't skip the selection? Why you can't let them select the product themselves? Why talking about price right off the bat is a bad idea? Because your buyer isn't even on the right product over 50% of the time. And what does that really mean? It could mean too much product. It could mean too little product. Or, it could mean just not the right product at the time. What happens as a result of all of this? They don't close, right?, Why? Because they're not fully clear on why they want it almost 100% of the time. And if they aren't clear on why they want a product, they will not close on it. And 50% of the time, it's not the right product anyway. That's why determining wants and needs-fact finding-is so important. In that step, we verified what problem they're trying to solve. We asked things like, “What do you want this to do that others don't do for you?” and “Why did you come in at this time?” That's why those of us at Cardone Enterprises answer our phones with: “Hi, this is [FACILITATOR NAME]. What problem can I help you solve?” Because everyone that calls is calling to solve a problem. Maybe they want to make more money. Maybe they want to close more. Maybe they want to do it all faster, quicker, better. Everyone's got problems. So what problems are your buyers trying to solve? Pay attention. Remember what your buyer told you. Collect that information so you can use it to select the right product and build value around it. Just remember: Your buyers don't have complete certainty or they would have bought already. You should already know the problems they're trying to solve, so you can put them on the right product. Add that extra ingredient-certainty-and you'll be that much closer to closing the deal. 3."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 3: Select Product and Present/Build Value",
    "subsection_topic": "Verifying Selection with Alternatives",
    "text": "Verifying Selection with Alternatives Now, how do we get absolutely certain that we're offering our buyer the right product? It all comes down to one of the great secrets of selling: offering your buyers alternatives. There are all kinds of benefits to doing this. And let me be clear: I offer my buyers an alternative in every selling situation before I guide them toward what they stated they want. Here's how that might look. As I'm moving the client towards the target product-the one they're interested in-I ask this question: “Is there any chance you'd consider moving up a model, if it were affordable?” Your buyer might say something like, \"Well, what do you mean?\" And you'd say, “Well, would you move up to the sport model?” (Or a different package, whatever represents a step up in your world.) “It's only going to be a little more money. And with the payment programs we have right now and the interest rates so low, the payments are going to be well within-” Maybe they break in and say: “No, no, no. I definitely want this vehicle. I've done all my research. This is the one I want.” Or: “This is the phone I want.” Or: “This is the policy I want.” Or: “This is the house I want.” So what did I just accomplish? I got some more information, didn't I? And I increased the buyer's certainty. By the way, alternatives aren't exclusively about moving up. They're also about moving down. To offer a lower-priced alternative, you could say something like: “Would you consider moving down a model? Save you two, maybe three thousand dollars?” Now, why would I do this? Why would I check out a lower-priced alternative with somebody, especially somebody who walked in and gave me a sheet of paper and said, “This is exactly what I want”? Let's play this scenario out. First, the buyer tells me what they want. I'm going to say, “No problem, let's go find it.” Then as I'm walking toward it, I'd turn back and say, “Hey, any chance you'd consider moving down a package, save you about two or three thousand?” What does this do? The same two things as offering a higher-priced alternative: 1. It validates and confirms that you're on the correct product choice. Remember, if your buyer knew for sure, they what? They wouldn't be shopping. They'd already be driving it. 2. It demonstrates to your buyer that you want the right thing for them, from your heart. Why would you offer to save somebody money? Why would you offer to put them in something better-equipped if it could be close to what they're spending now? Why would you do that? Because you're looking out for them. By offering choices, you actually show people that you care, that it matters to you that they're on the right product and they get the most value for their money. Here's another example from another industry. Let's say you have a buyer who asks about a home in Bel-Air. You could say, “Would you consider moving to another neighborhood rather than Bel-Air? Save you anywhere from 800k to a million dollars?” If they say, “No, we don't want that. We only want to live in Bel-Air.” What did you just find out? They're locked in to Bel-Air, and you probably helped them clarify that. Now, if they say, “Yes, we would look at other neighborhoods.” Or, “Well, we might.” What'd you find out? They're not locked in to Bel-Air. They don't know what they want yet. They might be looking in the wrong area completely and they need you even more to help them with the selection. Now, one last point about alternative offers. I get some salespeople who come to me and say that their buyer got upset about being offered alternatives. Maybe they heard their buyer say something like, “Why do you keep trying to show me something else? This is the one I want.” That's not a customer who's upset. That's a customer who's clear. And maybe you even helped him get there. Don't take it as anything other than that. Your response? “No problem, sir. I'll take you right to the one you want. I just wanted to show you that we have other options for you in the case that you wanted to investigate them.” Look, most salespeople aren't salespeople. They're order takers who wander around wondering, “Why don't I sell more?” It's because they don't actually sell. They just take orders. Understand this: People cannot and will not make decisions without knowing what the choices are. Choices do not confuse people. Choices actually allow the mind evidence that it has considered enough options. When people go to buy, their mind is telling them things like: “This is the first place we've looked. You haven't looked at enough stuff. You'd better not do it yet. Don't make any rash decisions.” But then you come in and say, “Sir, would you consider something smaller?” His mind says, “No. Okay, we checked that off.” You say, “Sir, would you consider something bigger?” His mind says, “No. We checked that off. Okay. We know what we want.” His mind's clear. Then he can make a decision. Always offer alternatives before you select. This is one of these distinctions to selling that will catapult you to another arena. Now, let's get a little more tactical here and break down the mechanics of alternatives. 4."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 3: Select Product and Present/Build Value",
    "subsection_topic": "The Mechanics of Offering Alternatives",
    "text": "The Mechanics of Offering Alternatives “Would you consider...?” Those three words could become the most powerful words in your career. So as you're presenting these alternatives, think of them in three categories: 1) less, 2) more, and 3) older/newer. The key though, is to do all of this before you pick a product to show your client. A lot of salespeople offer alternatives too late in the sales process-often because they're desperate to close. Most of the time, this kind of thing happens because they weren't thorough in Step 2 and they've presented a product that doesn't solve the buyer's problem. Imagine a sale where you've presented numbers, you negotiated, and you can't close the deal because of money and then you say, “Let's look at a lower-priced model.” You're too late. You're timing's off. Your buyer has been with you for hours. They're going to think this is a waste of time. So although “would you consider...?” is a powerful phrase, you've got to use it in the right place. Everything that we teach at Cardone Enterprises is about initiating. Be the horse, not the buggy. You want to initiate, not react. You want to predict and you want to differentiate. That's why you need to offer alternatives early in the process, not after you've tried to close someone. Think of offering alternatives as a service. It's not a trick or a manipulation, and it's not designed to help you. It's designed to help your buyer. It will, however, help you close more transactions and make sense of the proposal you're presenting. Think about it this way: If before showing or bringing something to your buyer-or having them test something out-you could offer to save them $500, $800, or even $1,000 dollars and they say no, but then later in the close they say the price is too high. Are you going to use this information? Would this not be a benefit to you in the negotiations? After all, by offering less or more during Step 3, I'm defining the parameters for negotiating. See, when I think in terms of negotiating with people, I'm always thinking, “How am I going to present?” Basically, I want to position myself in this way: The less I have to negotiate, the less there is to negotiate. Most salespeople negotiate an infinite number of things from A to Z. I want to negotiate fewer items by bringing the parameters in. “Hey would you consider something to save yourself $800 or $1,200 dollars?” (Rather than $3 or $4k.) See what I did there? I shortened the parameters down to $800-$1,200 dollars. Offering alternatives also gives your buyer an option to move and save face. Alternatives demonstrate that you're trying to save them money and be of service, so you can always return to that as a solution in the close without the buyer losing face. Let's talk about how that could work: Say you offer your buyer the chance to move down a step when you're offering alternatives. Now, let's fast forward to the close. Maybe you're struggling to get the deal done. You can easily say, “That's why I suggested the E model. Let's go look at it now.” If you hadn't brought it up earlier, you couldn't move to it then because your buyer would lose face. See how offering alternatives can assist you even later in the close? Finally, there's one more problem that offering alternatives can solve: Customers who are complaining about price. Most salespeople think those buyers are on too much product and that's why they're complaining that it costs too much money. The opposite is actually true. Buyers who say it's too much money aren't on too much product. They're on too little product and what they're really saying is, “It's too much money for that product.” Offer them a level up and you'll solve that problem. Remember: It's impossible to close someone on the wrong product. And it's impossible to get the right money on that wrong product. Initiate alternatives before the presentation, do it again before you enter negotiations, and you'll eliminate this problem, getting you that much closer to closing the deal. 5."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 3: Select Product and Present/Build Value",
    "subsection_topic": "Presenting and Building Value",
    "text": "Presenting and Building Value Welcome back! Let's quickly direct ourselves to where we are right now. We're still in Step 3. And now that we've clarified that we have our buyer on the right product, it's time for us to give a presentation that builds value. And what's the outcome here? We need to demonstrate enough value to exceed the value of the buyer's money. If you've done other sales training, you may have heard this referred to as “the walk-around,” “the demonstration,” “the presentation,” or “the demonstration presentation.” Whatever you call it, know this: If you show your buyers absolutely everything, you're going to take too long, and you're going to overwhelm them. So our other main objective here is to know what to show your client-how to tailor your presentation to fit their wants and needs-and then show them the key features, advantages, and benefits. So, here's what I've got: a bottle of water. [FACILITATOR: Lift up a bottle of water.] How do I feature this? Is it convenient? Does it fit in my hand? Is the water great? Can I just throw it away when I'm done? Oops. Your buyer is walking away because he was interested in saving the planet. You said one thing too many. Before you start communicating, you need to understand what your buyer values. And where do you get this information? From Step 2. Otherwise, you could talk forever about a phone, a computer, a car, or a house and never get anywhere. So once you know what they want to hear, you need to talk about three things: the features, advantages, and benefits. Let's start with the first one: A feature. The Merriam-Webster Dictionary defines a feature as “something offered on your product that's particularly attractive.” So let's use a phone as our example. It fits in your hand. It fits in your pocket. That's not the advantage. That's what it is. The advantage is your higher ground, what you have that other people don't. In other words, how is this better than the competition or another solution? Example: Our phone is faster than any other phone in the marketplace right now. That gives me the high ground. Now, the benefit: What does your buyer get as a result of that advantage and that feature? You can spend less time waiting for stuff to download, so you can get more done and get back to whatever else you were doing that you interrupted to check your email. That's the benefit. Let's go back to our bottle of water. It's a bottle of water. That's the feature. It has a cap on it. Feature. Now, what's the advantage of that cap? The water doesn't fall out, right? What's the benefit? It makes this water easy to take anywhere. So with this bottle of water, let's say our advantage is that our water is capped and it's a smaller size that fits in your hand. The benefit? You can slip it in your pocket and take it with you, so you can stay hydrated wherever you go. We're going to dive into the feature, advantage, benefit concept in a moment, but there's one rule I want to cover first: Never show a feature without attaching an advantage and benefit. When you say, “The design is revolutionary,” you want to tie the benefit into the buyer's dominant buying motive (DBM)-the “why” that's motivating their purchase today. Why is that feature important to that buyer? Good gas mileage: That's a feature. Advantage: Better gas mileage than any other car in its class. Benefit: Saves you at the gas pump, every time. Great for road trips with the kids. In just a minute, we're going to take some time and come up with a list of features, advantages, and benefits for the products you're working with. But first, I want to go a little deeper on these three concepts so you understand how you'll be using them during the Perfect Sales Process. 6."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 3: Select Product and Present/Build Value",
    "subsection_topic": "Features, Advantages, and Benefits",
    "text": "Features, Advantages, and Benefits I just gave you this rule: Never show a feature without attaching a benefit and an advantage. Now I want to go into the psychology behind that rule. It starts with understanding what features do. Sometimes, features actually work against you: They raise the price in the buyer's mind, and they can actually scare people. Let's say you start rattling off all these features: “The car has this, and this, and this. It's got everything. It's fully loaded.” Depending on your buyer, they might start thinking, “This car is too expensive for me.” That's not good. It could even scare your buyer off. So know this: Until you attach advantages to these features and also know how they benefit that customer, you're just talking. Talking does not build value. If you can't build value, you can't close the deal. This is one of the big mistakes salespeople make. Closers don't make this mistake. Advantages and benefits increase value, increase emotional attachment, and increase the urgency to own. Let's go through a couple of examples so you can continue to see how this works. [FACILITATOR: Demonstrate these in a rapid, easy pace, so you sound comfortable with these features, benefits, and advantages.] Feature: This model is fully loaded. Advantage: This model is outfitted with a special package deal that provides you with all these luxury features bundled at a lower cost. Benefits: Increased resale value and you get all the comforts and features at a lower cost. Feature: 22-inch wheels. Advantage: The car actually rides better, much more smoothly. Benefit: Higher resale value, more comfort for the entire family. Let's grab an example from another industry: Real estate. Feature: Large, open-plan first floor. Advantage: This model has more entertaining space than any other one we sell. Benefit: It's a great space for hosting parties with room for people to circulate, and you can cook and entertain at the same time. Feature: Three-car garage. Advantage: Most of the houses in this area only have a two-car garage. Benefit: You can keep your two cars out of the California sun and still have room for a workbench (or a home gym or a ping pong table for the kids-whatever lines up with the buyer's DBM). Did you hear how quickly and easily I rattled those off? Good. That's how you need to rattle them off. You need to know your features, advantages, and benefits cold, and they need to roll off your tongue with ease. But remember this: Every human being you will work with is different. While they all look for features, they give their money for the advantages and benefits. What you think is an advantage and a benefit may be things you'd pay for, but they may be ones I wouldn't pay for. That's where the answers you got in Step 2 come in. People pay for advantages and they pay for benefits-but they only pay for the ones that matter to them. When you get this right, advantages and benefits create an emotional connection, an urgency. There's no need to push them to buy. They want it. And it all starts with anchoring down these advantages and benefits. 7."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 3: Select Product and Present/Build Value",
    "subsection_topic": "The Why",
    "text": "The Why Now that we've gotten some of your features, advantages, and benefits lined up, the question becomes which ones to use on which buyer. That comes back to the psychology of the buyer-and something we call “the why.” Why does your buyer want this product? What are they trying to accomplish? Know this: If they didn't want to improve their situation in some way, they would not be shopping. So what you need to understand is: What do they want and why do they want it? Let's take the example of buying a car. Most people already have a car. So why do they want another one? Are they looking for safety? Dependability? Appearance? Ego? Economy? Comfort? Performance? What is it? Maybe your buyer's just got a bug, and he's thinking, “I've just got to have a new Tesla.” Your job is to find out what they want, why they want it, and what they will pay for it today. I mentioned it earlier: This concept is called the dominant buying motive. I want to dig a little deeper into this concept with you. “Dominant” means “commanding, controlling, or prevailing over all others,” right? “Motive” means “a need or desire that causes a person to act.” So I'm looking for what? The commanding thing that causes your buyer to act. You should always be crystal clear on this. What is that motive, that one thing (or two things) that will cause this person to do something? You need to know this before you demonstrate and before you close. What is that one thing above all things that will cause a person to take action? Your product has hundreds, maybe even thousands of features. But only a few of them are required to get the sale. Understanding your buyer's dominant buying motives will tell you what you need to show them. Those questions we asked in Step 2: Determine Wants and Needs will come in here. Questions like, “What's the single most important benefit that you hope to accomplish in your next purchase? What is the second most important benefit of your next purchase? If you could accomplish one thing with your next purchase, what would it be? What is it that your present situation doesn't offer you that's a must-have?” If you've asked those questions, you'll understand the why. That will tell you how to present and build value, and it will show you how to close. Now, there's an easy way to break down these dominant buying motives. We call it “APES.” It offers you an easy way to remember the four major reasons people buy things. A: Appearance - It makes the buyer look good. P: Performance - It makes them feel good in one way or another, maybe because it's faster, smaller, lighter, etc. E: Economical - It saves them money-or worry. S: Security - It makes them feel safe and secure. Let's look at this when it comes to phones. Appearance - Some people love the look of the iPhone, and that's why they bought theirs. Performance - The cameras on these phones and the speed is only getting better. That might motivate some buyers. Economical -Some people choose their phone because AT&T or another carrier will give it to them at a very low price or for free. Security - Maybe you've dropped your phone in the toilet and you can't afford to be without a cell phone in case it dies on you. You're buying a new one for security and dependability. Let's take another example from our class here today. [FACILITATOR: Ask one student to share their product and go through the APES for that product.] So with your buyers, you'll find their why in one of the APES. And maybe they're working with two-one dominant buying motive that's supported by another. Every day people spend money to acquire A-P-E-S, APES. Find out which one is most important to your buyers, and you'll know how to build value in your presentation-and how to close them. 8."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 3: Select Product and Present/Build Value",
    "subsection_topic": "Controlling the Presentation",
    "text": "Controlling the Presentation Now that we've got the psychology of the presentation nailed, I'm going to go into the mechanics. Master these strategies step by step, and you'll control your presentation from start to finish, building value in your buyer's mind and moving you toward the close. #1: If needed, start by assuring your buyer-over and over again, if necessary-about price. Particularly price-sensitive people may be anxious to get the price, and it's your job to assure them that the price will be right. If you hear these fears in your buyer, reassure them at the start of your presentation with language like “I'll handle the price. Don't worry about it. If you don't buy because of price, it will be my fault.” Or: “I assure you, I'll make the price right; if I'm unable to, I don't expect you to buy here. The most it will cost you is ten minutes of your time.” Or: “You let me handle the price. Let's just make sure this is the right product/the right house/the right insurance for you.” Make sure you do this before you start presenting. Next, #2: Ask permission to present the product. Now, why permission? Your goal in every situation is to get complete and total control while you're presenting. You need to command and demand attention, and the best way to do that is to get agreement first. You might say something like, “Sir, would you allow me just a few minutes to show you the features, advantages, and benefits of your new _____?” Once they say “yes,” you're ready to transition into your presentation. One more distinction here that's going to make you even more effective: Address time when you ask for permission. Give them a time frame to set their expectations. This works really well for time-sensitive buyers. Here's how you can frame it: “Sir, would you allow just a few minutes to show you the features, advantages, and benefits of your new _____? It will only take about ten minutes, and you'll know everything you need to know about the product.” Remember, control is critical and in the presentation, to keep it, you must be interesting. You're no longer being interested in them, you're now going to be interesting. “Ma'am, would you allow me just a few minutes to show you the features, advantages, and benefits of your new ______?” Once you get agreement, set their expectations by saying something like, “Great, this is what I'm going to do: I'm going to start right here and I'm going to end up right here. As I do, if you have any questions, stop me, and I'll be happy to explain.” We're going to talk more about where you start and finish in a minute. But for now, just note that you want to give your buyer a little overview and it's always good to invite questions. Next, #3: Choose the right setting. This is important for two reasons. First of all, it ensures that you're in an environment where you have your buyer's full attention. For example, let's say you're selling phones. When you're demonstrating the phone you've selected, you don't want the buyer looking at 54 other phones. You want her to focus on the one you've selected, and you want it to actually move her emotionally. So take it out of inventory, if you can, and move her to a quieter place to look at the phone. If you're selling cars, consider driving to a quiet and appealing location before you do the demonstration. Ideally, this is a place that will make it easy for your buyer to focus on the features, advantages, and benefits you're about to present. This gives you their full attention. Second, when you say something like, “Ma'am, follow me. I want to show you something,” that puts you in control. “Sit here, I want to show you something.” “Let's take a ride. You have to see this.” These are both control mechanisms for your presentation demonstration. Use them to command and demand attention. Next, #4: Deliver the actual presentation and break it into parts. No matter what product you're selling-an insurance policy, a car, a phone, a house, a seminar you're going to deliver-you need to break it down into parts. At Cardone Enterprises, we think of it as a clock. You're going to break every product presentation into one of two configurations: 1 Four Parts: Midnight, three o'clock, six o'clock, and nine o'clock, or 2 Six Parts: Midnight, two o'clock, four o'clock, six o'clock, eight o'clock, and ten o'clock. All products, regardless of what you're selling-even intangibles like an insurance contract-can be broken down in a similar fashion. The idea is that you mentally hit each step of the process, control that presentation, and touch on the points that are vital, the ones that line up to your buyer's dominant buying motives. Then each time you complete a part, ask the question: “Have you seen enough to make a decision?” After all, there's no need to do a two-hour presentation if you nailed it in 12 minutes. If not, if they want more information, keep going. Here's an example: Let's say I'm selling a car. My customer has said he's most interested in the interior. So that's where I'm going to start. That would be midnight. Then I'll ask the question: “Have you seen enough to make a decision?” If not, I'll show him the front and engine. That would be two o'clock, and I'll ask again. Then the passenger side and that side of the vehicle would be four o'clock. The rear trunk would be six o'clock. The driver's side and that side of the vehicle would be eight o'clock. Then I put him in the driver's seat, that would be ten o'clock. Now, here's the big key to making this work. The last part of your presentation should end up where you want to move the demonstration into the hands of the customer. For example, notice in the car example that my clock finished with my buyer in the driver's seat. I wanted him to start to assume ownership by ending up behind that wheel. Now, let's say your buyer is interested in a Rolls Royce Ghost and she's mostly going to be riding in the back seat. Shift your clock, so you end the presentation there and she can experience exactly what it's like to own the car. What does this tell you? You always need to understand where you want this presentation to end. So as you put yours together, be thinking about that. And what else does this tell you? That you need to know all these parts perfectly-boom, boom, boom, boom-so you can hit the points that line up with your buyer's dominant buying motives and end them in a place where they can really start to experience ownership. Remember, what's the key? Practice until you're fluid, not mechanical. At the end of the day, you only have so much time with these people. You have to know what you're doing. You've got to know exactly where you're going to start and how you're going to end, and you have to know it cold. 9."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 3: Select Product and Present/Build Value",
    "subsection_topic": "The Rules",
    "text": "The Rules Now that we've covered the psychology and the mechanics of your presentation, let's go over a few rules to help you keep the Perfect Sales Process moving forward smoothly. Rule #1: Always, always, always control the presentation. Slow the process down if you have to, in order to maintain control. For example, let's say your buyer keeps taking phone calls while you're presenting. Ask for permission: “Sir, would you mind giving me five minutes without a call? I promise you it will be worth your while. Worst case, I waste five minutes. But I promise you, I'll never waste your time.” Maintain control. You've got one shot. Your presentation will be the one thing that determines the value of the product and how much money you get for it in the close. It also determines how easy that close is going to be for you, so always maintain control. Rule #2: Make sure your product is presentation-ready-in other words, perfect. At a basic level if you're using a product as a demo, does it work? Is the battery charged? Is it clean? Maybe you're selling an insurance policy. Do you have the terms neatly printed out in an attractive package so that you can review them with your buyer? Don't present products that aren't ready. There's nothing worse than turning the key to discover the car won't start. It's going to bring all your momentum to a halt. Rule #3: Always, always drive the demonstration before you allow the other person to drive, test, or use the product. Start by driving your demonstration. Get people comfortable with what your product does and what it can't do-and you want to control what they're looking at. Rule #4: Then turn control of the demonstration over after you have set the stage. In other words, set it up first, then give your buyer the opportunity to take control and experience it for themselves. But there's one thing you want to do before that. Rule #5: Make people comfortable before turning over controls. Make sure they understand how to work the product. Remember, you're trying to put the buyer at ease. Think about what it was like to use an iPhone for the first time. If you were used to a flip phone with all those buttons, it was a little confusing to have just this single, round button in the middle of the phone. Confusion does not put the buyer at ease, so make sure you establish a level of comfort. And keep the environment as consistent as possible. This is more for those of you taking someone on a test drive. A lot of variables can crop up, so use a pre-planned route. That way, you can focus on putting the buyer at ease and helping them assume ownership, rather than trying to navigate unfamiliar streets. Rule #6: Use assumptive statements. We'll talk about this more in just a few minutes. But for now, I want you to think about using language that establishes mental ownership. We call it assumptive language. For example: “What would you like to add to your new car?” or “If you want to turn the air conditioning down on your new car, you'll find the control right here.” We'll cover this in more detail because it's a powerful psychological tool for creating desire in your buyer. Rule #7: Reassure price concerns any time your buyer brings up price. If they crop up again in the middle of the demonstration. Don't ignore these questions such as: “But how much is it going to be?” or “What are my payments going to be?” or “What's the price on this model?” Reassure your buyer. You can say something as simple as, “Let me show you all the features and benefits of this new model, and then we can sit down to work out some figures that I think you'll find agreeable.” Rule #8: Superfreak your presentation. This is a signature concept of Grant's, and what it means is for you to commit to your presentation with the highest levels of enthusiasm and energy so that you make an unforgettable impression. If your buyer went to three different places, they'd remember you as the person who was so positive and so enthusiastic that you absolutely blew everyone else away. 10."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 3: Select Product and Present/Build Value",
    "subsection_topic": "Assumptives",
    "text": "Assumptives Now that you know the rules, I promised we'd talk a little more about assumptive statements. Assumptives are our way of maintaining an attitude and language of agreement and ownership. In other words, you're projecting into the future, getting people to mentally take ownership. When you're using this kind of language, your buyer will start thinking things like, “Hey, maybe this is my next car. Can I see myself pulling into the driveway in this? Will it fit in my garage?” The word “assume” means “to take as granted or true.” This is what you're doing by using assumptive language. You're counting the sale as true-as a done deal-and reinforcing that future by using language that helps your buyer project mentally where they want to go. “Will your new car fit in your garage?” or “Does your new phone fit in your pocket? Check it out.” See what I'm doing there? Those words project ownership. Here's another one: “Do you have your own covered parking space at the office where you'll park your new car?” Or: “The performance of your new laptop is the best in its class. That's important to you, right?” How about: “How often will you use your phone for work?” You could also say: “Will anyone else be involved in advising you in the purchase of your new...” See what am I doing? I'm finding out whether there's another decision-maker involved and instilling ownership. Get their senses involved: “Feel the fit and finish of your new...” Or: “See how easy it is to access all the controls of your new...” Maybe it feels hokey to you, but I can tell you that this kind of language-“your new vehicle,” “your new phone,” “your new house”- works. Mental ownership precedes every purchase no matter how small or how large. Whether you're buying a pack of gum or walking into a casino, you did it in your mind first. It has to happen in your mind, and it has to happen in the buyer's mind before it will ever happen in reality. Learn to assume the close and do it in Step 3. We're also going to do it when we cover trial closes. More about that in the next step of the Perfect Sales Process. 11."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 3: Select Product and Present/Build Value",
    "subsection_topic": "Objections to the Presentation",
    "text": "Objections to the Presentation As with every step in the Perfect Sales Process, you're going to get objections to your presentation. Let's take a few minutes and talk about how to handle them while keeping the sale moving forward. Let's say you're headed into your presentation to build value and as soon as you start, your customer shuts you down and says, “Look, I don't need to do this. I don't need to see how it operates. I don't need to try it on. I don't need to see it. I already saw it online. I buy one of these every two years, so I don't need to do this. I don't have time for this. I know all about it. I looked at it with your competition. All I need is a price. I don't have time.” If you've been doing this for any length of time, you've heard all this already. However, you need to know how to handle these objections. Otherwise, you're going to let this buyer make you shortcut your presentation and you're going to lose control of the sale. More importantly, you're not going to get the chance to build value. And if you don't build value, you're not going to close the deal. If the buyers don't know it will solve their problems and don't love it, they will not take action. It just won't happen. So first, understand that most of the things these people are telling you, these objections, they're just what? They're reactions. Don't treat them as valid objections. They're just talk. Handle them as such. Dissolve the conflict and agree with your buyer. She says: “I don't need to see how it works, [STUDENT NAME].” You say, “I understand. I didn't ask you to see how it works. I only asked you to allow me to show you the unseen benefits of your new investment.” See how I'm handling it? Maybe your buyer says: “I know all about it already.” You say, “I understand that and I appreciate that. What I'll show you is that there have been some recent changes you may not be familiar with. Watch this.” Agree with them and dissolve the conflict. With these objections, your buyer is trying to talk you out of your presentation. They're trying to talk you out of building value. Don't let it happen. Here's another response you could use: “Sir, I understand and would not allow you to even consider doing business with me if you aren't completely educated about what you're getting for your money. Look, it takes just five minutes, maybe even just four.” Here's a response for those time-sensitive buyers who say things like: “I don't have time to go through this.” Your response? “I know how valuable your time is and I promise not to waste it. Allow me the courtesy of five minutes. Follow me.” Or to take it to another level-the Super Freak level-with a buyer who says, “I don't need to do this,” you could say: “If you determine that what I'm about to show you is a waste of time, I'll buy you and your wife lunch. Is that agreeable?” The bottom line here is this: You have to be completely committed to the presentation, especially when you're handling objections around it. If you think the presentation is a waste of time or that the person in front of you isn't a buyer, you just won't pull this off. You have to be completely convinced that the presentation is of value to the client and it is of value to your profession. Insist on the presentation. Don't be talked out of it. Go all the way with it. You'll close more deals and you'll make more money. Period. 12."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 3: Select Product and Present/Build Value",
    "subsection_topic": "Mistakes in the Presentation",
    "text": "Mistakes in the Presentation Now, let's take a look at the common mistakes that salespeople make in Step 3 of the Perfect Sales Process. I'm sharing these with you so that you can catch yourself early if you are making these mistakes, stop what you're doing, course correct, and keep the sale moving forward. By the way, if you manage other salespeople, these mistakes are great to review regularly in your sales meetings. Now, bar none, the #1 mistake you can make around a presentation is to not do one at all. Do one with every customer, every time, no exception to the rule. Don't let yourself get talked out of one. Don't let yourself believe that you're not talking to a buyer, so it's not worth your time. Instead, you need to be so confident in your presentation that you know you can change someone's mind, which means all those excuses just go out the window. And how will you get there? Practice. You've got to know all the parts cold. You've got to know where you're starting and where you're ending, and then you do what we call “Superfreaking the presentation.” More on that in a moment. But first, let's talk about the rest of the mistakes. Mistake #2: You ask if they want to drive, use, or hold the product. Mistake. Remember who's selling who here. Don't ask. Control the sale. Mistake #3: You don't believe the buyer is going to buy today. Another mistake. In your mind, you have to know they're going to buy. You have to believe they're going to buy-even before they're going to believe it. Because, let's be honest, some buyers don't believe they're going to do it. You have to convince yourself of the sale. See the deal before the deal happens and believe it. Mistake #4: Here's another belief that will trip you up: You don't really believe that the presentation influences people. You don't think a killer presentation actually causes people to pay more. This is a mistake. Mistake #5: You take your product for granted because you're around it every day. Look, every day you spend time with your product. It's almost inevitable that you'd start to take even some of its most powerful advantages and benefits for granted. But this is a mistake. Don't forget what's great about your product-and what it can do for your buyer. Mistake #6: You start believing the buyer when they say, “Price is the only thing that matters.” That's a mistake. Price is never the reason anybody buys anything. It is never the reason. If your buyer doesn't love it and it doesn't solve his or her problems, the price can't get low enough. So while price may be important and while they may grind you on price-”how much, how much, how much”-you still have to build value in your presentation or you won't get any money from them in the close. Mistake #7: You use slang or technical words that your buyer doesn't understand. Every industry has verbiage, nomenclature, slang. When you use it with buyers, it turns people off. Avoid it. Mistake #8: You forget to tie advantages and benefits to the features. Remember, the feature is the 22-inch wheels. What are the advantages and what are the benefits? Mistake #9: You aren't enthusiastic. You just go through the motions. That's a waste of time. Anything you do, it's worth doing with enthusiasm. Halloween with your son or daughter, for example. You may not want to do it. But if you tell your partner you're going to do it, if you're showing up for your child, it's worth showing up with enthusiasm. The same is true of your 104,000th presentation. Mistake #10: You don't control the presentation. You let them control the presentation. If you can't control the presentation, I promise you, you will not control the sale, and you will not control the close. Mistake #11: You don't know “the why.” Do you remember “the why,” the one reason your buyer wants what you have, that dominant buying motive? Without this, you'll haphazardly and awkwardly wander through your presentation. Always enter the presentation knowing “the why” and the second “why.” The APES can make it easy for you, so learn that acronym inside and out. Mistake #12: You don't continue to use assumptives. Remember those assumptives- ”your new phone” and “your new car?” You need them to build mental ownership. Leaving them out is a mistake. Mistake #13: You demonstrate what the product is worth, when what you should be demonstrating is double that value. Here's what I mean by that. If I'm selling a $100,000 product, I want to do a $200,000 presentation. If I'm selling a $30 book, I want to do at least a $60 presentation and, even better, a $600 presentation. Why? Because nobody's going to give you $30 for a product if it's only worth $30. It's got to be worth more than that. In other words, your buyer will not give you money until the value of your product exceeds the value of his or her money. So those are the most common mistakes we see salespeople make in this area. Now, let's talk about a couple of final distinctions in this step. 13."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 3: Select Product and Present/Build Value",
    "subsection_topic": "Sell Yourself",
    "text": "Sell Yourself When we started out this morning, we talked about the Perfect Sales Process as a way of helping your buyers get to know, trust, and believe in three things: you, your company, and your proposal. So I want to remind you that when you're presenting the product, you're not just selling the product, you're also selling yourself and your company. Like the product, you have to take the time to share the features, advantages, and benefits of buying from you and your company. Here's why this is so important: Anything you're selling-a car, a phone, a trinket, a widget, a plumbing service, whatever it is-it can be shopped. You and your company cannot be shopped. The way I approach it is this: I'm an original. I don't come with every deal. If I sell suits, you can go buy this same brand of suit down the street. However, I don't come with it. So I have to sell myself, my company, and the service of the company while I'm selling the fabric and the fit of the suit. When someone buys a product, they're also buying a company. Most salespeople never touch this. So as you're doing your presentation, don't forget to include everything else that comes along with the purchase: you, the support staff, the online support, the location, anything that you do to support your client. Because let's face it: Your product can be bought anywhere. So what are the advantages and benefits of doing business with you? These have to be intertwined with your product presentation. Let's say a customer says to you: “I can buy it cheaper down the street with so-and-so.” You know what I'd say? “You know what, I hear you. And let's assume that you can, but know that you don't get me anywhere else. I don't come with the deal down the street, which means you don't get the 24/7 access to me when you need something. You've met them. You've met me, and you wouldn't be sitting with me if you were completely confident in them. You know there's a difference just from meeting us both.” Don't forget to sell yourself. Don't forget to sell your company. And get strong about it. Remember earlier today when we did an exercise and you sold yourself on you, your product and your company? Learn that list. Weave it into your presentation, and you'll sell so much more than just trinkets, widgets, and contracts. Last, I want to give you one final piece to think about. 14."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 3: Select Product and Present/Build Value",
    "subsection_topic": "Superfreak the Presentation",
    "text": "Superfreak the Presentation Answer this question for me: Freak or Super Freak? In Grant's opinion, and mine, there's only one answer: Superfreak. Freaks are a dime a dozen. Super Freaks sign big contracts. You want to be a Super Freak. So when it comes to your presentation, I want you to superfreak it. Go all out. Give it every ounce of enthusiasm you have. Go from being interested to being interesting. Most presentations put you to sleep. Do what you need to do to get people's attention and build the most compelling and interesting presentation they've ever seen. Use descriptive language that sticks with them. I once had a guy sell me a banner for a trade show and he told me it was made out of the same stuff that they use to make bulletproof panels. Do you think I remembered that? Absolutely. And was I willing to invest in it because I believed it would last? Absolutely. So when it comes to your presentations, always Superfreak them. Sell your product, sell your company, and sell yourself with more enthusiasm and energy than anyone else so that you build high value and differentiate yourself from everyone else in the marketplace. Now, we're going to take a quick break, then move into Step 4 of the Perfect Sales Process. Part 6: Steps of The Sales Process - Step 4: Make Proposal 1."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 4: Make Proposal",
    "subsection_topic": "What Is a Trial Close?",
    "text": "What Is a Trial Close? Welcome back! In this section, we're going to cover the next step of the Perfect Sales Process, Step 4: Make Proposal. First, we're going to start with a rule: Always, always make a proposal- with figures-to every person you greet. After all, if you don't present to our buyer, you can never come to an agreement with them. And ideally, you want to deliver your proposal within 40 minutes of making contact, although that number will vary a little, depending on your industry. Now if you're feeling at all skeptical of making a proposal to everyone you greet, I want you to know that this is something that Cardone Enterprises has tested and proven. In fact, we recently worked with a retail group in Boston and focused them on one main objective: presenting more proposals with figures. This alone resulted in $350,000 in gross profits in one month. That's six figures of proof right there. Now before we get into the actual write-up of your proposal, I want to introduce you to a technique that you'll use before you actually sit down and present figures. It's called the “trial close.” The trial close is a kind of test. Trial closing questions can help you test the client's level of ownership over the product you're showing them. They're designed to give you a sense of what they're thinking and feeling about your product or service, and how to adjust your proposal so you can actually make the sale. They're basically a way of taking your buyer's temperature. And here's the best part: Not only are trial closes valuable, but they're also low risk. Now, these can technically be done anywhere within the Perfect Sales Process, but they're most powerful here, before you do the actual proposal. Now to be clear, you're not asking for a decision with a trial close. That's what you're doing in the close. Instead, in the trial close, you're asking for an opinion. For example, your trial close could be, “Sir, on a scale from 1 to 10, how would you rate your new vehicle?” See, you're asking for an opinion, not a decision. The close would be, “If there are no other questions, I just need your name here and here.” Now here's the best part: When you use a trial close, you'll often get new information. When I ask things like, “On a scale from 1 to 10...” I'm going to get new data from the customer. Your goal with that information is to understand two things: 1) Do I have this buyer on the right product, and 2) Does the customer now own it mentally? Those are the ultimate goals of the trial close. Now, let's talk about a couple of different options you can use for your trial close: “It looks like you really like this model. Is that true?” “If you took it home, would you be proud to own this?” “Do you prefer the larger or smaller version?” “How would it look at your home?” “Where would you take your first trip in your new RV?” What do you notice about each of these? They put ownership in the customer's mind, right? But it's still different than, “If I could get the figures agreeable, would you take delivery right now?” Instead, trial close questions allow us to check out where the buyer is. It's like cooking a dish using a recipe. Is the oven hot enough? Is the water boiling yet? Does our buyer have mental ownership? At the end of the day, the trial close is both your lowest risk and your best friend. Let's talk more about why this is true. 2."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 4: Make Proposal",
    "subsection_topic": "Establishing Mental Ownership",
    "text": "Establishing Mental Ownership Now that you're starting to embrace the idea of the trial close, I want to talk about using trial close questions earlier in the Perfect Sales Process. I'm sure you've heard that phrase “always be closing” or “ABC.” Here's what that phrase means to me: You can drop in trial closes earlier in the process, such as during Step 2: Determine Wants and Needs. Think about some of the language we talked about earlier: “So what do you want your new investment to do that your present one doesn't do? Does this accomplish that? What do you want your new phone/your new house/your investment/the addition that you want us to build to do that your present one doesn't accomplish?” Do you see how these are also trial close questions? A few more for you to consider: “Who will be the primary user or beneficiary? Who will be the greatest beneficiary of this new decision? Who will be the secondary user of your new purchase? Who will be the secondary beneficiary? Who else is going to benefit? Who else will benefit from the selection you make today? What other benefits would you like to achieve in picking out this product, making this decision, or starting with this project?” These are all really trial closes that start to give your buyer mental ownership, take their temperature, and give you more information for your presentation. As you get more comfortable with trial closes, from time to time, drop in some of these questions along the way: “Let me ask you, assuming we could work something like this out, whose name would go on the title?” “What do you like the most about what I've shown you thus far?” “What's the greatest benefit you've seen so far?” Now at this point, I usually get some objections from students in the room: “Whoa, [FACILITATOR NAME]. I'm not ready to go that fast or put that much pressure on the buyer. It's way too soon.” Look, here's what I don't want you to do: Don't go on with your 35-minute presentation because you think you've got to do a 35-minute presentation. Remember, trial closes are low risk. You can ask one of these after 12 minutes. You can even ask one every six to eight minutes. I'm talking about just simple things like, “What do you like so far? Do you have enough information to make a decision yet? What other information would you want?” Or: “Is there anything you'd want me to add or change based on what I've shown you thus far? Is there anything you don't see yourself using that I've shown you? Is there anything here that you wouldn't use, that you'd want to delete, or that you don't see value in?” Trial closes. “Well, where would you use a product like this first? Who would you show it to first? What are the first benefits that you would expect from owning this? Let's put it aside here where no one else can claim it while I show you how easy it is to do business here.” That's language to use when you're getting towards the end of the presentation, and what does it do? That's right: It starts to give your buyer mental ownership. “John, whose name would you want to title this in? Your name? Your spouse's name? Or both? Did you want to register this in your name or the company's name?” These are all trial closes. “Who would your insurance coverage be with?” Why would I ask that, even when the buyer and I haven't even worked out a deal yet? Here's why: Because all your buyer has to do is answer the name of the insurance company, and it keeps the sale moving forward. We're going to do an exercise here in just a moment to develop a few trial closes of your own. But before we do that, I want to address the other big objection we get: “I sell to high-end clients and this trial close thing won't work.” We actually had a customer say that to us. So what did we do? Cardone Enterprises went out there for a day and worked with him, using trial closes with every one of his customers. This was a $240,000 average ticket product, so we'd say something like this to his customers: “Let me ask you, for $240,000, would there be any changes or additions you'd want to make to this?” Now sure, we heard things like, \"No, but I'm not buying today, though.\" So what did we say in response? “I understand you're not buying today. Let me put it aside here while we go work up numbers, okay? So that when we do come to a decision, nobody else will grab it up, okay?” And he'd say something like, \"Yeah, yeah, sure. Let's go sit down.\" Did it work? Sure. It moved us forward. And we closed a lot of those deals. So keep this in mind: It has nothing to do with the product you're selling or the price you're selling. Trial closes give your buyers mental ownership and they keep moving the sale forward. Learn them and use them. 3."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 4: Make Proposal",
    "subsection_topic": "Objections to Trial Closes",
    "text": "Objections to Trial Closes Now, I hinted at this next topic already: objections to trial closes. What did the buyer say in my example? “But I'm not buying today.” That's an objection, right? Here's the deal: Once you start using all these trial closes, you're going to have people shutting you down. I promise you: This is going to happen. You'll hear things like: “Hey, I'm not buying today! What are you talking about? I didn't say I was doing something today! Why do you keep assuming that I'm going to buy? I don't think I can even afford anything.” “Slow down! This is the first place we've been to! We never buy at the first place.” Does this sound familiar? “Give me a copy of what I'm looking at and I'll think about it. I never make a rash decision.” Now, here's what I want you to understand when you hear those things: That doesn't mean your trial close didn't work. It's actually moving you forward. Why? Because it's still giving your buyers images of mental ownership. And here's what's so important about that: Once someone takes mental ownership, money is never the reason people don't buy. Once they own it up here [FACILITATOR: Tap head], they actually start trying to work out the numbers: “Am I going to be able to afford this? How am I going to make this happen?” It doesn't mean they're not going to keep saying things and say, “Hey, hey, slow down!” And, yes, I've really heard that one. Your job is to know that you're still moving forward toward mental ownership. And as a side note, if you really want to master scenarios like this, come spend a few days at one of our Cardone Enterprises events. We spend days role-playing situations like this, so you can handle objections like this easily. I'll be honest, none of these objections would throw me off, because I've trained on them until I'm fluid, not mechanical. In fact, here's how I would handle something like this: I might say, “Hey, come on inside to my office. By the way, who's your insurance going to be on your new purchase?” And maybe my buyer says: “Hey, hey, hey, [FACILITATOR NAME], slow down. Why are you talking about my insurance? I didn't say I was buying this.” And I'd just say: “Hey, I know you're not. I'm with you. I'm just wondering who you're going to insure it with when you do make a decision.” “Oh, well, I'm going to go with State Farm (or any other insurance company.)” “Excellent! Follow me.” See? It's happening and it's working. Don't give up on your trial closes. They're moving you closer to ownership with each one. Now that your trial close has 1) shown you that you have your buyer on the right product and 2) he or she is taking mental ownership, you can move into the next part of this step: the actual proposal. 4."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 4: Make Proposal",
    "subsection_topic": "You Need to Make Proposals to Everyone",
    "text": "You Need to Make Proposals to Everyone Now we're moving into what Grant likes to call the “mack daddy” section of the Perfect Sales Process: the actual proposal, also called the write- up. No matter what you call it, I think you'll agree with him that the proposal is critical because the only way to sell someone is to make them a proposal. First, let's get specific with what we mean by “proposal” or “write-up” because a lot of people think of it differently. This is where you come up with a proposal-the price and the terms-in an effort to get an agreement. It doesn't mean a close. It doesn't mean you've sold anything. In this step, you create a proposal that you share with your buyer. Now I hinted at this before, but I want to emphasize this again: When it comes to making proposals, you likely already do them, but you probably don't do them enough. At the Cardone Enterprises, we make proposals to everyone we greet. That's what we do. Why? Because we're not interested in a high closing ratio. We're interested in taking buyers all the way. The average company delivers proposals to fewer than 40% of the opportunities that walk through their door. That limits you. If you don't write somebody up, make a proposal, enter negotiations, and show them what you can do, you can't close anyone. For whatever reason, these companies are deciding somehow that 60% of the people that come to them are either not ready, can't buy, can't be sold, or are not qualified. So why do we present proposals to 100% of our opportunities at the Cardone Enterprises? Because you have nothing to lose. And I'll tell you what: The buyer might change their mind when you're writing them up. I've had people sit down after telling me 17 times, “I will not buy, no matter what.” Now when I initially present my numbers, they might say, “Too high, this doesn't work.” But 15 minutes later I'll hear, “I can't believe I'm doing this. I really didn't think I was going to buy today.” And how did I get there? Because I made a proposal-with figures. If you don't write someone up, you can't close them. Fact. Are you worried you're going to lose control of the selling process? Control of the selling process comes from being prepared and taking each of the steps in the Perfect Sales Process. You don't lose it because you presented somebody with numbers. If you're still skeptical, let me ask you this: When you get to the last three days of the quarter and you're under, who do you write up? Everyone, right? You throw out all the rules and you write everyone up. And what happens? You make your numbers. Here's what I want you to come away with after this section: The more people you present with a proposal, the more people will buy because you have to make a proposal in order to get a close. If you want to hit the ball, you've got to swing the bat. In this section, I'm going to show you how to do it better than you've ever done it before. 5."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 4: Make Proposal",
    "subsection_topic": "Excuses for Not Making Proposals",
    "text": "Excuses for Not Making Proposals Now, I mentioned before that the average company doesn't make proposals to 60% of the people who walk through the door. There are a few reasons why, and every one of them is an excuse. Let's go through a few of them, so you can recognize them as they pop up: 1. The buyer won't commit. They're “just looking,” so why write them up? This is the biggest one. 2. The buyer owes too much or is unable to somehow handle some part of the financing or situation involved. 3. The buyer doesn't have the money to pay for the product. 4. The buyer won't pay enough. They're going to offer too little money. 5. The decision maker isn't there. The Vice President didn't bring the CEO. The wife didn't bring the husband. 6. The buyer does not have enough time today, but they'll come back when they do. You're deluding yourself if you believe this one, by the way. If they're in a hurry today, I promise you, they're going to be in a hurry on Saturday. 7. The buyer doesn't have all the elements involved in this transaction that you need to look at. For example, they want to buy a car and they didn't bring their trade-in. You can make all the excuses you want to make. I'm still going to make a proposal to everyone. Look, if I write up 100 people and you write up ten, who's going to sell more, just from a pure numbers standpoint? I'd put my money on me. Here's the mindset I want you to embrace: Be completely unreasonable and provide proposals to everyone. No exceptions-even when they say, “Hey, we're going to three other places when we leave here.” When I hear that, do you know what I think? I think: “I'm making you a proposal right now. Because I'd rather write you up now than write you up after you go to three more places, when there's no meat left on the bone.” Change the way you think about proposals. Get rid of your excuses and present them to who? Everyone. 6."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 4: Make Proposal",
    "subsection_topic": "How to Increase Your Proposals",
    "text": "How to Increase Your Proposals Now just because you've decided to make a proposal to everyone, it doesn't mean you're always going to get them to keep moving through the Perfect Sales Process with you. So, let's talk about the ways you can increase your proposals and keep the sale moving forward. First, a quick review of the elements that will set you up to get here: 1. A great attitude, one that lowers your buyer's guard and puts them at ease. 2. The selection alternative, so you get your buyer on the right product. “Hey, would you consider going down a model?” and “Would you consider going up a model?” Remember that one? 3. Meeting their objections and addressing their fears. We're going to talk about that in a minute. If you can't meet their objections-and you will get objections-you're not going to get to the proposal. 4. Understanding the risks and accepting them. Be willing to waste time with people who won't buy. That will happen. Know the risks and accept them. Why? Because more proposals mean more sales, which means more money. 5. Finally, reducing your chance of getting a “no.” That's all about the language you use. You don't want to say something like: “Hey, you want to buy this right now?” That's probably going to get you a “no.” Instead, you're going to use language that assumes ownership and makes it easy to move to the next step: “Come on inside and let me get you some numbers.” Remember, you're not asking people to do something, you're asking them to move forward. You're asking people to come inside. “Let me show what we can do for you.” To make this happen, it takes a mindset shift on your part: You have to be willing to swing the bat and look bad. Closing ratios don't matter. You know what does? Making ten times more money. Which do you want? The money or the closing ratio? So increase your proposals. Get rid of the excuses. Drop the reasons for not bringing people in. And make a complete commitment to delivering proposals to absolutely everyone. 7."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 4: Make Proposal",
    "subsection_topic": "Language for Increasing Proposals",
    "text": "Language for Increasing Proposals Now, let's talk through some specific language that will help you increase your ability to present proposals even more. You can use these exactly as they are or you can adjust them to fit the products you're selling and the buyers you're working with. But don't change them too much. This is language that we've tested at Cardone Enterprises, so we know it works. 1. “When would you want to take ownership of your new ________? I'm confident we can come to an agreement on the figures. Let's go work it out.” What's happening there? I'm assuming the proposal. 2. “Would there be any changes or additions you'd want me to make to your new ________ before we come to an agreement on the figures?” Get the answer, and then say, “Excellent, follow me.” 3. “Follow me. Allow me to provide you with figures that will make it easy for you to say yes to your new ________. Is that fair enough? Great. Come this way.” What similarities are you seeing among these three examples I've shared so far? In every one of them, what am I saying so far? “Yours,” “follow me.” In other words, let's roll. 4. “Before we work on figures that you feel are fair, tell me, what do you like least about your new ________?” Why would I ask that question? I want to find out what they don't like. Once they tell me, I use that information. “That wouldn't keep you from owning it, would it?” You get your “no,” then you'd say, “Great, follow me.” 5. “What do you think the other drivers, your spouse, friends, parents, fellow employees, will think about your new ________?” Notice that I'm trying to get mental ownership right here. Now, you may be wondering at this point: Aren't these like trial closes? Absolutely they are. Trial closes are your bridge. They segue you into the proposal. If you have a time-sensitive shopper-they're great, by the way, because they can make decisions fast-try this one: 6. “I understand you're in a hurry today. Let's go to work on figures agreeable to you, so you can avoid wasting any more of your valuable time doing this. Follow me.” With highly time-sensitive shoppers, sometimes you'll get some pushback. They might respond with something like, “[FACILITATOR NAME], I've already been here 40 minutes.” Keep that positive attitude and reply, “I understand, but if you leave without information, you will have wasted those 40 minutes. Give me five minutes. I'm going to show you everything, and I'll leave it up to you.” That's a simple way to handle time. So here's what you need to do with these. You need to learn these cold. You need these ready to go, so you can be fluid with them and you can whip them out in a heartbeat with a smile. 8."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 4: Make Proposal",
    "subsection_topic": "Objections to Proposals",
    "text": "Objections to Proposals You're going to get objections to the proposal. They're going to happen, so you want to be prepared for them. We'll walk through a couple of common objections and I'm going to give you some ways to answer them. Like the language we went through earlier, you need to learn these cold too, so you're ready to deliver them easily without missing a beat-and keep the sale moving forward. Scenario #1: The buyer who says they need their spouse involved: “I need to talk to my wife” or “I need to ask my husband.” Your response: “I appreciate the fact, sir, you want your wife involved” or “Ma'am, I appreciate the fact you want your husband involved in the decision. Follow me so that we'll be able to provide your partner with the information necessary to arrive at an intelligent decision. Follow me.” Or even more simply: “I appreciate that, ma'am, and I would want that as well. I'd want that person involved. Follow me.” Scenario #2: The buyer who says “I'm not buying today.” Your response: “I understand you said earlier you're not buying today. I'd like you to allow me the courtesy to share with you what we would be willing to do if you were going to make a decision today. By the way, we'll certainly understand if you change your mind and take advantage of the big sale. Follow me.” Here's another one. “I understand you didn't expect to buy today and I wouldn't expect you to, unless the figures worked out to your favor. Let me show you how easy it is for us to do business together. Follow me.” What do you think? Can you see yourself using that one? [FACILITATOR: Get assent before moving on.] Here's another one for “I'm not buying today.” You say: “Sir, that would be my fault, not yours. I take full, complete, 100% responsibility for your decision. Follow me.” Scenario #3: The buyer who's missing something. You might hear something like, “I can't buy today. I didn't bring my trade-in.” There are a few scenarios in which your buyer will object because he or she doesn't have something. This could also work if your buyer says something like “I haven't done enough shopping yet.” You could say: “I appreciate that you haven't done enough shopping yet,” or “that you haven't brought your trade-in with you,” or whatever the excuse. “Let me suggest that we show you what we could do for you and I'll leave the final decision up to you. Come on inside and let's work it out.” Or: “Sir, you don't need your trade-in right now. Truth is, what you need is enough information to find out whether you want to bring your vehicle back in here and have us look at it. Follow me.” Scenario #4: The buyer who wants to cut through what they perceive as just talk: “I just want your bottom line. I don't want to go inside. I don't want to do anything else.” You could say: “Sir, there's nothing to go through. We're not going to have to jump over anything, and this isn't difficult. Let's get you some figures that you can agree to. I'll make it easy for you. Follow me.” Scenario #5: The buyer who wants to put on the brakes. “We're going too fast here, I feel like we're going too fast. Honey, we're going too fast. Oh my gosh, we're going too fast.” You say: “Sir, I didn't ask you to make a decision. All I asked you to do is come inside with me. Let me give you some figures, so you know what it's going to cost to own your new ________. Follow me.” Scenario #6: The person who needs to talk to his or her bank. “I've got to go to my credit union first.” Easy answer: “What do you say we give you enough information so that you have something to give your credit union? Because right now, if you go to the credit union, they're going to ask a lot of questions that you don't have the answers to, yet. Come on inside, and let me write it up, okay?” These are some of the most common objections you're going to hear and you need to be ready to handle them all. You've got to get these answers down pat, rote, automatic, no ad-libbing. At the end of the day, there are a lot of variables, a lot of changes going on in selling, a lot of different personalities, and a lot of different customers. The more consistency that you can have with your own presentation, the more consistent the process is going to be, and the more consistent your results. Part 7: Steps of The Sales Process - Step 5: Close 1."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 5: Close",
    "subsection_topic": "The Art of Closing",
    "text": "The Art of Closing We've arrived at the final step of the Perfect Sales Process: Step 5: Close or Exit. When you get to this step, you've got to be prepared to close. As I mentioned when we started the day, we at Cardone Enterprises believe that the art of closing is a completely different one than the art of selling. So that being said, if you really want to learn to become a pro-ninja- master closer who can easily handle any situation that a buyer throws at you, you need to devote yourself to the art of closing. Spend an entire day learning, practicing, and role-playing in the course we call Closing the Deal. Or, join us for a half-day session to study advanced strategies in closing, negotiations, and objections. Believe me, it's going to be more than worth your time. And here's why: In our experience, most salespeople, even seasoned ones who have been around a long time, struggle with controlling the sale through the negotiation and the close. In a way, it's not surprising because many have simply never invested real time, energy, and effort into learning the exact skills required. Learn to become a master of the close-not someone who dabbles or who treats sales like a hobby-but someone who maintains complete control of their environment all the way through the end of the sale. And frankly, why wouldn't anyone want this? Why even bother selling if you can't close? That's where 100% of your money is coming from. If this is you and you want to master the close, there are only two ways to learn: The first is from experience. This is the most costly way to go about it. Maybe you spend 13 years in sales and collect 13 years of losses, failures, and successes. Typically in sales, your failures stack up faster than your successes, and then you start coming up with your own ideas about what caused those failures. That's option #1: learning from experience. There's another way to learn: Instead of waiting for experience to teach you, you can create an experience and learn from that. I'm talking about anticipating scenarios, preparing scripts, and drilling responses- rehearsing experiences and situations. That's what we did today and you can expect more of if you decide to train in the art of closing. Keep partnering up, role-playing, and learning from those experiences you've created, rather than waiting for them to happen to you. Which one is faster, do you think? The second option, right? Creating experiences. Which one costs you more-not in the short term, but in the long term? The first option. Learning from experiences that happen to you. So, to sum it up: You can wait ten, 15, or 20 years for your personal experience to enlighten you or you can get enlightened now. Yes, it still takes some time. It takes discipline. It takes initiative, but it will go much faster if you can find a partner-or couple of partners-as committed as you are, so you can train together. Today, I'm going to get you started down that path, but I want you to recognize that this only is a start. The art of closing is one that's worth mastering. If that's something you want for yourself, just grab me at the end and we can talk more about it. Right now, though, we're going to talk about one of the most important distinctions I want you to make in this step: why you need an arsenal of closes. 2."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 5: Close",
    "subsection_topic": "Why You Need an Arsenal of Closes",
    "text": "Why You Need an Arsenal of Closes A great closer, a pro-ninja-master closer, has hundreds of closes at his or her disposal- as well as a complete commitment to creating fresh and innovative ways to handle any closing situation that arises. For example, if you take a look at Grant's book, The Closer's Survival Guide, you'll see that it contains over 120 closes. That's a good start. If you take our full-day Closing the Deal training, you'll get more than 200. Now, why do you need an arsenal? Because you need to have a close available for every scenario, so you know exactly what to say and when. In fact, do you know why most people fail during the close? Because they only have three, four, or five closes. That's just not enough variety to handle all the various types of customers you'll encounter, as well as the different objections they'll throw at you. I've heard it said that most prospects close after five attempts. In today's economy, I don't know if that's still true, but I do know this: A lot of salespeople don't even have five fluid closes at their disposal. That's why you want hundreds. That's what a master has, and they've practiced all of them enough so that they're fluid, natural, and easy to pull out at any time. You also have to commit yourself to fresh approaches. Have you ever heard a salesperson say: “What do I have to do? What would it take? I want to earn your business.” That's not going to get you anywhere and I'm not sure it even counts as a close. “How much time do you need to think about it?” Or “Make me an offer. If I could get that done, would you do it?” Do you think any of those are effective? Maybe 50 years ago. But as we've discussed, selling has changed. Our closes need to change, too. Now as you're getting ready to master the art of closing, you need to start by understanding all the possibilities you'll encounter in the close. If you don't know the possibilities, you'll never come up with enough closes. After all, if you don't know how bad the hurricane can be, how can you prepare for it? What you'll want to do is write down every situation that you have ever experienced: “The payment is too high. The price is too high. I've got to think about it. I've got to talk to the board. I have to wait for my tax refund. I've got to look around more. I need management to approve it. I can get a better deal down the street. I need to come back another time. I want to wait for the economy to get better.” As you write down all the things you hear during the close, here's what you're going to discover: There are a finite number of situations. This is good news, right? Because once you know every one of them, you can create a close that will handle them. This is something you'll want to work on in the next couple of days as you start to put into action the things you've learned today. But right now, I'm going to run through a few examples here to get you started. • “I need to talk to my wife.” By the way, you probably hear this a lot, so you're going to need a couple of closes to handle this one. Cardone Enterprises Close: “I agree, and you should, but if your wife is anything like mine, she never tells me ‘no' when I love something, and I never tell her ‘no.' I need your approval here, here and here.” • “The price is too high.” Cardone Enterprises Close: “I agree it's a lot of money, and I expect that you knew that before you got here. I need your OK here and here.” • “I need to think about it.” Cardone Enterprises Close: “I understand. However, you thinking about it will not change the fact that this product saves you money, your company needs it, and you are going to do it sooner or later. Let's get it done, so you can think about the other things that need attention. I need your approval here and here.” Now once you have your lists of closes, what's your job? Drill them. Practice them, rehearse them, and enjoy them. And commit to mastering the art of the close. You showed up today, so I know you see the value in training like a pro. Apply that same mindset to the close, and you'll close more deals and make more money, guaranteed. 3."
  },
  {
    "doc_title": "The_Sales_Process",
    "section_topic": "Steps of The Sales Process - Step 5: Close",
    "subsection_topic": "The Secret to Success in Sales",
    "text": "The Secret to Success in Sales Now that we've explored all five steps of the Perfect Sales Process, we're going to start to wrap up today's training. But before we do that, I want to leave you with a final thought: Treat your success as your duty, obligation, and responsibility-not just as a job or even as a simple choice. Ask just about anyone whether they want to be successful, and they'll probably tell you “yes.” But most people only approach it as an option or a “maybe.” If that's your approach, it almost always ensures that success will never be yours. Fewer than 2% of all households in America made more than $250,000 last year. Any guesses as to why that is? Is the whole system set up against 98% of the population? Or maybe a good number of those people are treating success as something that may or may not happen. The reality is that top salespeople and top earners are not smarter than you. And they probably don't work harder. The difference is that they commit to success, just like I asked you to commit to the Perfect Sales Process when we started this training today. Instead, they leave their success to chance, to the economy, to timing, or to any other happenstance that they have no control over. Whatever you want, you have to go at it with a relentless, undying, gotta-have-it kind of spirit. And the people in your life have to be on board. If you have a family, they need to be in agreement with your plan for the creation of success. Quit approaching success as an option, and your chances of reaching your dreams will rise exponentially. I can assure you that if you don't consider it your duty to live up to your potential, then you simply won't live up to it. If success doesn't become an obsession and a must, then you won't do what is necessary to attain it. Know this: Your journey will be filled with many unexpected obstacles. Those obstacles- and even other people-will attempt to stop you from reaching your destination. If you're committed to success as a destination, you'll simply last longer than everyone else, especially those who rely on luck. Luck is just one of the byproducts of those who take the most action and are the most prepared. The reason that successful salespeople seem lucky is because their success naturally allows for more success. Unless you are privy to the action, you don't see or hear about the number of times the top salespeople went for it and failed. Luck will not make you successful. Instead, committing yourself to success completely is the way to be lucky. You have to approach your sales success the way good parents approach their duty to their children: as an honor, an obligation, and a priority. Be committed to your career, your product, the company you work for, and to your client as a duty, obligation, and responsibility. That's why we started the day by making that most important sale to yourself. A good parent will do whatever it takes to care for his or her children: get up in the middle of the night, clothe, feed, and fight for them, take care of them, and even put their lives at risk to protect them. This is the same way you must approach your sales career. Now as you single mindedly pursue success, you will have setbacks. They're inevitable, especially when you're trying to master a new skill. If you truly want to get over these obstacles and emerge stronger on the other side, always be honest with yourself. Never justify failure. I see this a lot with people who are starting out in sales. When you aren't honest with yourself, you're basically giving up. Clearly, you aren't always going to make the sale. It's just the way sales works. What I don't want to see is one of you failing to make a sale, then spending the rest of the afternoon selling yourself lies and excuses about why it wasn't important or why you weren't successful. After every sales cycle, take a moment to be brutally honest with yourself. Ask yourself why you didn't get that sale. Ask what you could have done differently. Ask yourself things like: Where did I miss it? How could I have better justified the cost? Where could I have gotten them financing? Why didn't I get in front of the decision maker? I only asked for the order twice. Should I have asked again? Be 100% honest, and take complete responsibility for the outcome. Don't let your coworkers console you telling you that it's all right, the customer wasn't ready, they didn't have the money, they're cheap, they're a difficult group to sell, they never buy, they can't make decisions, our product price is too high, we don't have the right inventory, the economy sucks. Don't do it. Your sales success will come about as the result of your mental, spiritual, and technically prepared claim to create and own that success, followed by taking necessary actions that persist over time until you succeed in reaching your sales goals. If you are not able to be brutally honest with yourself about why you didn't make the sale, you will forever find your results dwindling. And when your success dwindles, you will see your actions start to do the same. In order to demand consistent sales success, you have to take full responsibility for every sale. Make success your duty, obligation, and responsibility. Take massive amounts of action followed by more action until the sale is made. Accept no excuses, reasons, or logic, and figure out how to make it work! That means preparing yourself daily to handle all the obstacles, stalls, reasons, and barriers you will encounter with a client."
  }
]