[
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "Attitude",
    "subsection_topic": "A Great Attitude is Worth More than a Great Product",
    "text": "Who doesn’t want to feel good? Show me a person that doesn’t want to feel good and I’ll show you someone that you don’t want to bother selling! People want to feel good. People are moved by positive and confident people, more than by great products. There will always be a market for products that make people feel good, but a person who can make someone feel good can sell almost anything! The individual who combines a great attitude with a great product becomes unstoppable! The department, the division, and the company that can do the same—mix great people, great attitudes, and great products—are unstoppable. A positive attitude is a thousand times more important than the product you’re selling. I bet you know people like this: They'll spend a small amount of their income on the necessities and then blow their entire paycheck on entertainment. Season tickets to the Patriots. Trips to Mexico. A flat-screen TV with surround sound. Why? Because they want to feel good. It’s easy for buyers—your prospects—to say no to your product or no to the company, but it’s very difficult for them to say no to a positive experience with another human being. When something makes you feel good, you want more of it, whether it makes logical sense or not. It’s amazing how many salespeople are not clued in on this principle. The world is focused on chaos and bad news. 24/7, the media pounds negativity into the minds of anyone who will listen. Do you know how refreshing it is to finally meet someone who’s got a positive attitude, who’s uplifting and solution-oriented? At Cardone Enterprises, we have an assistant named Jen. When Grant first hired her, she had no experience with our business and had never worked in our industry. Grant didn’t hire Jen because of her abilities and experience, but because of her positive attitude. Jen is an upbeat “can-do,” get-it-done-with-a-smile-on-her-face kind of a person. That doesn’t mean she doesn’t make mistakes; she does. But because of her attitude, the mistakes are acceptable. When someone is so service-oriented, so positive, it’s impossible to imagine getting mad at her or ever letting her go. Is Jen selling? Absolutely! Every day, whether she knows it or not. When you are positive, people will find you irresistible. But this is something you have to work on because the world is filled with negativity. You’re pounded constantly, so this is another discipline we’re going to talk about creating next."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "Attitude",
    "subsection_topic": "Treat Them Like Millionaires",
    "text": "Treat Them Like Millionaires Here's the deal. You want to be a millionaire? Treat everyone you meet like a millionaire. This is such an important point because it doesn't have anything to do with your product or your company. It's all about your attitude. People with money or people without money, treat them all like millionaires. People you think who will buy or think they won't buy, treat them like millionaires. The decision-makers or not the decision- makers, treat them like millionaires. Fifteen-year-olds or 50-year-olds, treat them like millionaires. Let's say you have a customer. Right now, he's broke, out of work, cannot get financing. How should you treat him? Treat him like a millionaire! Here's why: One day he's going to get back on his feet. And who do you think he's going to come to when he's in a position to buy? Yes, to the person who treated him with worth and respect, even when he didn't have a penny to his name. Now would this work in furniture? Would this work in electronics? Would this work on everything and anything that's ever sold? Sure, it would. Remember a price can be beaten, but a great attitude is priceless. How you act toward others will be how they'll act toward you. Your attitude precedes everything that happens to you in life. 3."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "Attitude",
    "subsection_topic": "Daily Attitude",
    "text": "Daily Attitude We talked earlier about how a great attitude is the key to your ability to sell, and your ability to have unlimited success. In this section, I want to dive into some specifics about what that great attitude looks like on a daily basis. Let's say you have a favorite restaurant and when you go, you valet park the car there, and this bleached-blond, spiky-haired guy always greets you, opens the car door, and smiles like he's glad to see you. “Good to see you again, boss,” he says. “Leave it with me. I'll see you in a couple of hours and your car will be right up front.” He gets a $20 tip from you every time, even though you know you could have parked the car yourself. Meanwhile, the other valet guy who works there greets you like you're a nuisance. Due to his poor attitude, you give him $5, and that's only because he actually did park your car. I'm sure he goes home and tells his girlfriend how cheap all the people who valet park their big cars are, and he's bitter and resentful that his spiky-haired partner just seems to be luckier than he is and gets the big tippers. But you and I-we know the truth! It's the attitude that makes the difference. As this example illustrates, your product can be replaced. But a great attitude cannot be replaced! A great attitude, great service, a great company... smiling, beaming, happy people cannot be replaced. Impossible. A price can be beaten; a great attitude is priceless. Imagine... what if your whole team was happy? What if everybody in your organization was happy and positive? Right now, you're probably thinking about specific people on your team or in your organization. “Joe in service... Oh, he's negative. Marie in purchasing... she's negative. That person over there...” If you're creating a list of negative people, you've got to fix YOUR attitude. Even when you have very negative people around you, if you continue to persist and be positive, you can expect sooner or later positive will win over. Think about it this way: If I scream and threaten another person, they're either going to flee (blow out of here because they're scared of me) or they're going to fight me. Neither response in a selling situation would be positive. But if I'm positive, if I'm agreeable, if I'm using phrases like, “No problem, I'll do that. I'd be happy to...”, then I can expect sooner or later some of that negativity will start to melt away because it's contagious–just like the flu. Right? Just like measles or chicken pox, any disease that is contagious can be caught by others, and so the same is true with positivity. This ability starts with you. It requires first a mental discipline, a muscle. Most of us have these internal narratives. And you're like, “I can't do that. We can't do that. That can't be done. That can't happen. I hate myself. I'm going to quit.” You've got to build and exercise that positivity muscle. You can't just walk around, “Attitude is everything. Attitude is important. Okay, I'm going to have a positive attitude. I have to ACT positive...” You need to drill it. Fill your attitude with positivity. It's contagious. TV, events, books, audio, everything positive. Not all TV is bad... there are good, inspiring programs. And now we have the ability to record just the TV programs we want to watch. Eliminate the rest. Remember, attitudes are contagious either way: the good, the bad, the ugly, and the positive. Attitudes are your number one tool. And it's the number one tool in your entire organization that will enable you to be sustainable and solvent. Your whole organization needs a great attitude. 4."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "Attitude",
    "subsection_topic": "Product of Your Environment",
    "text": "Product of Your Environment If your parents are like most parents, at some point you heard, “You are who you hang out with.” As an adult, maybe you heard it put this way: You are the average of the five people you surround yourself with. In this section we're going to break that down and show how you're not just a product of your environment, but a product of everything that SURROUNDS you. That includes the TV you watch, the newspapers you read, the friends you have, the movies you go to, your hobbies, your interests, your family, and everything else that you are involved with. All of it influences your environment. And the degree to which your environment is either healthy or unhealthy is going to have something to do with your ability to sell. The single most valuable asset you have in your life is your ability to stay positive when everyone else is losing their mind. When everyone around you is freaking out and worrying and singing the blues, you can choose to stay positive. By staying positive, you become the obvious leader, and people will follow your lead. It is not enough just to be positive; you have to actually protect yourself against those who are being negative. Watch out for friends, family, work associates, and others around you who have an agenda of negatively affecting those around them. Attitudes, like diseases, are contagious. So, here's the commitment you need to make: No negativity, ever, period. Make a commitment to keeping it out of your house, your office, your mind, and your life. You need to commit to it, because your life and your happiness depend on it, and your future prosperity and financial freedom depend on it. 5. Tips to a Great Attitude If you aren't getting paid the way you want to and you know what you're doing, I assure you that your attitude is part of your problem! So the question is, how do you change it? How do you stay positive? What can you do to ensure that you're smiling, happy, loving life, saying the right things? How can you keep that going, other than just drilling it and doing the reps? How do you keep it going when you go three, four, five days, or five weeks, or five months without a contract? Here's what you do: 1. Avoid newspapers, television, and radio. If you can't do it completely, cold turkey, commit to doing it for 30 days. If you can't do 30 days, hey, do one day. If you do it a whole month, you'll see dramatic results. 2. Stay away from “can't-do” people. Stay away from people that have trouble in life, don't do well, arent't successful, aren't winning, and aren't lucky. Let's be clear: You can try to help the people, but you're not responsible for hanging out with them. This includes family and friends. 3. Create alignment. Get everyone in your life on the same page with where you're going and what you want in your life, as well as what's expected of them in order for you to get there! 4. Keep clean. Avoid drugs and alcohol because of the negative influence they have on your mind. They make you lethargic, slow, and unsure. Control your attitude by being aware and alert, not by being drugged and numbed. 5. Try to stay away from hospitals and doctors, if at all possible. This is a tip, you can take it, or you can leave it. Go see them only when you absolutely have to. Hospitals attract sick people. 6. Treat negative talk like garbage. Put up a sign in your home and your office that reads, “No negative talk zone.” Don't allow people to talk negatively around you. 7. Start the Negativity Diet today. Commit to no negative thoughts, ideas, or talk for the next 24 hours. This will be a start to you really getting control of your thoughts and actions, and it will help you build discipline to control how you think and act. The Negativity Diet works like this: No negative thoughts, talk, or actions for a full 24 hours or you restart the clock. While this may seem like a very simple challenge, it's rare to make it through the first 24 hours without having to restart the clock. The power comes from the habit, and the habit comes one minute at a time. Just start over until you build a discipline to control for longer and longer periods of time. Make it a game and keep starting over as many times as you need to. When you commit to these changes and start paying attention, you're going to have a major wake-up moment. Once awake, a person will become aware and can start making changes. PART 2: THE MAGIC OF AGREEMENT In this section, we're going to continue on with the concept of attitude and apply it to the sales process. We're talking about the first rule of selling, and it's absolutely critical to understand. You may have picked up on it in the story of Grant and the gentleman who wanted to buy a truck, but didn't want to pay a penny over invoice. Here it is: The first rule of selling-no matter what your product, service, offer, or company- is this: Always, always, ALWAYS agree with the customer. Always! 1."
  },
    {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "Attitude",
    "subsection_topic": "Tips to a Great Attitude",
    "text": "If you aren’t getting paid the way you want to and you know what you’re doing, I assure you that your attitude is part of your problem! So the question is, how do you change it? How do you stay positive? What can you do to ensure that you’re smiling, happy, loving life, saying the right things? How can you keep that going, other than just drilling it and doing the reps? How do you keep it going when you go three, four, five days, or five weeks, or five months without a contract? Here’s what you do: 1. Avoid newspapers, television, and radio. If you can’t do it completely, cold turkey, commit to doing it for 30 days. If you can’t do 30 days, hey, do one day. If you do it a whole month, you’ll see dramatic results. 2. Stay away from “can’t-do” people. Stay away from people that have trouble in life, don't do well, arent't successful, aren't winning, and aren't lucky. Let’s be clear: You can try to help the people, but you’re not responsible for hanging out with them. This includes family and friends. 3. Create alignment. Get everyone in your life on the same page with where you’re going and what you want in your life, as well as what’s expected of them in order for you to get there! 4. Keep clean. Avoid drugs and alcohol because of the negative influence they have on your mind. They make you lethargic, slow, and unsure. Control your attitude by being aware and alert, not by being drugged and numbed. 5. Try to stay away from hospitals and doctors, if at all possible. This is a tip, you can take it, or you can leave it. Go see them only when you absolutely have to. Hospitals attract sick people. 6. Treat negative talk like garbage. Put up a sign in your home and your office that reads, “No negative talk zone.” Don’t allow people to talk negatively around you. 7. Start the Negativity Diet today. Commit to no negative thoughts, ideas, or talk for the next 24 hours. This will be a start to you really getting control of your thoughts and actions, and it will help you build discipline to control how you think and act. The Negativity Diet works like this: No negative thoughts, talk, or actions for a full 24 hours or you restart the clock. While this may seem like a very simple challenge, it’s rare to make it through the first 24 hours without having to restart the clock. The power comes from the habit, and the habit comes one minute at a time. Just start over until you build a discipline to control for longer and longer periods of time. Make it a game and keep starting over as many times as you need to. When you commit to these changes and start paying attention, you’re going to have a major wake-up moment. Once awake, a person will become aware and can start making changes."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "The Magic of Agreement",
    "subsection_topic": "The First Rule of Selling",
    "text": "The First Rule of Selling Again, this is the single most important, most basic, and most commonly violated rule in all of selling; in fact, in all of communication. Write this down: If you want agreement, you have to be agreeable, okay? You can know the customer is wrong, and you would still need to agree with them. Right or wrong, agree. You can never expect someone to agree with you if you're disagreeing with them. Even if you're right, it won't happen. People are attracted to products, ideas, and people who represent the very things that they are already in agreement with. The people in your life you have the most agreement with are those people you want to spend the most time with. People who agree move toward one another. People who disagree move apart. Here's another commonly held truth we're debunking: Most people think it takes two people to resolve a conflict. Untrue. The truth is it takes one person to agree; and when they do, then there would be no conflict. Because for there to be conflict, there has to be two people disagreeing. Even when a buyer's making ridiculous, crazy claims or even exaggerations, agree. “I'm with you, sir.” “I agree with you, ma'am.” “I understand.” If they think something's black and you think it's white, you're both right. Now, I know you want to take your belief system and make them accept it. It's 100% clear that this is white. You're an expert, you've been doing this for years, and that is white, period. But the truth is it's black to them. If they think it's black and you want to get that sale, you need to see from their viewpoint how it could be black. If they think they should wait and think about it and you disagree, they'll dig in and become difficult. The objection will become valid and they will wait; and you will never get them to the close. The first rule of selling is always, always, always agree. Once you've agreed then you can move ahead. Agree, acknowledge, make the other party right for their thoughts, ideas, and beliefs, then close. No rule is violated more than the rule of agreement. It's unfortunate because agreeing is the road to more sales. You need to drill this, practice this, because humans are inclined-particularly in the West-to disagree in order to satisfy their need to be right. In selling you don't want to be right, you want to get something sold. 2."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "The Magic of Agreement",
    "subsection_topic": "The Agreement Challenge",
    "text": "The Agreement Challenge The best way to start making this a habit is to do what is called the “Agreement Challenge.” It's going to sound really, really simple, but it's going to be harder than it sounds! The concept is simple: Practice handling other people with agreement first. Remember the first rule of selling? Always, always, always agree. So here's the drill. Try to agree with everyone-and I mean EVERYONE you talk to-for one 24-hour period. I know it sounds easy, right? But I guarantee you will not make three hours. If you find yourself disagreeing outwardly with someone, you have to start the drill over. Let's say you go to your kids “Hey, let's go to school.” And your child says, “I don't want to go to school today.” If you're like most parents, you'll say, “Son, put your clothes on, let's go.” Whoops! You didn't agree with him first. You already messed up! So let's say your son says, “I don't want to go to school today.” Handle him by agreeing first. “I understand, Son. When I was your age I didn't want to go to to school either. I hated school. Put your shoes on and let's roll out of here.” Agree first and get the close later. Once you agree, it becomes possible for you to suggest other alternatives that are more suitable to you and your desires, but you have to get to agreement first. Let's do another example. Let's say you're doing this challenge. Let's say you sell solar roofing panels and the client tells you, “Hey that's way too much money.” Now it's getting real. Agreeing now is going to cost you money, not just happiness, right? So, what are you going to say? Again, what you want to do is agree. You say, “Excellent sir, and you know what? That's perfect for me. Everyone who invests in this product thinks it's a big investment. The truth is it IS a big investment; that's why you should get it installed now so you can start making your money back right away.” Agree and then offer the buyer an opportunity to find his or her own solution before you start trying to stumble around and try to fix something that may not even be an issue. 3."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "The Magic of Agreement",
    "subsection_topic": "The Agreement Drill",
    "text": "The Agreement Drill Some people will say, “Agreeing when you don't really agree is manipulation.” Nope. I'm not manipulating anyone. Agreeing is an attempt to get along, not manipulation. Disagreeing with people manipulates me out of a sale, manipulates them out of a good product. And why? Because we're disagreeing, because I need to be right. If you need to be right, selling is gonna be very difficult for you. By establishing basic agreement, you are creating the opportunity to help the buyer purchase your product and service. If the buyer never gets a chance to see what you're offering because of earlier disagreements, then you've made an error by not allowing them to see your product, your service, your company, the value... because you got lost in disagreement. This is the vocabulary necessary to agree. Repeat after me: You're right! I'm with you! I agree! I''ll work it out! I understand! I'll make that happen! Done! This is your agreement vocabulary. You want to drill it until it becomes a muscle, until it becomes almost an automatic response. Start the relationship off with agreement. You'll have the chance later to tell the prospect, -your buyer-about your product, yourself, and your company. 4."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "The Magic of Agreement",
    "subsection_topic": "Trust Is Critical to the Sale",
    "text": "Trust Is Critical to the Sale When you create trust, you will increase your effectiveness. Unfortunately, because of a handful of unethical salespeople who have misrepresented the benefits of their products, customers can sometimes not trust you. As a result, this skepticism keeps people on guard. It prevents the salesperson, you, from correctly establishing the trust critical to ever getting to a decision, and maybe even to selling your product, and showing the features and benefits. It doesn't matter where it came from. Distrust in a sales cycle is not the buyer's problem. Let me say that again: Distrust is not the buyer's problem. It's your problem. If the buyer doesn't trust you or your company or what you're saying, or your presentation, then the information you're offering will be minimized, challenged, comparison shopped, maybe even thrown in the trash. Let's be clear: The buyers will make a decision. If they buy from you, that's a decision. If they buy from a competitor, that's a decision. When they leave and don't do anything, that is a decision. When the buyer decides to think about it, to put it off, that's a decision. It's just not always the decision you want. When your buyer shops around, or thinks more, or puts off the purchase, it's because of some level of distrust. After all, if the buyers had full and complete confidence in you, the product, the terms, the company, they would commit and they'd do it now. When a salesperson understands what is going on in the mind of the customer, you've stepped into the area that only the professional delves into. This goes beyond selling now. This is beyond what the customer is saying or communicating. And when you do that, you know when people don't trust you. What I want you to get right now is this: 1. Trust is critical. I know you know that. Trust is critical. You need to hear this over and over. Trust is everything in sales. 2. If you don't get the sale, something is not trusted. This is absolute. If you don't get the sale, you're not trusted. Something's not trusted. 3. Every decision is a decision. You've got to build trust. 5. Customers Don't Make Sales, Salespeople Do You and your organization are going to make or break the sale. Customers don't stop sales, salespeople stop sales. In order to make sales, you have to understand the mind of a customer. If you don't recognize how buyers think, what causes them to respond, what causes them to act, you'll never be able to take full responsibility and you will never truly reach your potential. People are run by their minds. Understand the mind and you understand people. If people don't buy, it's because at some point you didn't assume enough responsibility for the selling, and didn't assume enough responsibility for the buying, either. You have to take responsibility for both, not one or the other. When you're at the top of your game, you'll take responsibility for managing the entire transaction. You'll take responsibility for getting the financing and it's not even your job. You'll take responsibility for the executive level decisions, if it's necessary, in order for you to get the job done. What I'm saying to you is this: Don't think about just your role. Think about getting the job done, whatever it takes. You have to get people confident in you. You can't get that disagreeing. You can't get it arguing. You cannot get it by insisting they do certain things. We have to build trust. It's your job not just to sell your product, but to help them buy the product. Take responsibility for both roles and you'll see your trust go up. That's why the only thing the buyer should have to do when they come to your company or when you assist them-the only thing they should have to do-is give you money. That's their job. 6. Credibility = Increased Sales A person could trust you and you could actually lose credibility. I'll give an example that happens all the time in the auto business. Running back and forth to someone to check with. “I gotta go check with Barbara. I gotta go check with John. I gotta go check with somebody else.” When you say you have to check with someone else, it's like you're saying, “I'm not sure. I don't know. I can't tell you that,” and that causes credibility issues. When something happens that puts your credibility into question-maybe you misquote something, you give the wrong information, you say something that's not true and the customer checks on the internet and finds out it's not accurate-you lose your credibility. Then it becomes difficult for the buyer to trust you to guide them. Someone can trust you, but not find you credible because they're simply not confident in you. Ignoring the credibility issue will not make the problem disappear. It has to be handled. When the buyer doesn't trust, you're not getting a sale. When the buyer doesn't have credibility or believe in you, you're probably not going to get the sale, either. If you want to work on credibility, it means you need to know everything there is to know about your field. You need to know about people, your products, your competition. You have to be credible. You can't be running around saying, “Oh, I don't know, let me ask Joe.” Let's say you're looking to buy some property in Los Angeles. You do your research about the houses in Los Angeles, the square footage, the price per square foot, what's available, what's not. You look at more homes in your particular price range than the real estate agent has. She's going to lose credibility with you. You may trust her as a person, but she loses credibility, which means she lengthens the sales process. She makes herself less valuable to you, and then you start shopping other realtors. It's just how it works. You want a salesperson who is an expert, who has credibility. When you're a salesperson, you want to own that credibility. That's the skill that you will need no matter what you do, where you go, what you present, whether you own the company, or you're the janitor. You need credibility. 7."
  },
    {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "The Magic of Agreement",
    "subsection_topic": "Customers Don't Make Sales, Salespeople Do",
    "text": "When you create trust, you will increase your effectiveness. Unfortunately, because of a handful of unethical salespeople who have misrepresented the benefits of their products, customers can sometimes not trust you. As a result, this skepticism keeps people on guard. It prevents the salesperson, you, from correctly establishing the trust critical to ever getting to a decision, and maybe even to selling your product, and showing the features and benefits. It doesn’t matter where it came from. Distrust in a sales cycle is not the buyer’s problem. Let me say that again: Distrust is not the buyer’s problem. It’s your problem. If the buyer doesn’t trust you or your company or what you’re saying, or your presentation, then the information you’re offering will be minimized, challenged, comparison shopped, maybe even thrown in the trash. Let’s be clear: The buyers will make a decision. If they buy from you, that’s a decision. If they buy from a competitor, that’s a decision. When they leave and don’t do anything, that is a decision. When the buyer decides to think about it, to put it off, that’s a decision. It’s just not always the decision you want. When your buyer shops around, or thinks more, or puts off the purchase, it’s because of some level of distrust. After all, if the buyers had full and complete confidence in you, the product, the terms, the company, they would commit and they’d do it now. When a salesperson understands what is going on in the mind of the customer, you’ve stepped into the area that only the professional delves into. This goes beyond selling now. This is beyond what the customer is saying or communicating. And when you do that, you know when people don’t trust you. What I want you to get right now is this: 1. Trust is critical. I know you know that. Trust is critical. You need to hear this over and over. Trust is everything in sales. 2. If you don’t get the sale, something is not trusted. This is absolute. If you don’t get the sale, you’re not trusted. Something’s not trusted. 3. Every decision is a decision. You’ve got to build trust. 5. Customers Don’t Make Sales, Salespeople Do You and your organization are going to make or break the sale. Customers don’t stop sales, salespeople stop sales. In order to make sales, you have to understand the mind of a customer. If you don’t recognize how buyers think, what causes them to respond, what causes them to act, you’ll never be able to take full responsibility and you will never truly reach your potential. People are run by their minds. Understand the mind and you understand people. If people don’t buy, it’s because at some point you didn’t assume enough responsibility for the selling, and didn’t assume enough responsibility for the buying, either. You have to take responsibility for both, not one or the other. When you’re at the top of your game, you’ll take responsibility for managing the entire transaction. You’ll take responsibility for getting the financing and it’s not even your job. You’ll take responsibility for the executive level decisions, if it’s necessary, in order for you to get the job done. What I’m saying to you is this: Don’t think about just your role. Think about getting the job done, whatever it takes. You have to get people confident in you. You can’t get that disagreeing. You can’t get it arguing. You cannot get it by insisting they do certain things. We have to build trust. It’s your job not just to sell your product, but to help them buy the product. Take responsibility for both roles and you’ll see your trust go up. That’s why the only thing the buyer should have to do when they come to your company or when you assist them—the only thing they should have to do—is give you money. That’s their job."
  },
    {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "The Magic of Agreement",
    "subsection_topic": "Credibility = Increased Sales",
    "text": "A person could trust you and you could actually lose credibility. I’ll give an example that happens all the time in the auto business. Running back and forth to someone to check with. “I gotta go check with Barbara. I gotta go check with John. I gotta go check with somebody else.” When you say you have to check with someone else, it’s like you’re saying, “I’m not sure. I don’t know. I can’t tell you that,” and that causes credibility issues. When something happens that puts your credibility into question—maybe you misquote something, you give the wrong information, you say something that’s not true and the customer checks on the internet and finds out it’s not accurate—you lose your credibility. Then it becomes difficult for the buyer to trust you to guide them. Someone can trust you, but not find you credible because they're simply not confident in you. Ignoring the credibility issue will not make the problem disappear. It has to be handled. When the buyer doesn’t trust, you’re not getting a sale. When the buyer doesn’t have credibility or believe in you, you’re probably not going to get the sale, either. If you want to work on credibility, it means you need to know everything there is to know about your field. You need to know about people, your products, your competition. You have to be credible. You can’t be running around saying, “Oh, I don’t know, let me ask Joe.” Let’s say you’re looking to buy some property in Los Angeles. You do your research about the houses in Los Angeles, the square footage, the price per square foot, what’s available, what’s not. You look at more homes in your particular price range than the real estate agent has. She’s going to lose credibility with you. You may trust her as a person, but she loses credibility, which means she lengthens the sales process. She makes herself less valuable to you, and then you start shopping other realtors. It’s just how it works. You want a salesperson who is an expert, who has credibility. When you’re a salesperson, you want to own that credibility. That's the skill that you will need no matter what you do, where you go, what you present, whether you own the company, or you’re the janitor. You need credibility."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "The Magic of Agreement",
    "subsection_topic": "People Believe What They See, Not What They Hear",
    "text": "People Believe What They See, Not What They Hear Have you ever had a customer who was just not listening to you? You're talking, “Dah, dah, dah, dah, dah, dah,” and it's not landing with them. This phenomenon occurs because the buyer assumes they can't trust you. He assumes that you're just talking. He assumes you're a pitchman, that you'll say anything. What it comes down to is people don't believe what they hear, people believe what they see. People will take the written word from a newspaper and even though it's false, they buy it. Because it was written, so it must be true. So, if people believe the written word-which they do-then always have your presentation, your proposals, your prices, your information, the data you're sharing, always have it in writing for the buyers, so they can see it with their own eyes. It's going to make you more believable, get more trust, and make you more credible. When people see it in writing, it becomes real to them. Use data and evidence to back up what you're saying. That way it makes you credible and shows that they can trust you. Make this a rule that you sell by. Assume that you must show them written data to support what you're saying. Buyers are usually drawing off of their own experiences of fabrications. They've fabricated, they've exaggerated. So, when you start pitching, they have to assume that viewpoint of distrust, because they've done that themselves. This isn't about you and your integrity. It isn't about your honesty or your intentions. You would never ever exaggerate, you would never over-offer, you would never over promise, never. This has nothing to do with what we're talking about. We're talking about them and their distrust, and what's going on inside them. Your job is to be credible and trustworthy to the customer you're in front of. When a customer has misunderstandings, this leads to distrust. So, what are you going to do to build credibility? Put it all in writing. Make a list of the things you can show or support what you're telling your customer. Then you can use that written material to validate and make yourself more credible. 8."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "The Magic of Agreement",
    "subsection_topic": "Use Third-Party Data to Validate",
    "text": "Use Third-Party Data to Validate So now you know how to build credibility and counter buyer distrust by using the written word. Now, let's take that a step further. When you're documenting facts for your customer, it's preferable to use third-party materials rather than something from you. You know how this goes... if The New York Times or even just Bob the blogger writes something about this product, that's more believable than if I said it myself. If my manufacturer said it and that was supported by some other third parties, that would be more acceptable to the consumer. That's third-party validation. Let's review: 1. When you're presenting features and benefits of your product, you're going to either write them down or show the benefits on paper, and support that with third-party validation. 2. If you're showing your customers how your product will improve their business, show them proof: statistics, success stories, in writing. 3. You want to keep an evidence manual of facts, success stories, and what other people have said as a result of doing business with you. 4. When you show them what your competition will do or won't do and you get in this bidding war, show them in writing. When you know you have the best price, you have the best product, you have the best service, back it up with documentation. All these things will increase your odds at closing the sale. People believe the written word and you want to capitalize on that. With the abundance of information available to today's buyer and to you through third-party consumer guides, the internet, and other sources, the buyers have become even more dependent upon facts to support their decisions. Buyers are going to continue to rely on these sources, so you need to make use of them as well. Those same sources will support your cause, build trust, and help the buyer trust you, so that they can trust themselves enough to make a right decision, and make it now. Also, know that an informed buyer is always better than an uninformed buyer. Here's why: An uninformed buyer cannot make a decision. This is a misconception in selling. Most salespeople would rather sell somebody not knowledgeable, because they think it's easier to sell them if they're uninformed. Someone who is uninformed about the product will make an offer that will almost always be too low; that's because it would be an emotional offer, not a logical one. We want logic and facts in the close, right? That's why we want to keep things credible. How do I keep things credible? I keep people logical. How do I keep people logical? Providing them with good data, providing them with the information. Information builds credibility, credibility builds trust, and trust means a buyer can make a decision. 9."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "The Magic of Agreement",
    "subsection_topic": "Tips on Using Information to Build Trust",
    "text": "Tips on Using Information to Build Trust Now I want to review some very specific tips on information to build trust. First, never sell with only words. Make sure to show documentation. I know I'm pounding this in, but trust is vital to a sale. Second, never negotiate with words. Instead, write your negotiations down on paper. Third, never ask for the close with words only. Use a buyer's order. Close with a written document. Fourth, never make verbal promises. If there is a guarantee, a warranty, some promise, put it in writing, otherwise the buyer is not going to trust it. Fifth, the more data, the better. Don't be afraid to use lots of data. Sixth, keep your information current. Something from a year ago means nothing to the person today. Seventh, have your written information available and easy to access, even prebuilt on your website. Eighth, use third-party data as much as possible. Third-party references, other sources; credible sources other than yourself. Ninth, the more you're able to access data in real time, the better. Prepared packages aren't bad, but if a customer could look on the internet with you in real time, that's preferred. Tenth, use computer-generated data whenever possible. Have internet access available to you right in the moment in front of the customers, so that they can see it's not contrived, it's not manipulated, and they can trust it. Make it easy for the buyer to research while they're with you. Remember, if they have enough information, it'll build trust and they can make a decision. After consulting hundreds of companies on improving sales processes, Cardone Enterprises often encourages the business management and the salespeople to make all competitive advertising available and fully displayed in their offices, so that the buyer doesn't have to go out and look at competition. Why have your clients do the work and shop around? Get set up to build credibility and you will see people make decisions with you now, when they used to be making decisions with you later. PART 3: GIVE, GIVE, GIVE In this segment, we're going to talk about the importance of serving and giving, and how when you get your priorities right, the sale is easy. Does this sound good? Let's dive in. 1."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "Give, Give, Give",
    "subsection_topic": "The Magic of Give, Give, Give",
    "text": "The Magic of Give, Give, Give Selling is the act of giving. And in all these previous segments that I've been talking about the basics of selling, I'm talking about service, not just selling. Look, it's not just about getting people sold, it's about servicing them to the sale. The true essence of selling is not just getting the sale. I mean real professional, master league greatness in selling is predicated on a sincere desire to help, to aid, to assist in service. The best salespeople I've ever met operate from this high plane of service. This is something that Grant has validated in his own life, and he's also seen it validated by the way other people live their lives-that if you give enough, life will sooner or later give back to you. And this is true for everyone. It's the same in sales as it is in life. I'm talking about giving the most attention. I'm talking about giving people the most energy you have. Giving them the best attitude, the highest level of service. Give, give, give. The focus is on how I can give people more, not just sell them more. This is the assurance of more sales, and more sales, and more sales. It starts with give, give, give. Grant lives this every day. If a customer asked him, “Hey Grant, can you get me something to drink?” Grant would get it for him. He'd open the bottle, he'd bring him a glass, he'd bring him ice, and he'd bring him a napkin. That's the way to service people. The guy didn't ask for ice, he didn't ask for a glass, and he didn't ask for the napkin. He didn't ask for it to be brought on a tray, but that's what you want to do. You want to deliver beyond what they ask for. That's give, give, give in action. Give all of you-not part of you-to your customer. If you go into a transaction and you think, “There's no way I'm going to make a deal, I'm only going to give the guy 25%.” There is no way you're going to make a deal at 25%. Give all your attention, all your energy, all your suggestions, all your information, then find some more of you to give. Exceed the buyers' expectations. Go further than they would ever expect you to. Withhold nothing and give yourself without reservation. 2. Love the One You're With When it comes to selling, you always want to pay attention to the one you're with. Stay with them from start to finish without allowing interruptions. While I'm here with you today, I'm not answering texts or phone calls. Imagine I did right now in the middle of our time together. What would you say? You'd be thinking, “How unprofessional is that? The guy's off doing other stuff while we're here waiting!” Show your customer how they're the most important person in your universe. Love the one you're with. If you can do that, you will be rewarded. But you have to give all of you, 100% of you. No taking a phone call or sending out an email. Just be focused on what's in front of you. You want to make your total commitment to that one opportunity, that one customer. Your customers will see that you're there with them all the way, regardless if they are taking calls, being distracted, or being interrupted. Human beings are more valuable than money. I don't care if they have money or don't have money. Treat them like they will buy and they'll buy. Remember when we talked about treating people like millionaires? Once you get that discipline built in, people are going to pick up on it. The best salespeople in the world are not fast-talking people. Instead, they're the ones who go the extra mile to find ways to improve the customer's life, who find ways to pay complete attention, even if they're working with five people at the same time. Whether it's one customer or five, love the one you're with. You've got enough attention to go around to a lot of places, more than you're using. What I want you to practice right now is giving complete attention to one at a time, until you're good enough to spread it out among everyone. Love the one you're with. 3."
  },
    {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "Give, Give, Give",
    "subsection_topic": "Love the One You're With",
    "text": "When it comes to selling, you always want to pay attention to the one you’re with. Stay with them from start to finish without allowing interruptions. While I’m here with you today, I’m not answering texts or phone calls. Imagine I did right now in the middle of our time together. What would you say? You’d be thinking, “How unprofessional is that? The guy’s off doing other stuff while we’re here waiting!” Show your customer how they’re the most important person in your universe. Love the one you’re with. If you can do that, you will be rewarded. But you have to give all of you, 100% of you. No taking a phone call or sending out an email. Just be focused on what’s in front of you. You want to make your total commitment to that one opportunity, that one customer. Your customers will see that you’re there with them all the way, regardless if they are taking calls, being distracted, or being interrupted. Human beings are more valuable than money. I don’t care if they have money or don’t have money. Treat them like they will buy and they’ll buy. Remember when we talked about treating people like millionaires? Once you get that discipline built in, people are going to pick up on it. The best salespeople in the world are not fast-talking people. Instead, they’re the ones who go the extra mile to find ways to improve the customer’s life, who find ways to pay complete attention, even if they’re working with five people at the same time. Whether it’s one customer or five, love the one you’re with. You’ve got enough attention to go around to a lot of places, more than you’re using. What I want you to practice right now is giving complete attention to one at a time, until you’re good enough to spread it out among everyone. Love the one you’re with."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "Give, Give, Give",
    "subsection_topic": "Level of Service",
    "text": "Level of Service Service is the way to higher profits, higher prices, and the only way to lessen the competition. You can literally separate yourself from the entire pack of competition with just one item: high levels of service. A salesperson caught in a constant price conflict might not agree with my points here because they're mentally stuck in the concept that price is the only solution, the only way out. But price is not a solution; it is never the way out and it will never be. A better product is not the solution, either. Sooner or later, someone is going to copy your product, make something similar-or even better-that they're willing to sell at a lower price. So what will buyers pay extra for? The product? I don't think so. I think they're going to pay extra for great service. And even if you have a great product, somebody's going to copy it sooner or later, and then it's going to be back to price again. For instance, Apple was killing it in the marketplace for a long time with products people loved. Now, there are arguably better products out there. But no one does a better job at servicing them. You just pop into the Apple Store and get a genius-and who doesn't want a genius to help you? As long as they're tops in service, they're going to stay on top, even if other people come up with better products. The ease of purchase is the way to service somebody. Convenience is the way to service someone. It's not just about a cheaper price. People will pay more for great service than they will for a great product. So, how can you create a level of service that separates you from others and that people will pay for? What's your equivalent of a Genius Bar? For instance, going to the client rather than the client coming to you is a great service. I don't know why more businesses don't do this! Creative thinking, creative action. Go where other people won't go. That's what you want to do with service. At Cardone Enterprises, we actually think creatively about what our competition won't do, because that's where we want to go. There's no value in us dropping our prices. People brag when they pay extra to do business at Tiffany's, the Ritz, the Four Seasons. People pay $2,500 a year to own the Black Card, to get the Express Centurion service from American Express. Elevate your service to that Black Card level. Elevate your level of service to rival that of the Four Seasons. I don't want you to be competing with your competitor. I want you to get way above them. Put your customer in a level of service where they don't comparison-shop you. They don't mention price. They're just like, “Okay, let's do it because I know you're going to take care of me.” There are a lot of sales trainers out there who will tell you that you should never call back a client and ask for a problem. I've heard this advice before: “Don't ask for problems.” And salespeople believe this! But I'll tell you the truth: You WANT problems. Problems are opportunities. At Cardone Enterprises, there's a policy that all complaints go straight to Grant. He wants the complaints because he knows these are opportunities for him to offer service and to separate us from everyone else. Adopt an attitude that reflects that problems aren't the service department's responsibility or the call center's responsibility. If a customer has a problem, you want to take care of it. This gives you an opportunity to have a relationship, to own that client. Service is senior to selling. Look for every opportunity possible to service your client. 4."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "Give, Give, Give",
    "subsection_topic": "Make Service Senior to Selling",
    "text": "Make Service Senior to Selling Service is always senior to selling someone. Grant says one of the best salespeople that he has ever met is a guy named Gavin, who is a fundraiser. Grant considers Gavin a friend because of the amount of attention Gavin gives Grant not just when he wants something, but the rest of the time, too. He is always asking, “How can I help you Grant, what can I do to help your organization, what can I do to help you, is there any way I can be of service?” Gavin is an incredible salesperson. But above that, he is dedicated to high levels of service, he is dedicated to human beings, and he is dedicated and interested in helping people. Maybe Gavin is just a complete manipulator and doesn't mean any of that; but that is not true because he is so consistent in offering service. His commitment to service and to raising funds is deep. His dedication to high levels of service and to those individuals that actually contribute is even deeper. One without the other generates mediocre results. You have to have them both: Deep belief in your product and a high level of service. You put those two together... This guy Gavin is going around with barrels loaded: service and purpose. In all these segments for this training, we're not just talking to you about teaching you how to sell. We are teaching you a mindset, a new discipline, a new way of being, so you can be successful at whatever you want to do. You'll experience a career that is free of stress, worry, and problems. Give yourself fully and provide unparalleled levels of service. Forget about the competition. Exceed what they do. 5."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "Give, Give, Give",
    "subsection_topic": "The Hard Sell",
    "text": "The Hard Sell Most people don't buy without someone having to ask them more than once. And most people won't say yes to someone who quits asking. Most people aren't going to say “yes” if you quit. They're not going to just say “okay” all of the sudden. If you quit, it's going to be a “no.” It's been my experience that most people won't just give you the money without you asking and persisting, and being willing to do what we call a “Hard Sell.” I don't mean they're a hard sell. They're not hard to sell. You are a hard sell. Let me be clear: I'm not talking about pressuring people. If I have a great product, a great service, and I know it will save the people money, and I know it's the right thing to do, trust me, I will stay there until I get the deal. I'm talking about being willing to get to that hard place in the close where everyone may experience a bit of discomfort. The salesperson, you, the manager, the CEO, or anybody who wants to make anything happen in their life must be willing to stay in a transaction and persist through that transaction to the close, if they truly believe deep down inside that the product or the service is right for the buyer. If you don't stay in it, if you don't persist, it's not going to happen. A buyer may say to you, “Hey, are you pressuring me right now?” That's when you answer, “Sir, you're confusing my belief, and my passion, and my insistence on knowing that this is the right thing, that this is the right product, that we're the right company, that I'm the right person. Please don't confuse that with pressure. Don't misinterpret my enthusiasm for pressure. Let's do this.” When you hit this place called the “Hard-Sell Status,” you've become so convinced in your product, in your company, in your service, that the only answer that truly takes care of this buyer now is to close. In fact, it would be a disservice if you don't close. Because you believe so deeply, you're willing to stay in this deal even when it gets uncomfortable. The willingness to stay in there is what separates the professional, the master of the trade, from an amateur. 6."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "Give, Give, Give",
    "subsection_topic": "Closing Is Like a Recipe",
    "text": "Closing Is Like a Recipe If you're making a meal, you're going to open a book or pull up a recipe online. You're going to say, “Hey, what's in the recipe? What do I put? What are my ingredients?” Combine those specific ingredients together in a certain order, put them in the oven at a certain temperature for a certain amount of time, do it exactly as the recipe is laid out, and you get what you anticipated. But if you change one thing, the recipe changes. It's the same thing with closing. The more you practice handling objections, handling people's stalls, handling things that aren't even objections which are more often just complaints, the more natural you're going to sound. Let me be clear, there's nothing wrong with you learning what you're going to say. You want to know what you're going to say, so that you can handle certain situations successfully. And that means practicing. You need to practice handling objections, stalls, and complaints, so that you can persist intelligently through the resistance. Grant talks about how he practiced this daily for years. Each day on his way to work he listened to material that prepared him for the close. Every morning after he got to work, he'd team up with another salesperson or a manager, and they'd practice every possible situation that they would possibly encounter that day. You can do this too. If you don't learn how to do that, you're not going to become one of the greats. Know how to make the recipe, know how to deliver it, know how to cook it, and know how to close it. Video yourself. Literally, get a video camera or use your phone. Watch your gestures. Watch your hand motions. Watch your tone level. Watch the responses. Throughout the day write down those objections, and then the next day team up with another associate. Practice handling anything you weren't satisfied with from the day before. Drill, practice. This is what builds confidence. PART 4: THE PRICE MYTH You're going to love this section. We're getting into the nitty-gritty of sales, the stuff you've been thinking about... money. We're going to talk about price, dealing with price objections, and what's really holding your buyers back from buying-and it's usually not money! 1. It's Almost Never Price Now, if I were to survey all the salespeople in the world, which is about 1.25 billion people, most of them would say that the number-one reason they lose a sale is over price. And 1.25 billion people would be absolutely incorrect. In fact, nothing could be further from the truth. Price is not the buyer's biggest concern. It is actually at the bottom of the list of concerns and reasons why people don't buy. Most sales are lost over objections you never ever hear. Getting the sale is not about money. It's ultimately about the buyer: Your buyer having confidence, first, in that the product is the right one; second, that you're the right person; and third, that he or she wants this company supporting him or her. But here's the catch: Your buyers are never going to tell you, “You know, I'm really concerned I'm not making the right decision on the right product.” Instead, they are going to talk about the price. Most salespeople believe that if the price was just a little lower they'd sell more of it. But the truth is, I promise you, you would not sell more because you haven't correctly named the right problem. And if you don't name the right problem, you're never going to be able to come up with the right answer. Price is not the problem. Do the buyers love the product? Do they have complete confidence that this product is right? Do they have complete confidence that the company will take care of them? Do they have complete confidence that you will support them? And do they value that product, the company, and you enough that they'd pay for it? It takes an individual-a human being, a salesperson-to sell features, benefits, to build value, to do a great product presentation, to get emotional, and get the customer emotional, so that the customer can even make sense of the price! You have to give the buyers reasons to build that value in their own mind. Logical reasons so they can justify first, making a decision; second, making sense of the money. And which one is more important? Making a decision. It is not your job to make sense of the money, it's your job to give the buyer an emotional connection, a heartfelt connection, to make a decision that is logical. A logical reason to justify a heart decision. You sell people emotionally, you close them with logic. You do this with words and phrases, which we'll talk about more. But right now, I need you to understand one basic idea-and I don't care if you've been doing this 50 years or 50 minutes-price is not the problem. 2."
  },
    {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "The Price Myth",
    "subsection_topic": "It's Almost Never Price",
    "text": "Now, if I were to survey all the salespeople in the world, which is about 1.25 billion people, most of them would say that the number-one reason they lose a sale is over price. And 1.25 billion people would be absolutely incorrect. In fact, nothing could be further from the truth. Price is not the buyer’s biggest concern. It is actually at the bottom of the list of concerns and reasons why people don’t buy. Most sales are lost over objections you never ever hear. Getting the sale is not about money. It’s ultimately about the buyer: Your buyer having confidence, first, in that the product is the right one; second, that you’re the right person; and third, that he or she wants this company supporting him or her. But here’s the catch: Your buyers are never going to tell you, “You know, I’m really concerned I’m not making the right decision on the right product.” Instead, they are going to talk about the price. Most salespeople believe that if the price was just a little lower they’d sell more of it. But the truth is, I promise you, you would not sell more because you haven’t correctly named the right problem. And if you don’t name the right problem, you’re never going to be able to come up with the right answer. Price is not the problem. Do the buyers love the product? Do they have complete confidence that this product is right? Do they have complete confidence that the company will take care of them? Do they have complete confidence that you will support them? And do they value that product, the company, and you enough that they’d pay for it? It takes an individual—a human being, a salesperson—to sell features, benefits, to build value, to do a great product presentation, to get emotional, and get the customer emotional, so that the customer can even make sense of the price! You have to give the buyers reasons to build that value in their own mind. Logical reasons so they can justify first, making a decision; second, making sense of the money. And which one is more important? Making a decision. It is not your job to make sense of the money, it’s your job to give the buyer an emotional connection, a heartfelt connection, to make a decision that is logical. A logical reason to justify a heart decision. You sell people emotionally, you close them with logic. You do this with words and phrases, which we’ll talk about more. But right now, I need you to understand one basic idea—and I don’t care if you’ve been doing this 50 years or 50 minutes—price is not the problem."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "The Price Myth",
    "subsection_topic": "Love, Solve Problems, and Confidence",
    "text": "Love, Solve Problems, and Confidence When you have a price conflict, there is something you don't know about what people value. And if you don't know what they value, you cannot provide information for them to make sense of the price. You have to know what else is important to these people other than price. These days, it's easy to shop around based on price. Your buyer can always find someone that will sell that product cheaper. So if that's true, if everyone has access to a database of who's charging what, explain to me why everyone doesn't just buy from the lowest seller. It is because people want more than the lowest price. People want to know “I'm buying the right thing.” “I have confidence in the product, I have confidence not just in the product, but in the company that's getting it to me.” “I have confidence in the product, in the company, and in the person who's representing that company.” And that's you. So, what do you do? First, establish that they love the product. Number one, love it, love it, love it-heart beating, stammering, gotta have it. Number two, they have confidence that you'll solve their problem. Number three, you need to demonstrate why buying from you and your company is uniquely different. It's a value-added proposition, you offer something others do not offer. Let's say a guy is buying a three-carat ring for his girlfriend. He is trying to solve a problem, trust me. Before, or just after you present your product, determine the connection or love, the affinity they have with this product by presenting other possibilities. You could say, “Hey, any chance you'd consider this?” “No no no no, this is the one I want.” “How about this? How about we go over here?” “No no no, this is the one I want.” If you hear that, you have found out you have a connection. Now let's talk about the second point, confidence in the product and solving problems. Every customer, 100% of the time, is looking to solve a problem when they are buying a product, always. This means you first find out the connection, and then you find out what problem they're trying to solve. What is the primary motivation? Why did you come in today? Why now? Why are you considering doing this at this time? Why didn't you do it three months ago? Why didn't you wait for three months? You have to probe to find out what the motivation is. “Well, I'm really trying to buy a ring for my girl because we broke up.” Oh, they broke up! That means he is trying to get her back. He'll go three carats, he might go four. Once you have the connection, once you know what the real problem is, now the third point is you and the company. Make people like you. Service them like mad, like crazy, laugh with them, agree with them, have a great attitude. When they're in love and completely confident in the product solving their problems, and then, on top of that they like you, want to do business with you, and see value in you, you got your deal. But those three things have to be in. Then price isn't an issue. It never was. 3."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "The Price Myth",
    "subsection_topic": "More on Price",
    "text": "More on Price We're not done with price yet! I really want you to understand the price issue because it stumps so many salespeople. Have you ever bought a piece of clothing that was cheap, really inexpensive, but you only bought it because of the price? Then you went home and found out it doesn't fit-it doesn't look good on you, so you never wore it. It's still in your closet four years later. Was it a good deal? No, because it was a waste. Now you understand that price is not the only issue. You have to get your buyers to want something-your product-more than they want their money. If I'm selling a $40,000 product and a guy says, “I'll do it. Let's roll. I want it. I'll take it. Let's get it.” He believes that product is worth more than $40,000, otherwise he wouldn't close the deal. To get to the level where the value of the product exceeds the value of your client's money, you have to discover what they're trying to accomplish. You will then know what your product is worth. Then you'll be able to demonstrate to him or her how your product solves that problem. This is the essence of how to close a deal. So again, if you build the value high enough, the clients will come up with the money. If they really love it, if it really solves a problem, they'll figure out a way to do the deal. If they're absolute in love and confident it will solve their problems, they'll give up their money. Whether you're selling a $40,000 product, a $4 million product, or a $400 million product, it doesn't matter. You need to know that whatever that price point is, you have to do a presentation, a demonstration, and build way greater value than the money you're asking for. 4. Handling “Other” Concerns Handles Price Now I want to talk about how dealing with other concerns can actually handle price. I know that if the person I'm working with can afford- meaning, he or she has the funds available to buy my product or service- but is not buying my product or service and continues to harp and focus on the money, I always realize that this buyer has some other concerns. So while your customer may be objecting to price, the budget, or the terms, there's something else that you possibly don't know. So let's run through what those might be: Is this the right product? They're wondering, is there a better product than this product for us? Is this the right proposal? The terms, the payments, the interest rate, the other parts of the proposal. Will this truly solve our problem? This is a big concern for people today. Will my people use it? Will I use it? What will other people think about me doing this? People buy stuff everyday. They won't even tell anybody because they're ashamed of what they bought. Is this something I'm going to really use and enjoy? Or is it going to just sit in the closet and never be used? Will this company really take care of us and service us? The last two companies didn't. Are they going to be different? Am I better off buying some other product? Most of you right now think that you're in competition with another person who sells exactly the same product you sell. This is incorrect. You are in competition today with the entire world and everything that is being sold. For instance, I could buy a $60,000 car or I could take that money and buy a golf membership. I'm going to do one or the other. That's why I say you're competing with the country club now, not just other car dealerships. Will something better come out next week? In the technology world, this happens all the time. Do I want to hold off on this computer purchase for three months? Do I know enough to make a decision? Do I need more data? Do I need to do more shopping? Do I have all the information? Should we get invested, or should we get our money invested in something else instead of this? Is this going to be a mistake like other decisions I've made? Is this person going to let me down? Will this person even be here three months from now to help me and service me? If these considerations are handled to your buyer's satisfaction, price will not be the biggest issue. 5. Justifying Price with Other Inventory When faced with a price objection, salespeople-and managers-often make the mistake of always offering something for a lower price. But this is incorrect. If you do this, you are supporting the solution on the false belief that price is the only reason people don't buy things. When you move the customers down in price to offer something cheaper, they are actually even less likely to want the next product if they didn't want the first one. This will cause your buyer to actually believe that you don't have a solution, and that he or she is just wasting time. What you want to do instead is to actually move the buyer up, when a price objection comes up. This will get your customer thinking in terms of value, not price, and will determine whether or not the price objection is even valid. Let's say someone's looking at diamond rings. He's not 100% set on the first ring you show him. You offer to show him something more expensive. Either he agrees to look at something more expensive or he doesn't. If he says, “I can't look at it, I really like this one,” that means he's committed. If he says, “I'll look at the more expensive ring,” that means he wasn't committed. If he tells you he needs to move in the other direction, something cheaper, then price was a valid objection. If price is a valid objection, we can move him down in inventory. That's what happens when he looks at the more expensive options. It actually builds value on what you were originally showing him. He can't afford the higher-priced items, but either way you've got him shopping your inventory. When you can't close a sale because of money, you always want to think, first thing, I need to move them up. This is called “closing with inventory.” You are using inventory to close. You are exhausting inventory, not your gross margin. I've had thousands of customers telling me “it's too much money, I'm over budget.” They get all uncomfortable and freak out about the money like it's the security of their lifetime. When they get that look on their face, I immediately move the buyer up to a more expensive product. Why? Because he or she is telling me it's too much money for that product. It's too much money for that service. It didn't resolve the problem. You've got to believe that your buyer would rather pay more and make the right decision than pay less and make a mistake. Your problem with the sale is the decision, not the price. Don't buy into the talk, into the gossip, the rumor of the other mediocre salespeople around you who believe price is the big issue and price is the most important thing. You hear it all the time, “If I could sell for less, I'd sell more.” These people promote this idea so freely. They sell because they believe that if price was lower they'd sell more. It's simply not true. It's not true. You cannot be Walmart. I'll give you an example. One time a charity asked Grant to help them out with some fundraising. They told him about this one qualified prospect they'd been working with. “This guy is tough, Grant. We've been working on it for a year and he won't give us any money.” In three minutes, Grant took this guy up 10 times the amount they were asking him to contribute. It was 10,000 and Grant moved him to 100,000. Afterwards, Grant asked him, “Why did you give me 100 and you wouldn't give them 10?” The guy said, “Grant, I didn't think 10,000 would make a difference.” They weren't using the right order of magnitude. They weren't using a number big enough to solve his problem. Remember, when it's too much money, what are you going to do? Move them up first. This is a great technique. I promise you, you'll close more sales and make more money. 6. Salespeople Stop Sales, Customers Don't We've been talking a lot about how you have responsibility for the sale. Let's hammer that home even more. Here's the deal: Salespeople stop sales. Customers do not stop them. Have you ever noticed that salespeople have this incredible ability to place blame on a number of factors when they are unable to sell their products? They blame customers. They blame the market. They blame the management. They blame the economy. They blame the manufacturer. They blame the government, the last government, the next government, 20 years from now, and on, and on. It's called “blame management.” Don't allow yourself this habit. When you're not able to close a deal- make the sale- ask yourself: What did I not do? What did I miss? What did I not uncover? You can even ask these questions directly to the customer. Grant always says that when a customer tells him, “Hey, I'm not buying today.” Grant replies, “Sir that would be my fault, not yours. I take full responsibility for your decision.” When he does this, even very seasoned professional-buyer types look at him and say, “Hey, that's good. I've never heard that from a salesperson before.” More often than not, within 60 minutes, the deal, the transaction is finished. Take responsibility for everything. You will then make the sale. Make this part of your presentation. For instance, if the price isn't right, it's your fault. If the timing's not right for them, it's your job to make it right. If the customer doesn't have enough information, it's your responsibility to get them the right information. If financing for some reason became a problem, that would be your job to handle, not theirs. Basically, if anything is a problem, you will be the one to solve it. That's your job. If you can't solve it, hey, the customer sure doesn't have to. Write it down: Never, never, never again will I blame a customer for not making a decision. If it is to be, it's up to me. PART 5: YOUR BUYER'S MONEY In this section, let's dive even deeper into the topic of money... specifically, your buyer's money, and how you need to think about it. Then I'm going to share a trick that will increase your income by 25% with no effort at all... does that sound good? We're also going to cover some tips to help you get your mind right. Ready? Let's get going. 1."
  },
    {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "The Price Myth",
    "subsection_topic": "Handling 'Other' Concerns Handles Price",
    "text": "Now I want to talk about how dealing with other concerns can actually handle price. I know that if the person I’m working with can afford—meaning, he or she has the funds available to buy my product or service—but is not buying my product or service and continues to harp and focus on the money, I always realize that this buyer has some other concerns. So while your customer may be objecting to price, the budget, or the terms, there’s something else that you possibly don’t know. So let’s run through what those might be: Is this the right product? They’re wondering, is there a better product than this product for us? Is this the right proposal? The terms, the payments, the interest rate, the other parts of the proposal. Will this truly solve our problem? This is a big concern for people today. Will my people use it? Will I use it? What will other people think about me doing this? People buy stuff everyday. They won’t even tell anybody because they’re ashamed of what they bought. Is this something I’m going to really use and enjoy? Or is it going to just sit in the closet and never be used? Will this company really take care of us and service us? The last two companies didn’t. Are they going to be different? Am I better off buying some other product? Most of you right now think that you’re in competition with another person who sells exactly the same product you sell. This is incorrect. You are in competition today with the entire world and everything that is being sold. For instance, I could buy a $60,000 car or I could take that money and buy a golf membership. I’m going to do one or the other. That’s why I say you’re competing with the country club now, not just other car dealerships. Will something better come out next week? In the technology world, this happens all the time. Do I want to hold off on this computer purchase for three months? Do I know enough to make a decision? Do I need more data? Do I need to do more shopping? Do I have all the information? Should we get invested, or should we get our money invested in something else instead of this? Is this going to be a mistake like other decisions I’ve made? Is this person going to let me down? Will this person even be here three months from now to help me and service me? If these considerations are handled to your buyer’s satisfaction, price will not be the biggest issue."
  },
    {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "The Price Myth",
    "subsection_topic": "Justyfying Price with Other Inventory",
    "text": "When faced with a price objection, salespeople—and managers—often make the mistake of always offering something for a lower price. But this is incorrect. If you do this, you are supporting the solution on the false belief that price is the only reason people don’t buy things. When you move the customers down in price to offer something cheaper, they are actually even less likely to want the next product if they didn’t want the first one. This will cause your buyer to actually believe that you don’t have a solution, and that he or she is just wasting time. What you want to do instead is to actually move the buyer up, when a price objection comes up. This will get your customer thinking in terms of value, not price, and will determine whether or not the price objection is even valid. Let's say someone’s looking at diamond rings. He’s not 100% set on the first ring you show him. You offer to show him something more expensive. Either he agrees to look at something more expensive or he doesn’t. If he says, “I can’t look at it, I really like this one,” that means he’s committed. If he says, “I’ll look at the more expensive ring,” that means he wasn’t committed. If he tells you he needs to move in the other direction, something cheaper, then price was a valid objection. If price is a valid objection, we can move him down in inventory. That’s what happens when he looks at the more expensive options. It actually builds value on what you were originally showing him. He can’t afford the higher-priced items, but either way you’ve got him shopping your inventory. When you can’t close a sale because of money, you always want to think, first thing, I need to move them up. This is called “closing with inventory.” You are using inventory to close. You are exhausting inventory, not your gross margin. I’ve had thousands of customers telling me “it’s too much money, I’m over budget.” They get all uncomfortable and freak out about the money like it’s the security of their lifetime. When they get that look on their face, I immediately move the buyer up to a more expensive product. Why? Because he or she is telling me it’s too much money for that product. It’s too much money for that service. It didn’t resolve the problem. You’ve got to believe that your buyer would rather pay more and make the right decision than pay less and make a mistake. Your problem with the sale is the decision, not the price. Don’t buy into the talk, into the gossip, the rumor of the other mediocre salespeople around you who believe price is the big issue and price is the most important thing. You hear it all the time, “If I could sell for less, I’d sell more.” These people promote this idea so freely. They sell because they believe that if price was lower they’d sell more. It’s simply not true. It’s not true. You cannot be Walmart. I’ll give you an example. One time a charity asked Grant to help them out with some fundraising. They told him about this one qualified prospect they’d been working with. “This guy is tough, Grant. We’ve been working on it for a year and he won’t give us any money.” In three minutes, Grant took this guy up 10 times the amount they were asking him to contribute. It was 10,000 and Grant moved him to 100,000. Afterwards, Grant asked him, “Why did you give me 100 and you wouldn’t give them 10?” The guy said, “Grant, I didn’t think 10,000 would make a difference.” They weren’t using the right order of magnitude. They weren’t using a number big enough to solve his problem. Remember, when it’s too much money, what are you going to do? Move them up first. This is a great technique. I promise you, you’ll close more sales and make more money."
  },
    {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "The Price Myth",
    "subsection_topic": "Salespeople Stop Sales, Customers Don't",
    "text": "We’ve been talking a lot about how you have responsibility for the sale. Let’s hammer that home even more. Here’s the deal: Salespeople stop sales. Customers do not stop them. Have you ever noticed that salespeople have this incredible ability to place blame on a number of factors when they are unable to sell their products? They blame customers. They blame the market. They blame the management. They blame the economy. They blame the manufacturer. They blame the government, the last government, the next government, 20 years from now, and on, and on. It’s called “blame management.” Don’t allow yourself this habit. When you’re not able to close a deal—make the sale—ask yourself: What did I not do? What did I miss? What did I not uncover? You can even ask these questions directly to the customer. Grant always says that when a customer tells him, “Hey, I’m not buying today.” Grant replies, “Sir that would be my fault, not yours. I take full responsibility for your decision.” When he does this, even very seasoned professional-buyer types look at him and say, “Hey, that’s good. I’ve never heard that from a salesperson before.” More often than not, within 60 minutes, the deal, the transaction is finished. Take responsibility for everything. You will then make the sale. Make this part of your presentation. For instance, if the price isn’t right, it’s your fault. If the timing’s not right for them, it’s your job to make it right. If the customer doesn’t have enough information, it’s your responsibility to get them the right information. If financing for some reason became a problem, that would be your job to handle, not theirs. Basically, if anything is a problem, you will be the one to solve it. That’s your job. If you can’t solve it, hey, the customer sure doesn’t have to. Write it down: Never, never, never again will I blame a customer for not making a decision. If it is to be, it’s up to me."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "Your Buyer's Money",
    "subsection_topic": "No Shortage of Money",
    "text": "No Shortage of Money If you're going to make big money, you need to get your head right about money. Before you ever ask a customer for money-and I'm talking to management now, I'm talking to salespeople, I'm talking about anybody who wants to get more money-you have to get yourself straight about the subject. Did you know there's enough money circulating on this planet right now for every human being to have a multimillion-dollar net worth? Isn't that a great idea? Now, I'm not saying that somebody's just going to give you the money. You're going to have to go get your share. If you're not getting your share it's because you're thinking in terms of hard work and limits, not abundance. Imagine I sent you to the Red Sea right now and I told you to get as many buckets of water as you want. How many can you take? Look, you could take as many buckets as you want, nobody's going to know anything happened, because there's plenty of ocean water. Same thing with money. Look how much money there is in the marketplace, how many homes, cars, telephones. How much clothing is consumed annually? Food is consumed annually, fuel is used annually. It all represents tremendous, endless amounts of money. If we ever get close to running out, I promise you like I said earlier, they'll print some more. Get over the idea there's a scarcity of money, because there is not. There's plenty of money to go around. There's plenty for you. You go take a couple million dollars-let's say $10 million-out of the world economy, nobody's going to know you even exist. If you start looking for prosperity and you start looking for abundance, and you start looking for wealth, you'll see it exists everywhere. Many of the best, the highest paid salespeople that I have ever met in my years of being around salespeople, are the most generous people I have ever met. Why are they generous? It's not just that they're nice people. No. They're generous because they're not stressed about money, because they know there's no shortage, and because they know they don't possess money. They use money. They know that money is constantly in circulation and all they have to do is collect it. Are you wondering how you collect money? By producing. Because these people know how to produce and because they don't have a problem with limits, they don't have trouble getting money. Look, if you won't spend it, if you won't use it, if you won't even at times waste it, you're never going to have it. Money is plentiful, it's abundant, and there's no scarcity. 2."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "Your Buyer's Money",
    "subsection_topic": "Second Sale",
    "text": "Second Sale How about learning a way to turn your income up 25% without ever selling an additional product? Does that sound good? Think back on all the times you've been shopping for products. You would look forever. Have you ever been to a store and you look forever, you can't find anything, look a little longer, and then you find one thing? The next thing you know, you make another round in that store or mall, and you start finding other things you can buy. Have you ever had this experience? This phenomenon is common among decision makers and consumers. There's something about the flow. It takes a little while to start but once the flow begins, the flow, the money, the decision-once that begins- the buyer becomes more open to making more purchases. The consumer, the individual, or the decision maker does so because he or she uses the second purchase to follow up the original purchase; because the second purchase basically supports the rightness of the first decision. Once you clue into this, you're going to see it everywhere. I'll give you some examples. Go down to Beverly Hills. Show me one woman walking Rodeo Drive carrying just one shopping bag. If you can show me that, I'll be shocked. Instead, you're going to see a second bag, a third bag, a fourth bag. You're going to see a second item, a third item, a fourth item. Why? They're using second, third, and fourth items to support that first purchase. Here's what you do. Wait until the first deal is either completely consummated or right at the point where you're going to cash out the transaction. Right at that point, you want to ask, “Hey, would you consider adding, going up to the next level? It only costs you another...” You don't want to do it before the sale is confirmed. You want to do it right before everything is completed. Timing is everything here. You have nothing to lose and everything to gain. Second money, it's scary at first because you've never done it. But once you get it down, second money is easier to get than any money you will ever make in your lifetime. People are going to tell you, “Don't be greedy. Don't complicate the close. Don't confuse people. Finish it and get out.” Don't listen! You can't blow a deal like this. All you can do is add value. This kind of little thinking is for mediocre sales people, not for great salespeople. You're using this program not to just understand selling, you want to be great, a master. Second money is for those people who want to take their game to that next income level. You want to do it in half the time, not twice the time. All you have to do is unlock the door to the second money. Get over your fear of blowing the deal and go for it. 3. The People Business, not the “X” Business When someone asks you what business you're in, what do you say? Well, it's not your industry. You're not in the software business, the real estate business, or the car business. First and foremost, you're in the people business. The manufacturers might be pushing product awareness and product knowledge because they believe the weakness of the salesforce is product knowledge, but in reality, the weakness of all salespeople starts with people skills. There are sales people who understood every in and out of the product, every detail, but couldn't close the door of a refrigerator. Why? Because these were product experts and hadn't become people experts. Again, you're in the people business, no matter what your job is. You could be selling products on the internet and you are still in the people business. Your communication still needs to relate to people; so it's product second, people first. Most salespeople spend way too much time selling the product and forget that selling is 80% people, 20% product. The reality is this, people buy inferior products every minute of every day. Why? Because people buy for reasons other than just the benefits of the product. We all have people we patronize not because their prices are great, but because they get that they're in the people business. It's the gas station you choose because the owner greets you by name, cleans your windshields for free, gives you a bottle of water for free, knows your dogs by their names. You don't go there for the greater quality of the fuel. You don't go there because it's cheaper. You go there because he takes care of you. Is he in the people business or the gas business? See, this owner understands that he's not in the fuel business, he is in the people business. So, what is important to your buyers? What do they need? What is their ideal scene? Ideal scene means the perfect scene. What is it they're trying to accomplish with a purchase? What is it that really makes them feel good? If they could get everything they wanted, what would that be? These are questions that will let you know how to sell them. This puts you back into the people business and not just in the product business. When buyers go out looking for a product, they don't care how much you know about the product, they don't care how smart you are. They care about what? Themselves, their time, their money, and that they're doing the right thing for themselves. You and your product are way down on the list. Your selling process, your approach, and how you speak to people need to be focused on what they want, not just what your organization wants. Remember, you're in the people business, not the business you thought you were in. 4."
  },
    {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "Your Buyer's Money",
    "subsection_topic": "The People Business, not the 'X' Business",
    "text": "When someone asks you what business you’re in, what do you say? Well, it’s not your industry. You’re not in the software business, the real estate business, or the car business. First and foremost, you’re in the people business. The manufacturers might be pushing product awareness and product knowledge because they believe the weakness of the salesforce is product knowledge, but in reality, the weakness of all salespeople starts with people skills. There are sales people who understood every in and out of the product, every detail, but couldn’t close the door of a refrigerator. Why? Because these were product experts and hadn’t become people experts. Again, you’re in the people business, no matter what your job is. You could be selling products on the internet and you are still in the people business. Your communication still needs to relate to people; so it’s product second, people first. Most salespeople spend way too much time selling the product and forget that selling is 80% people, 20% product. The reality is this, people buy inferior products every minute of every day. Why? Because people buy for reasons other than just the benefits of the product. We all have people we patronize not because their prices are great, but because they get that they’re in the people business. It’s the gas station you choose because the owner greets you by name, cleans your windshields for free, gives you a bottle of water for free, knows your dogs by their names. You don’t go there for the greater quality of the fuel. You don’t go there because it’s cheaper. You go there because he takes care of you. Is he in the people business or the gas business? See, this owner understands that he’s not in the fuel business, he is in the people business. So, what is important to your buyers? What do they need? What is their ideal scene? Ideal scene means the perfect scene. What is it they’re trying to accomplish with a purchase? What is it that really makes them feel good? If they could get everything they wanted, what would that be? These are questions that will let you know how to sell them. This puts you back into the people business and not just in the product business. When buyers go out looking for a product, they don’t care how much you know about the product, they don’t care how smart you are. They care about what? Themselves, their time, their money, and that they’re doing the right thing for themselves. You and your product are way down on the list. Your selling process, your approach, and how you speak to people need to be focused on what they want, not just what your organization wants. Remember, you’re in the people business, not the business you thought you were in."
  },
  {
    "doc_title": "Understanding_The_Buyer",
    "section_topic": "Your Buyer's Money",
    "subsection_topic": "The Most Interesting Person in the World",
    "text": "The Most Interesting Person in the World There's an old saying that goes, “I may not be the most interesting person, but I am the one I'm most interested in.” People are far more concerned-and more interested- in themselves, their family, and doing the right thing than they are in having another product, no matter how much they need or want that product. Be more interested in the customer-the person in front of you-than you are in yourself, your sales process, your product, or even your commission, and I promise you, if it's genuine, you'll make more sales. 90% of all salespeople do not take the time to ask enough questions and then truly listen to the buyer to find out what they really want. Right now, I'm not communicating; I'm talking. I'm giving you a lot of information. That's not communication. Communication requires an exchange of ideas. So if I asked you a question: “Hey what color do you like the most?” For it to be communication, I need to get you to understand the question and give me a color. Finding out what is most important to people, so you can identify what they actually want-and then you deliver it-requires you ask questions and then listen. You have to listen. What do people find value in? What is important to them? Why is it important? How do they want that communicated to them? You have to find what's important to them. Then you have to listen. And only then can you possibly present, demonstrate, and sell. If you don't get into communication, you never have a chance of making a sale. In sales, we're interested in communication that gives access to data, information, which then can be turned into action. To gain information means your communication should include lots of questions. “What do you want this product to do for you that your present one doesn't do for you?” Great question! “What would your present product have to do, so that you would be satisfied with it and not have to replace it?” “On a scale from one to ten, how would you rate what you're using now? Oh really? What would make it a ten?” These open-ended questions are great; they show interest in the customer, and then you're able to discover what the buyer wants, needs, and then can assign value to it."
  }
]